name: "ResNet-50"
layer {
  name: "data"
  type: "DummyData"
  top: "data"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 0.01
    }
    shape {
      dim: 1
      dim: 3
      dim: 224
      dim: 224
    }
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "msra"
      variance_norm: FAN_OUT
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 107.655629139
    scale_out: 36.3122416624
    scale_params: 1629.96413222
    scale_params: 250.628354807
    scale_params: 309.605453236
    scale_params: 159.631326843
    scale_params: 822.373506278
    scale_params: 613.281454451
    scale_params: 201.263328755
    scale_params: 448.854206982
    scale_params: 332.76920822
    scale_params: 1569.89514441
    scale_params: 812.354535047
    scale_params: 245.707504129
    scale_params: 1143.53598512
    scale_params: 334.262174522
    scale_params: 799.239823082
    scale_params: 385.446604763
    scale_params: 4434.43711721
    scale_params: 2567.22559952
    scale_params: 495.852263606
    scale_params: 582.763291794
    scale_params: 3469.66554599
    scale_params: 621.870162851
    scale_params: 353.605339164
    scale_params: 1711.31216494
    scale_params: 262.644472144
    scale_params: 1467.74784668
    scale_params: 616.633582655
    scale_params: 1273.78752736
    scale_params: 717.371953307
    scale_params: 1726.48966521
    scale_params: 271.959537669
    scale_params: 479.378308933
    scale_params: 615.289933821
    scale_params: 382.293553806
    scale_params: 325.264849467
    scale_params: 744.046305541
    scale_params: 389.720787583
    scale_params: 400.989047878
    scale_params: 609.853054681
    scale_params: 300.455579644
    scale_params: 637.329497265
    scale_params: 383.469457111
    scale_params: 842.381223895
    scale_params: 2123.33090938
    scale_params: 557.253981393
    scale_params: 256.113546896
    scale_params: 1631.06792026
    scale_params: 714.779209639
    scale_params: 285.793519198
    scale_params: 1812.72539424
    scale_params: 811.889835641
    scale_params: 252.119817786
    scale_params: 1625.48342633
    scale_params: 331.476348292
    scale_params: 264.321727461
    scale_params: 521.991475128
    scale_params: 288.730549096
    scale_params: 2102.26113081
    scale_params: 864.453910974
    scale_params: 2079.20212628
    scale_params: 461.106883007
    scale_params: 2632.11190549
    scale_params: 442.013275916
    scale_params: 532.260812507
    is_negative_input: true
  }
}
layer {
  name: "bn_conv1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale_conv1"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
  relu_param {
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "res2a_branch1"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch1"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 36.3122416624
    scale_out: 33.7574230934
    scale_params: 773.957880502
    scale_params: 695.049911034
    scale_params: 1377.22371973
    scale_params: 1556.16334042
    scale_params: 5208466386.92
    scale_params: 495.107941199
    scale_params: 559.404794255
    scale_params: 404.484613893
    scale_params: 438.843343676
    scale_params: 817.581707132
    scale_params: 816.039094079
    scale_params: 745.572833757
    scale_params: 640.115228206
    scale_params: 522.893788118
    scale_params: 3164.97582697
    scale_params: 474.980807998
    scale_params: 415.691873499
    scale_params: 1939.43212094
    scale_params: 304.036990604
    scale_params: 559564.9971
    scale_params: 550.82978895
    scale_params: 193.508922935
    scale_params: 449.576637531
    scale_params: 272.014915263
    scale_params: 852.88658708
    scale_params: 487.998011094
    scale_params: 641.307288938
    scale_params: 533.007439054
    scale_params: 4457.34085287
    scale_params: 239.489818875
    scale_params: 3080.92323598
    scale_params: 3945.94583879
    scale_params: 755.652054968
    scale_params: 606.867312796
    scale_params: 2431724114.91
    scale_params: 579.188562725
    scale_params: 356.381675979
    scale_params: 3717.3292247
    scale_params: 5201.46561782
    scale_params: 2698.18840566
    scale_params: 884.858092562
    scale_params: 17275.950676
    scale_params: 1026.10378428
    scale_params: 351962.223188
    scale_params: 1063.48540329
    scale_params: 365.607380006
    scale_params: 1902.77938683
    scale_params: 2.87017923175e+13
    scale_params: 491.034263174
    scale_params: 11449.0006769
    scale_params: 54613.5815848
    scale_params: 601.636057734
    scale_params: 1870.48830729
    scale_params: 1024.10083424
    scale_params: 327.146269193
    scale_params: 301.294576035
    scale_params: 3092085488.27
    scale_params: 3764.32067341
    scale_params: 478.540354584
    scale_params: 1.80934884241e+11
    scale_params: 2352.52563282
    scale_params: 285.635441692
    scale_params: 2.12422356686e+12
    scale_params: 777.220838187
    scale_params: 708.881749486
    scale_params: 5860.97418803
    scale_params: 325.754748557
    scale_params: 289.194011651
    scale_params: 436.807245727
    scale_params: 685.110147432
    scale_params: 42820975125.9
    scale_params: 417.430881426
    scale_params: 1599334.26148
    scale_params: 912.508303322
    scale_params: 355.422394896
    scale_params: 715.258799488
    scale_params: 1383.89630519
    scale_params: 442.432766961
    scale_params: 877.369912607
    scale_params: 480.106127312
    scale_params: 123.601385083
    scale_params: 7839.05801346
    scale_params: 585.917624197
    scale_params: 875.603933323
    scale_params: 18109.7642239
    scale_params: 23518523.6283
    scale_params: 575.172354665
    scale_params: 634.597816472
    scale_params: 1056.73560321
    scale_params: 838.842966332
    scale_params: 10036401045.4
    scale_params: 396.785248802
    scale_params: 326.028298442
    scale_params: 8353.74539903
    scale_params: 2444.04069814
    scale_params: 256.143027084
    scale_params: 324.084217229
    scale_params: 7684.96909101
    scale_params: 414.338723558
    scale_params: 1342.9461431
    scale_params: 682.350376268
    scale_params: 617.174957145
    scale_params: 223.994896712
    scale_params: 48051322713.9
    scale_params: 496.044006166
    scale_params: 2031771.41617
    scale_params: 484.430591038
    scale_params: 2656.2698399
    scale_params: 64903999869.7
    scale_params: 635.238149712
    scale_params: 500992558.72
    scale_params: 925.184723534
    scale_params: 570.818714503
    scale_params: 489.999433583
    scale_params: 1619.33331769
    scale_params: 436.468882148
    scale_params: 619.63047574
    scale_params: 597.847475559
    scale_params: 13639165553.3
    scale_params: 669.107187072
    scale_params: 1206.89140559
    scale_params: 586.87733407
    scale_params: 5.99801749282e+11
    scale_params: 314.406893115
    scale_params: 311.795860446
    scale_params: 525.956721943
    scale_params: 175.790722301
    scale_params: 1323.75910043
    scale_params: 947.23228449
    scale_params: 203.337604107
    scale_params: 563.960221696
    scale_params: 440.351790976
    scale_params: 50946591117.1
    scale_params: 227.320865415
    scale_params: 2056.94204755
    scale_params: 495.339524497
    scale_params: 976.59210261
    scale_params: 379.594126081
    scale_params: 464.389724393
    scale_params: 262.304325774
    scale_params: 194.893545839
    scale_params: 15582875.5874
    scale_params: 402.290185212
    scale_params: 2042123.11004
    scale_params: 537.785503057
    scale_params: 374.864144837
    scale_params: 377.201670574
    scale_params: 470.011813017
    scale_params: 374.468162525
    scale_params: 482.641905907
    scale_params: 2497.71396561
    scale_params: 392.491317995
    scale_params: 507.811612399
    scale_params: 602.521716145
    scale_params: 526.155502471
    scale_params: 442.457389335
    scale_params: 280.087833239
    scale_params: 386.962670392
    scale_params: 676.789284103
    scale_params: 1341.32337453
    scale_params: 214.924344176
    scale_params: 222.731976791
    scale_params: 234.863951055
    scale_params: 2779.7838841
    scale_params: 494.785960958
    scale_params: 126319.788377
    scale_params: 498.61713132
    scale_params: 1550.81882798
    scale_params: 134.004949244
    scale_params: 1462.73911747
    scale_params: 731.641415064
    scale_params: 459.307316559
    scale_params: 8283774009.17
    scale_params: 347.309978803
    scale_params: 2335.1456617
    scale_params: 328.336329295
    scale_params: 393.850616519
    scale_params: 67598.1354455
    scale_params: 262.222750706
    scale_params: 626.211696504
    scale_params: 1517.90259222
    scale_params: 1020.29024792
    scale_params: 639.189078591
    scale_params: 629.040409091
    scale_params: 429.938546638
    scale_params: 89645150.8465
    scale_params: 620.078989332
    scale_params: 5946.838778
    scale_params: 200.616189537
    scale_params: 1367.46054881
    scale_params: 2040.23794597
    scale_params: 545.996779558
    scale_params: 2192.38747222
    scale_params: 1363.01695058
    scale_params: 2731.89337673
    scale_params: 2112.42890495
    scale_params: 326.227718723
    scale_params: 2.64465437015e+11
    scale_params: 302.057232493
    scale_params: 4241845.07526
    scale_params: 2.13247538022e+12
    scale_params: 98.5373776808
    scale_params: 12641512725.0
    scale_params: 450.956712773
    scale_params: 715.830948903
    scale_params: 1074.34338862
    scale_params: 1072.58120668
    scale_params: 2091.0843052
    scale_params: 435.137715146
    scale_params: 3441.49722849
    scale_params: 1348.52340993
    scale_params: 1342.68517446
    scale_params: 586.175973171
    scale_params: 705.290684344
    scale_params: 149440658.117
    scale_params: 1782.10358137
    scale_params: 6.35749278285e+12
    scale_params: 997.026142084
    scale_params: 137.659403869
    scale_params: 195.264332507
    scale_params: 5754679676.54
    scale_params: 659.301624787
    scale_params: 923.513641744
    scale_params: 1.31702726675e+11
    scale_params: 402.197124131
    scale_params: 603.754727614
    scale_params: 1.68410884936e+12
    scale_params: 211102987.863
    scale_params: 1195.46383914
    scale_params: 350.668601562
    scale_params: 266.893626232
    scale_params: 356.680773262
    scale_params: 2334.9769266
    scale_params: 1.52751633107e+12
    scale_params: 628.441649479
    scale_params: 522.665858152
    scale_params: 670.915417037
    scale_params: 163.279380008
    scale_params: 49709.7712996
    scale_params: 217503980.239
    scale_params: 358.474765225
    scale_params: 307.128345949
    scale_params: 480.146211708
    scale_params: 4.43788313935e+11
    scale_params: 558.945876433
    scale_params: 327.086356171
    scale_params: 2672.94298766
    scale_params: 514.209698678
    scale_params: 2974110.05916
    scale_params: 636.217650755
    scale_params: 140.077005765
    scale_params: 173.161645791
    scale_params: 528.312875725
    scale_params: 242.436986941
    scale_params: 787.270775604
    scale_params: 1080.67447842
  }
}
layer {
  name: "bn2a_branch1"
  type: "BatchNorm"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2a_branch1"
  type: "Scale"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 36.3122416624
    scale_out: 125.953814276
    scale_params: 462.316237498
    scale_params: 352.847050283
    scale_params: 723.545089251
    scale_params: 254.965092073
    scale_params: 1058.79964325
    scale_params: 328.375697529
    scale_params: 476.037754929
    scale_params: 1137.71813341
    scale_params: 740.714006936
    scale_params: 157.433560091
    scale_params: 1075.55308928
    scale_params: 332.713816155
    scale_params: 407.229935428
    scale_params: 528.931968015
    scale_params: 273.985460825
    scale_params: 733.477673354
    scale_params: 979.10721104
    scale_params: 256.453079621
    scale_params: 828.480493907
    scale_params: 799.083658167
    scale_params: 994.357924607
    scale_params: 276.441013619
    scale_params: 221.978276261
    scale_params: 416.4620422
    scale_params: 355.230642806
    scale_params: 293.372547589
    scale_params: 327.288304997
    scale_params: 555.778260872
    scale_params: 581.879104993
    scale_params: 177.170644159
    scale_params: 722.100123944
    scale_params: 302.493713908
    scale_params: 787.563007529
    scale_params: 364.681917012
    scale_params: 215.924036153
    scale_params: 549.267189118
    scale_params: 269.182979253
    scale_params: 866.955358771
    scale_params: 940.327194655
    scale_params: 151.171998549
    scale_params: 520.878991829
    scale_params: 451.867072971
    scale_params: 254.441296867
    scale_params: 277.244441888
    scale_params: 396.039143204
    scale_params: 314.682505259
    scale_params: 569.610928199
    scale_params: 490.345170706
    scale_params: 849.136606584
    scale_params: 340.883467705
    scale_params: 229.821554947
    scale_params: 242.399642505
    scale_params: 267.48027761
    scale_params: 391.646330847
    scale_params: 390.361565102
    scale_params: 352.891376381
    scale_params: 327.551949271
    scale_params: 247.204548355
    scale_params: 478.15557592
    scale_params: 1903.35007585
    scale_params: 509.607900513
    scale_params: 408.280093824
    scale_params: 874.679349826
    scale_params: 292.167319346
  }
}
layer {
  name: "bn2a_branch2a"
  type: "BatchNorm"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2a_branch2a"
  type: "Scale"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a_relu"
  type: "ReLU"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  relu_param {
  }
}
layer {
  name: "res2a_branch2b"
  type: "Convolution"
  bottom: "res2a_branch2a"
  top: "res2a_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 125.953814276
    scale_out: 124.288816014
    scale_params: 945.781070784
    scale_params: 1101.30091689
    scale_params: 543.517263643
    scale_params: 971.273481238
    scale_params: 550.995877887
    scale_params: 544.627087875
    scale_params: 981.879243091
    scale_params: 994.279042891
    scale_params: 985.920326572
    scale_params: 736.794907565
    scale_params: 1313.80873557
    scale_params: 644.910552717
    scale_params: 394.956947191
    scale_params: 946.775081052
    scale_params: 1349.71324983
    scale_params: 735.996393777
    scale_params: 1011.25895214
    scale_params: 444.1714955
    scale_params: 1274.50126294
    scale_params: 379.469058725
    scale_params: 1046.33837038
    scale_params: 232.642940296
    scale_params: 496.988196246
    scale_params: 420.458661452
    scale_params: 264.44346739
    scale_params: 939.827090334
    scale_params: 886.015301776
    scale_params: 600.626497185
    scale_params: 945.965300354
    scale_params: 730.306866088
    scale_params: 814.338782945
    scale_params: 1022.73581461
    scale_params: 1144.97483778
    scale_params: 530.064351488
    scale_params: 369.020876972
    scale_params: 833.144493945
    scale_params: 403.61233216
    scale_params: 792.657821044
    scale_params: 224.651447799
    scale_params: 762.803304242
    scale_params: 701.919197178
    scale_params: 629.930424487
    scale_params: 639.403958593
    scale_params: 850.904108144
    scale_params: 476.754283996
    scale_params: 1215.90931068
    scale_params: 755.985784018
    scale_params: 603.755754092
    scale_params: 1071.55059584
    scale_params: 305.24063102
    scale_params: 765.148048626
    scale_params: 297.785515274
    scale_params: 293.251133529
    scale_params: 623.313295529
    scale_params: 423.611815528
    scale_params: 235.572817896
    scale_params: 460.768250834
    scale_params: 218.141829949
    scale_params: 718.695602621
    scale_params: 602.587873929
    scale_params: 794.288991786
    scale_params: 719.665494192
    scale_params: 455.752774705
    scale_params: 1008.07311548
  }
}
layer {
  name: "bn2a_branch2b"
  type: "BatchNorm"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2a_branch2b"
  type: "Scale"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2b_relu"
  type: "ReLU"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  relu_param {
  }
}
layer {
  name: "res2a_branch2c"
  type: "Convolution"
  bottom: "res2a_branch2b"
  top: "res2a_branch2c"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 124.288816014
    scale_out: 67.7806526679
    scale_params: 549.365118566
    scale_params: 313.973546258
    scale_params: 1225.70561712
    scale_params: 322.695890899
    scale_params: 2643231319.31
    scale_params: 441.079274067
    scale_params: 863.013629474
    scale_params: 392.596361415
    scale_params: 392.029902148
    scale_params: 677.368001382
    scale_params: 1984.00835801
    scale_params: 670.477344161
    scale_params: 935.109422327
    scale_params: 767.752694079
    scale_params: 572.380112221
    scale_params: 615.431221031
    scale_params: 312.405067055
    scale_params: 760.270256758
    scale_params: 520.158410668
    scale_params: 46979.2577581
    scale_params: 245.089362622
    scale_params: 225.722526229
    scale_params: 657.545075354
    scale_params: 1293.3043278
    scale_params: 593.990621683
    scale_params: 739.21241937
    scale_params: 314.994058048
    scale_params: 818.153700268
    scale_params: 8497.76422795
    scale_params: 660.064931954
    scale_params: 220.284247392
    scale_params: 144.214446309
    scale_params: 298.096540624
    scale_params: 259.685549744
    scale_params: 5383244903.56
    scale_params: 604.165854325
    scale_params: 10700.9398315
    scale_params: 152.235812111
    scale_params: 1103.99768911
    scale_params: 1029.17432919
    scale_params: 348.164914341
    scale_params: 537.618328473
    scale_params: 559.938619538
    scale_params: 316880.905061
    scale_params: 382.703656033
    scale_params: 544.703421233
    scale_params: 265.395370835
    scale_params: 3.67789204779e+12
    scale_params: 209.30263073
    scale_params: 249.919528196
    scale_params: 64942.8350816
    scale_params: 443.85417496
    scale_params: 477.121905096
    scale_params: 1934.03095602
    scale_params: 248.044957387
    scale_params: 253.759055272
    scale_params: 12655090742.8
    scale_params: 335.803179301
    scale_params: 1065.95281446
    scale_params: 8.24493623509e+11
    scale_params: 3508.77385463
    scale_params: 571.712033702
    scale_params: 3.56181256395e+11
    scale_params: 1534.69179858
    scale_params: 649.984760774
    scale_params: 132.406515298
    scale_params: 1023.1625334
    scale_params: 289.998364299
    scale_params: 460.636910597
    scale_params: 531.356121618
    scale_params: 2867406182.05
    scale_params: 522.992230128
    scale_params: 96004.9476619
    scale_params: 269.783318953
    scale_params: 298.726680073
    scale_params: 416.801596231
    scale_params: 134.495793287
    scale_params: 531.590303215
    scale_params: 394.679233928
    scale_params: 676.61767192
    scale_params: 168.595103232
    scale_params: 169.478110648
    scale_params: 292.661304316
    scale_params: 599.73757711
    scale_params: 409.114120357
    scale_params: 97568304.4641
    scale_params: 324.665544529
    scale_params: 709.254873365
    scale_params: 1300.76174306
    scale_params: 131.676117651
    scale_params: 13079070106.2
    scale_params: 1155.93996883
    scale_params: 558.089418977
    scale_params: 163.755344551
    scale_params: 274.220533286
    scale_params: 1395.51564612
    scale_params: 1218.82891471
    scale_params: 681.362295805
    scale_params: 268.474302329
    scale_params: 966.069964258
    scale_params: 588.221683014
    scale_params: 848.565769871
    scale_params: 1888.63134538
    scale_params: 9592606254.71
    scale_params: 359.402293205
    scale_params: 418249.041354
    scale_params: 790.485426036
    scale_params: 186.059509697
    scale_params: 55395344415.9
    scale_params: 344.785326918
    scale_params: 211068207.017
    scale_params: 699.86338532
    scale_params: 589.724287222
    scale_params: 804.360465429
    scale_params: 553.209999836
    scale_params: 571.352378981
    scale_params: 364.152016387
    scale_params: 484.190772907
    scale_params: 6018668537.48
    scale_params: 439.556416361
    scale_params: 1219.34733439
    scale_params: 457.667629526
    scale_params: 50098948690.7
    scale_params: 486.487424361
    scale_params: 257.349441852
    scale_params: 625.462252181
    scale_params: 878.391893442
    scale_params: 462.436141922
    scale_params: 370.626576891
    scale_params: 641.165496751
    scale_params: 249.569890251
    scale_params: 244.475080874
    scale_params: 35165030889.2
    scale_params: 1250.10314743
    scale_params: 336.516747411
    scale_params: 703.600698647
    scale_params: 326.106689689
    scale_params: 266.201409925
    scale_params: 506.528769794
    scale_params: 2007.64435772
    scale_params: 1652.76965838
    scale_params: 6371437.98318
    scale_params: 1001.10434156
    scale_params: 214618.980818
    scale_params: 313.16535138
    scale_params: 625.194995285
    scale_params: 244.687638287
    scale_params: 174.135083369
    scale_params: 3047.85575691
    scale_params: 634.769905022
    scale_params: 622.278623705
    scale_params: 408.731843984
    scale_params: 224.048433937
    scale_params: 1531.03420718
    scale_params: 369.454961856
    scale_params: 211.724351566
    scale_params: 925.888485246
    scale_params: 474.490966951
    scale_params: 1376.89587204
    scale_params: 222.868313121
    scale_params: 6457.46460004
    scale_params: 201.738392479
    scale_params: 1030.91791588
    scale_params: 288.754985148
    scale_params: 910.338208616
    scale_params: 71435.2257769
    scale_params: 240.887487105
    scale_params: 252.408210379
    scale_params: 4283.72491294
    scale_params: 4300.93007836
    scale_params: 840.023107566
    scale_params: 133.211854725
    scale_params: 1027560165.85
    scale_params: 296.829564453
    scale_params: 98.1348959947
    scale_params: 272.484149942
    scale_params: 269.027808631
    scale_params: 32817.6538676
    scale_params: 719.765836798
    scale_params: 307.927357862
    scale_params: 306.387232346
    scale_params: 727.573927821
    scale_params: 328.536228345
    scale_params: 340.297363131
    scale_params: 2085.01221646
    scale_params: 25384430.7649
    scale_params: 3586.05513477
    scale_params: 355.289639637
    scale_params: 731.166018571
    scale_params: 294.299070047
    scale_params: 325.310015677
    scale_params: 365.511327395
    scale_params: 536.180412953
    scale_params: 738.591737517
    scale_params: 850.344637372
    scale_params: 440.792159894
    scale_params: 568.66332948
    scale_params: 2.17658260322e+11
    scale_params: 480.842886804
    scale_params: 746730.215059
    scale_params: 2.77855323989e+12
    scale_params: 518.133885179
    scale_params: 1.63803302939e+11
    scale_params: 2131.64688796
    scale_params: 731.994941977
    scale_params: 555.560600529
    scale_params: 389.182102134
    scale_params: 201.910255725
    scale_params: 339.600486823
    scale_params: 384.038908808
    scale_params: 566.247775242
    scale_params: 560.619827325
    scale_params: 219.144383181
    scale_params: 918.378948597
    scale_params: 50167716.7745
    scale_params: 837.98413333
    scale_params: 1.5107413873e+12
    scale_params: 15890.662489
    scale_params: 112.002075715
    scale_params: 956.979047202
    scale_params: 4479473956.62
    scale_params: 351.472761108
    scale_params: 580.905645716
    scale_params: 43565376662.4
    scale_params: 489.692501985
    scale_params: 405.220520828
    scale_params: 4.36640636578e+11
    scale_params: 60120441.4194
    scale_params: 434.980880865
    scale_params: 345.684049755
    scale_params: 217.651355391
    scale_params: 377.03970699
    scale_params: 368.318806476
    scale_params: 5.12833859199e+12
    scale_params: 281.921571738
    scale_params: 954.365196213
    scale_params: 373.934693337
    scale_params: 1258.60547973
    scale_params: 27688.4156344
    scale_params: 254289180.698
    scale_params: 206.882136475
    scale_params: 880.702580872
    scale_params: 833.925863131
    scale_params: 1.05483963794e+11
    scale_params: 466.0088567
    scale_params: 362.253067526
    scale_params: 340.566468681
    scale_params: 341.999026508
    scale_params: 1627504.09805
    scale_params: 199.507243036
    scale_params: 2181.01229855
    scale_params: 2101.342016
    scale_params: 327.660171279
    scale_params: 199.805159097
    scale_params: 1509.23804817
    scale_params: 359.620122666
  }
}
layer {
  name: "bn2a_branch2c"
  type: "BatchNorm"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2a_branch2c"
  type: "Scale"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a"
  type: "Eltwise"
  bottom: "res2a_branch1"
  bottom: "res2a_branch2c"
  top: "res2a"
  eltwise_param {
  }
}
layer {
  name: "res2a_relu"
  type: "ReLU"
  bottom: "res2a"
  top: "res2a"
  relu_param {
  }
}
layer {
  name: "res2b_branch2a"
  type: "Convolution"
  bottom: "res2a"
  top: "res2b_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 67.7806526679
    scale_out: 98.5925099571
    scale_params: 730.936763801
    scale_params: 934.96847316
    scale_params: 462.308262799
    scale_params: 1016.67870626
    scale_params: 507.579709928
    scale_params: 867.568169623
    scale_params: 1005.38086501
    scale_params: 451.979556509
    scale_params: 1099.09601315
    scale_params: 559.334636615
    scale_params: 548.75640538
    scale_params: 762.865641513
    scale_params: 750.567867146
    scale_params: 742.180083233
    scale_params: 500.749743275
    scale_params: 469.609517349
    scale_params: 573.877806439
    scale_params: 454.667439842
    scale_params: 948.232408586
    scale_params: 452.67183972
    scale_params: 622.560127112
    scale_params: 819.14087041
    scale_params: 723.576294672
    scale_params: 805.415524
    scale_params: 708.878742495
    scale_params: 1020.45785383
    scale_params: 541.604380762
    scale_params: 925.897035056
    scale_params: 573.255154878
    scale_params: 227.677546651
    scale_params: 541.915660353
    scale_params: 548.946843493
    scale_params: 516.863774592
    scale_params: 541.20505252
    scale_params: 1031.38362925
    scale_params: 550.655119061
    scale_params: 465.321343524
    scale_params: 632.511185169
    scale_params: 648.052811871
    scale_params: 982.50563866
    scale_params: 533.840346591
    scale_params: 337.379985907
    scale_params: 507.485291855
    scale_params: 1024.50110632
    scale_params: 794.882664789
    scale_params: 503.602085829
    scale_params: 782.281447362
    scale_params: 635.346734209
    scale_params: 644.490223974
    scale_params: 725.52920985
    scale_params: 955.122632384
    scale_params: 496.095054757
    scale_params: 834.378969503
    scale_params: 822.54279766
    scale_params: 739.337848217
    scale_params: 625.404560419
    scale_params: 676.874800301
    scale_params: 565.138929876
    scale_params: 754.101899006
    scale_params: 1088.36040675
    scale_params: 379.961319566
    scale_params: 708.474328231
    scale_params: 1063.30681558
    scale_params: 447.292824768
  }
}
layer {
  name: "bn2b_branch2a"
  type: "BatchNorm"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2b_branch2a"
  type: "Scale"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2a_relu"
  type: "ReLU"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  relu_param {
  }
}
layer {
  name: "res2b_branch2b"
  type: "Convolution"
  bottom: "res2b_branch2a"
  top: "res2b_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 98.5925099571
    scale_out: 78.379039584
    scale_params: 675.441943099
    scale_params: 1014.05991083
    scale_params: 1083.2834529
    scale_params: 1238.65498299
    scale_params: 863.931566866
    scale_params: 744.367389458
    scale_params: 414.957234528
    scale_params: 874.169594007
    scale_params: 586.293435857
    scale_params: 809.118142685
    scale_params: 748.55448021
    scale_params: 1065.87069622
    scale_params: 880.333065433
    scale_params: 858.331751654
    scale_params: 985.216221179
    scale_params: 786.453504587
    scale_params: 614.289808151
    scale_params: 478.653930456
    scale_params: 284.185111223
    scale_params: 676.03004703
    scale_params: 638.954654507
    scale_params: 665.743037928
    scale_params: 1259.07598478
    scale_params: 729.082814913
    scale_params: 1018.03209381
    scale_params: 810.027334869
    scale_params: 407.506658899
    scale_params: 550.26120206
    scale_params: 498.676705547
    scale_params: 528.150981271
    scale_params: 811.950785039
    scale_params: 868.669059063
    scale_params: 872.568213131
    scale_params: 1014.33218053
    scale_params: 628.296317768
    scale_params: 664.740369472
    scale_params: 886.142798027
    scale_params: 759.519494776
    scale_params: 697.697161641
    scale_params: 1057.11223331
    scale_params: 1118.95074698
    scale_params: 775.051412247
    scale_params: 774.775926092
    scale_params: 634.532805377
    scale_params: 1003.82454347
    scale_params: 786.536607047
    scale_params: 1253.10039197
    scale_params: 1086.68539362
    scale_params: 881.267550666
    scale_params: 859.209260089
    scale_params: 977.216922398
    scale_params: 582.512838579
    scale_params: 749.032291484
    scale_params: 444.558593166
    scale_params: 572.25951234
    scale_params: 946.310543433
    scale_params: 1618.83381143
    scale_params: 687.78746989
    scale_params: 987.534737998
    scale_params: 1071.44444463
    scale_params: 822.332086927
    scale_params: 948.167636977
    scale_params: 729.274338626
    scale_params: 414.561263709
  }
}
layer {
  name: "bn2b_branch2b"
  type: "BatchNorm"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2b_branch2b"
  type: "Scale"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2b_relu"
  type: "ReLU"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  relu_param {
  }
}
layer {
  name: "res2b_branch2c"
  type: "Convolution"
  bottom: "res2b_branch2b"
  top: "res2b_branch2c"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 78.379039584
    scale_out: 67.7806526679
    scale_params: 51745.1065198
    scale_params: 215.846668792
    scale_params: 21913.7340635
    scale_params: 358.849897214
    scale_params: 228.679505894
    scale_params: 715.245894028
    scale_params: 450.428813404
    scale_params: 19328.4830156
    scale_params: 7956.36904985
    scale_params: 237.414615568
    scale_params: 240.430314688
    scale_params: 317.57592422
    scale_params: 254.528393353
    scale_params: 370.432079979
    scale_params: 217.49017403
    scale_params: 335.796722797
    scale_params: 11654.4838817
    scale_params: 244.104726764
    scale_params: 6022.56794002
    scale_params: 352.583573613
    scale_params: 884.606354369
    scale_params: 5178.47479043
    scale_params: 25158.3496982
    scale_params: 31578.8135583
    scale_params: 498.326174979
    scale_params: 261.001652156
    scale_params: 568.9764142
    scale_params: 301.080936506
    scale_params: 125.240533868
    scale_params: 2824.68443805
    scale_params: 217.572412224
    scale_params: 291.031330131
    scale_params: 248.668016887
    scale_params: 109.929142016
    scale_params: 289.222334298
    scale_params: 417.826087647
    scale_params: 79039.7877022
    scale_params: 800.594209172
    scale_params: 114.738492771
    scale_params: 181.476044885
    scale_params: 340.768788507
    scale_params: 159.77228615
    scale_params: 639.775699948
    scale_params: 237.282339964
    scale_params: 742.382495338
    scale_params: 1615.3031694
    scale_params: 322.379240274
    scale_params: 3.6649817077e+13
    scale_params: 1102.35507307
    scale_params: 169.373742102
    scale_params: 170.837413658
    scale_params: 538.026678034
    scale_params: 249.658875401
    scale_params: 366.746664142
    scale_params: 14529.8203307
    scale_params: 503.191236889
    scale_params: 223.638548633
    scale_params: 223.262977678
    scale_params: 260.063920582
    scale_params: 319.850922629
    scale_params: 191.821535839
    scale_params: 12943.7816218
    scale_params: 123.83522659
    scale_params: 6170.63737986
    scale_params: 379.988153294
    scale_params: 229.937327995
    scale_params: 531.348999315
    scale_params: 3646.13372319
    scale_params: 276.157730731
    scale_params: 484.400690258
    scale_params: 13180981255.5
    scale_params: 691.583807828
    scale_params: 158.422229694
    scale_params: 399.26200968
    scale_params: 308.063926216
    scale_params: 113.179176964
    scale_params: 233.593080044
    scale_params: 577.427178224
    scale_params: 23184.2475635
    scale_params: 3775.47773217
    scale_params: 865.839629976
    scale_params: 426.800607979
    scale_params: 44446.7044613
    scale_params: 7792.64068464
    scale_params: 271.970663456
    scale_params: 192.097582789
    scale_params: 760.530228638
    scale_params: 291.787039515
    scale_params: 209.162032302
    scale_params: 1627.64243843
    scale_params: 230.600052057
    scale_params: 885.613063244
    scale_params: 384.328186095
    scale_params: 188.717950462
    scale_params: 417.498646911
    scale_params: 11971.6343552
    scale_params: 211.472167381
    scale_params: 297.140335455
    scale_params: 488.429308512
    scale_params: 231.173793627
    scale_params: 336.916472022
    scale_params: 222.539731009
    scale_params: 13606.3599467
    scale_params: 115.915959741
    scale_params: 1754.5722081
    scale_params: 250.108952892
    scale_params: 249.175704419
    scale_params: 335.595663494
    scale_params: 194.876362402
    scale_params: 1611.07845184
    scale_params: 126.588015151
    scale_params: 169.069227161
    scale_params: 371.431149516
    scale_params: 18036.4846108
    scale_params: 254.702780552
    scale_params: 345.47820577
    scale_params: 154958.827948
    scale_params: 271.340258154
    scale_params: 457.904913937
    scale_params: 207.602031994
    scale_params: 280.088772112
    scale_params: 8579.20180785
    scale_params: 220.592973907
    scale_params: 710.646586384
    scale_params: 42542.8461072
    scale_params: 268.423163487
    scale_params: 289281.003086
    scale_params: 697.896950048
    scale_params: 99.0964208475
    scale_params: 769.137640191
    scale_params: 370.272112253
    scale_params: 1019.08192842
    scale_params: 7125781162.19
    scale_params: 12839.0166578
    scale_params: 534.24434804
    scale_params: 286352.610723
    scale_params: 896.305797229
    scale_params: 356.580550947
    scale_params: 715.855118982
    scale_params: 9753.39094745
    scale_params: 19240.0460479
    scale_params: 354.412487351
    scale_params: 485.343152997
    scale_params: 126.610084899
    scale_params: 8399.66770024
    scale_params: 9999.93705528
    scale_params: 53484.8699603
    scale_params: 989.288320939
    scale_params: 128686.185258
    scale_params: 3071.13222724
    scale_params: 8112.98703266
    scale_params: 3569.18429322
    scale_params: 309.067235665
    scale_params: 293.050094883
    scale_params: 6432.13440816
    scale_params: 3158.30555943
    scale_params: 1379.93557708
    scale_params: 326.602809447
    scale_params: 954.001130763
    scale_params: 325.433510814
    scale_params: 6951.72111469
    scale_params: 13758.2833483
    scale_params: 7028.85346688
    scale_params: 261.542400993
    scale_params: 495.776750125
    scale_params: 222.282241573
    scale_params: 29351.1002256
    scale_params: 195.807725059
    scale_params: 6299.33404265
    scale_params: 250.933673956
    scale_params: 343.791027577
    scale_params: 25894.2437637
    scale_params: 185.273197535
    scale_params: 501.203001658
    scale_params: 173.012097006
    scale_params: 713.278382353
    scale_params: 10180.3654749
    scale_params: 252.684377329
    scale_params: 488.626221219
    scale_params: 4456.52976428
    scale_params: 179.7010102
    scale_params: 321.608152433
    scale_params: 521.997517537
    scale_params: 424677.352235
    scale_params: 157.134303738
    scale_params: 343.49296355
    scale_params: 10403.0121847
    scale_params: 495.203563912
    scale_params: 8012.93653427
    scale_params: 418.226557905
    scale_params: 279.185568874
    scale_params: 12503.1265009
    scale_params: 6846.21642253
    scale_params: 98.351239572
    scale_params: 183.418367796
    scale_params: 6177.43284872
    scale_params: 31865.702658
    scale_params: 139.737064786
    scale_params: 9443.63241909
    scale_params: 281.310306631
    scale_params: 154.50326173
    scale_params: 2257.42635499
    scale_params: 309.313219446
    scale_params: 299.879466186
    scale_params: 110.513234422
    scale_params: 178.363481864
    scale_params: 246.579003758
    scale_params: 338.347999402
    scale_params: 1488.72983804
    scale_params: 190.731331378
    scale_params: 160.078052521
    scale_params: 232.449948954
    scale_params: 291.035523997
    scale_params: 242.877048981
    scale_params: 273.045898342
    scale_params: 438.521629031
    scale_params: 184.127813197
    scale_params: 9024.42110165
    scale_params: 808.027703505
    scale_params: 9799.59682393
    scale_params: 484.455648864
    scale_params: 1182.69496191
    scale_params: 176.049334316
    scale_params: 936.892387415
    scale_params: 516.592406561
    scale_params: 457.171480627
    scale_params: 202.045964726
    scale_params: 291.371803904
    scale_params: 154.564849214
    scale_params: 646.684449248
    scale_params: 60814.2318631
    scale_params: 3611.503413
    scale_params: 378.294083302
    scale_params: 516.251454913
    scale_params: 535.093793884
    scale_params: 299.963056522
    scale_params: 891.619393868
    scale_params: 72700.1281764
    scale_params: 124.43418341
    scale_params: 7018873.56039
    scale_params: 875.234548556
    scale_params: 32159.956806
    scale_params: 394.517329585
    scale_params: 227.97388906
    scale_params: 709991.764338
    scale_params: 915.539976387
    scale_params: 203.576020466
    scale_params: 430.434613408
    scale_params: 137.591204315
    scale_params: 2647.37428497
    scale_params: 76.5799819013
    scale_params: 13591.7648424
    scale_params: 1513.86400026
    scale_params: 4217.17913562
    scale_params: 170.604585692
    scale_params: 219.536045604
  }
}
layer {
  name: "bn2b_branch2c"
  type: "BatchNorm"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2b_branch2c"
  type: "Scale"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b"
  type: "Eltwise"
  bottom: "res2a"
  bottom: "res2b_branch2c"
  top: "res2b"
  eltwise_param {
  }
}
layer {
  name: "res2b_relu"
  type: "ReLU"
  bottom: "res2b"
  top: "res2b"
  relu_param {
  }
}
layer {
  name: "res2c_branch2a"
  type: "Convolution"
  bottom: "res2b"
  top: "res2c_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 67.7806526679
    scale_out: 83.6919147579
    scale_params: 901.576540634
    scale_params: 807.837762617
    scale_params: 477.69777406
    scale_params: 462.204466344
    scale_params: 897.94325679
    scale_params: 988.301179322
    scale_params: 434.209728148
    scale_params: 719.438413612
    scale_params: 859.299959992
    scale_params: 910.517058627
    scale_params: 997.502007279
    scale_params: 1147.65778066
    scale_params: 909.764884323
    scale_params: 665.480993231
    scale_params: 608.635758078
    scale_params: 202.080418792
    scale_params: 720.491737254
    scale_params: 889.842746128
    scale_params: 1131.49429043
    scale_params: 791.477400646
    scale_params: 910.617260902
    scale_params: 983.105957184
    scale_params: 792.706995627
    scale_params: 579.372432811
    scale_params: 747.839987927
    scale_params: 701.050258426
    scale_params: 672.5739693
    scale_params: 599.450989852
    scale_params: 827.476402461
    scale_params: 697.910608621
    scale_params: 695.933976128
    scale_params: 878.600614918
    scale_params: 433.27617516
    scale_params: 658.909909564
    scale_params: 625.407635206
    scale_params: 783.495002278
    scale_params: 918.809924172
    scale_params: 585.104815264
    scale_params: 688.671452477
    scale_params: 845.221172517
    scale_params: 671.467992981
    scale_params: 678.809861654
    scale_params: 563.355654165
    scale_params: 804.884760489
    scale_params: 633.11227272
    scale_params: 1054.99631716
    scale_params: 670.32647352
    scale_params: 1195.24379559
    scale_params: 1148.85586592
    scale_params: 811.619231855
    scale_params: 522.11126239
    scale_params: 685.180041952
    scale_params: 1129.7386454
    scale_params: 651.602792003
    scale_params: 467.565535562
    scale_params: 850.487194334
    scale_params: 529.770386989
    scale_params: 423.425099075
    scale_params: 1143.22253269
    scale_params: 993.668017852
    scale_params: 535.17235081
    scale_params: 1030.6068846
    scale_params: 890.143769877
    scale_params: 640.396118082
  }
}
layer {
  name: "bn2c_branch2a"
  type: "BatchNorm"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2c_branch2a"
  type: "Scale"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2a_relu"
  type: "ReLU"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  relu_param {
  }
}
layer {
  name: "res2c_branch2b"
  type: "Convolution"
  bottom: "res2c_branch2a"
  top: "res2c_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 83.6919147579
    scale_out: 113.967005061
    scale_params: 395.282894767
    scale_params: 770.333215744
    scale_params: 771.438097366
    scale_params: 679.782306331
    scale_params: 780.291405202
    scale_params: 742.270705729
    scale_params: 952.525499043
    scale_params: 644.553294408
    scale_params: 843.288312643
    scale_params: 627.871317857
    scale_params: 714.892765401
    scale_params: 720.246544174
    scale_params: 733.915126575
    scale_params: 971.36989982
    scale_params: 564.441730548
    scale_params: 830.686064229
    scale_params: 827.140640466
    scale_params: 610.406364915
    scale_params: 658.608425215
    scale_params: 699.246985762
    scale_params: 845.510037401
    scale_params: 784.857938821
    scale_params: 705.868679568
    scale_params: 767.539738352
    scale_params: 681.158795084
    scale_params: 1071.25489312
    scale_params: 807.911966794
    scale_params: 838.005143959
    scale_params: 565.676664341
    scale_params: 828.228578656
    scale_params: 892.397163916
    scale_params: 968.016825189
    scale_params: 799.148619555
    scale_params: 836.646897262
    scale_params: 1013.82637746
    scale_params: 667.661486277
    scale_params: 962.836303751
    scale_params: 827.028432581
    scale_params: 706.244665289
    scale_params: 732.368256348
    scale_params: 744.64470233
    scale_params: 598.359586994
    scale_params: 939.465434889
    scale_params: 928.102010333
    scale_params: 686.111731673
    scale_params: 780.136343856
    scale_params: 674.700145186
    scale_params: 578.232708042
    scale_params: 722.72966644
    scale_params: 660.564597648
    scale_params: 839.360698779
    scale_params: 891.907340202
    scale_params: 612.802530466
    scale_params: 800.138281143
    scale_params: 452.131908295
    scale_params: 785.716367829
    scale_params: 866.878289244
    scale_params: 666.928842017
    scale_params: 786.352571424
    scale_params: 700.647294273
    scale_params: 776.690190331
    scale_params: 1065.6268823
    scale_params: 651.021442287
    scale_params: 629.113958541
  }
}
layer {
  name: "bn2c_branch2b"
  type: "BatchNorm"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2c_branch2b"
  type: "Scale"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  param {
