name: "VGG_ILSVRC_16_layers"
input: "data"
input: "im_info"
input_shape {
  dim: 1
  dim: 3
  dim: 600
  dim: 800
}
input_shape {
  dim: 1
  dim: 3
}
layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "data"
  top: "conv1_1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu1_1"
  type: "ReLU"
  bottom: "conv1_1"
  top: "conv1_1"
}
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "conv1_1"
  top: "conv1_2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 0.30863244031360554
    scale_out: 0.06049258646116979
    scale_params: 572.3605468367787
    scale_params: 758.419512184704
    scale_params: 788.4878355478455
    scale_params: 617.03599529876
    scale_params: 546.7713130818305
    scale_params: 513.2287043971045
    scale_params: 706.5540364061421
    scale_params: 1045.4495553221927
    scale_params: 1410.027002163889
    scale_params: 1591.4322927690303
    scale_params: 513.1831843718887
    scale_params: 1370.9589989140522
    scale_params: 984.9178100887553
    scale_params: 552.7532987523073
    scale_params: 1829.3031309346786
    scale_params: 616.3607106597002
    scale_params: 1109.0786414387217
    scale_params: 604.7501658076787
    scale_params: 439.18657705421447
    scale_params: 514.2451925116211
    scale_params: 512.9460423053421
    scale_params: 896.4521130901198
    scale_params: 1701.3411042075268
    scale_params: 2054.689966245669
    scale_params: 915.776862638828
    scale_params: 604.5912224299914
    scale_params: 622.723746045974
    scale_params: 686.6137887242224
    scale_params: 611.9842163293193
    scale_params: 589.4431517726466
    scale_params: 527.9695613717851
    scale_params: 890.512264306686
    scale_params: 464.09477114644807
    scale_params: 615.5294049674087
    scale_params: 611.5406186294307
    scale_params: 621.3560367070504
    scale_params: 800.1570611901244
    scale_params: 632.1492421916142
    scale_params: 765.483619680777
    scale_params: 1447.927275630816
    scale_params: 663.8951530534349
    scale_params: 537.3110501351784
    scale_params: 793.8888707973703
    scale_params: 570.2098136701148
    scale_params: 614.6688183520221
    scale_params: 590.8495088077407
    scale_params: 969.5811419380689
    scale_params: 487.9110720809893
    scale_params: 724.0009680727138
    scale_params: 728.747609953102
    scale_params: 653.10710991704
    scale_params: 893.5743766737825
    scale_params: 643.0851672538532
    scale_params: 540.3453924390167
    scale_params: 1846.3360599643636
    scale_params: 450.7376333902351
    scale_params: 918.6780044823521
    scale_params: 631.7557273908288
    scale_params: 533.1863674914698
    scale_params: 619.3943305691488
    scale_params: 558.3975874739223
    scale_params: 1220.6809797529384
    scale_params: 580.6890690184498
    scale_params: 602.6350835963802
  }
}
layer {
  name: "relu1_2"
  type: "ReLU"
  bottom: "conv1_2"
  top: "conv1_2"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_2"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 0.06049258646116979
    scale_out: 0.03874357000216182
    scale_params: 3032.9512273997498
    scale_params: 1358.7720594530333
    scale_params: 1209.6889118382326
    scale_params: 467.47218519275845
    scale_params: 671.2562955093981
    scale_params: 1007.803360926796
    scale_params: 564.9139522945169
    scale_params: 737.7630138672505
    scale_params: 933.4659168995724
    scale_params: 1444.2416069215208
    scale_params: 1057.9301827520835
    scale_params: 986.1472267036033
    scale_params: 485.27550342028576
    scale_params: 1997.9606759635587
    scale_params: 962.7385267077012
    scale_params: 989.824876272264
    scale_params: 911.5071091628819
    scale_params: 681.9535017103997
    scale_params: 744.1779287837808
    scale_params: 1325.0722664228638
    scale_params: 930.3917515149332
    scale_params: 1126.7589744789757
    scale_params: 750.6316583151353
    scale_params: 955.0946964993714
    scale_params: 1014.5222283472806
    scale_params: 826.3512571742436
    scale_params: 644.0032331542636
    scale_params: 2086.8729695697925
    scale_params: 1938.8969327697685
    scale_params: 1046.4915788121089
    scale_params: 589.0961504340275
    scale_params: 2003.635140054562
    scale_params: 432.61203769258304
    scale_params: 692.2394438839236
    scale_params: 836.8841554057802
    scale_params: 1752.4231200390175
    scale_params: 1008.6603275473336
    scale_params: 1073.5246170034761
    scale_params: 1231.5445316202238
    scale_params: 2507.3963461813423
    scale_params: 1607.9017882636995
    scale_params: 878.2369332406751
    scale_params: 652.8863735392298
    scale_params: 9750.740083205614
    scale_params: 796.1658573596217
    scale_params: 809.080198356384
    scale_params: 944.771655339632
    scale_params: 921.9273627968147
    scale_params: 761.0521332710525
    scale_params: 3346.907925948688
    scale_params: 1763.715580509789
    scale_params: 2347.968022021707
    scale_params: 1725.8266394675848
    scale_params: 2269.943488757151
    scale_params: 572.2377651882448
    scale_params: 963.4709774857675
    scale_params: 368.3543050490682
    scale_params: 1564.7243244702056
    scale_params: 797.6023084615703
    scale_params: 699.2623610051238
    scale_params: 1896.2312724143324
    scale_params: 1104.8310386738956
    scale_params: 1814.4950585773688
    scale_params: 1951.969691289097
    scale_params: 909.7572125058256
    scale_params: 628.3181804040634
    scale_params: 966.3224390146008
    scale_params: 786.337408292205
    scale_params: 1726.8351018069432
    scale_params: 3263.792001478176
    scale_params: 412.9776646374478
    scale_params: 458.0911761439856
    scale_params: 304.8406715487954
    scale_params: 769.0602553841184
    scale_params: 2210.4474965191157
    scale_params: 812.0792109283342
    scale_params: 847.4456075060377
    scale_params: 3267.1795094626227
    scale_params: 597.2544045347133
    scale_params: 881.6266336752469
    scale_params: 461.21742503480715
    scale_params: 1220.708254143106
    scale_params: 605.4631989769075
    scale_params: 949.92582870268
    scale_params: 920.5108359614637
    scale_params: 715.4940004899341
    scale_params: 511.17410137408064
    scale_params: 1466.1402458996088
    scale_params: 564.6682400581442
    scale_params: 3025.2499695401184
    scale_params: 1263.3866210357803
    scale_params: 1380.0154565539242
    scale_params: 2195.2301456620235
    scale_params: 1506.2965966244162
    scale_params: 1689.3389645783589
    scale_params: 1555.2007141332826
    scale_params: 923.3016425203671
    scale_params: 534.2186970463614
    scale_params: 1438.8150066932517
    scale_params: 890.1393074046107
    scale_params: 1605.5223956398522
    scale_params: 1048.4898943153967
    scale_params: 442.1649919772624
    scale_params: 710.2629408337123
    scale_params: 576.9312753372981
    scale_params: 2195.5574353005095
    scale_params: 1425.9921586395592
    scale_params: 464.63904761821686
    scale_params: 2306.559228370744
    scale_params: 489.6189091092924
    scale_params: 926.7421328335804
    scale_params: 783.9341743053445
    scale_params: 1514.3612243815544
    scale_params: 682.480147213089
    scale_params: 478.1033247120018
    scale_params: 1432.1957444784853
    scale_params: 788.0967428644717
    scale_params: 492.496695992094
    scale_params: 2105.1176741123277
    scale_params: 1728.5613803949184
    scale_params: 534.0750501390986
    scale_params: 1270.812834055558
    scale_params: 696.0046188931349
    scale_params: 4870.023680210096
    scale_params: 1876.1951639491954
    scale_params: 622.0178932874848
    scale_params: 1117.0632612426368
    scale_params: 1134.361079718745
  }
}
layer {
  name: "relu2_1"
  type: "ReLU"
  bottom: "conv2_1"
  top: "conv2_1"
}
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "conv2_1"
  top: "conv2_2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 0.03874357000216182
    scale_out: 0.02458254763386389
    scale_params: 867.0633144144924
    scale_params: 1020.9083536638758
    scale_params: 1144.552761932925
    scale_params: 1350.163229723652
    scale_params: 2041.3953839520957
    scale_params: 1254.7606727321297
    scale_params: 1019.4052448353953
    scale_params: 1175.3224036089741
    scale_params: 1220.2071070106147
    scale_params: 1149.4150382785422
    scale_params: 779.224793807034
    scale_params: 1002.9616071908746
    scale_params: 951.2303107036413
    scale_params: 796.915438277857
    scale_params: 1237.7578810104483
    scale_params: 1301.118289688316
    scale_params: 893.9685028831415
    scale_params: 1108.3329836913197
    scale_params: 1133.9295170496368
    scale_params: 1042.390015453323
    scale_params: 809.3812392741497
    scale_params: 1195.6927704001978
    scale_params: 1075.888042742524
    scale_params: 959.105650072663
    scale_params: 1074.6057731957983
    scale_params: 1031.6122109409898
    scale_params: 1270.8931816521203
    scale_params: 507.4686121595848
    scale_params: 1125.2697511456583
    scale_params: 862.098687080707
    scale_params: 882.6512481749572
    scale_params: 1278.270115261887
    scale_params: 3296.1020091531254
    scale_params: 1172.3370297849572
    scale_params: 1208.5268649614836
    scale_params: 2070.07572532159
    scale_params: 1462.8789624417927
    scale_params: 1347.9116357296723
    scale_params: 938.3514522284789
    scale_params: 910.5140431741833
    scale_params: 1382.3141313491267
    scale_params: 1016.8945671866601
    scale_params: 627.5633651308709
    scale_params: 925.1242672557711
    scale_params: 920.3023992168361
    scale_params: 1288.4679500460904
    scale_params: 1397.25406468994
    scale_params: 922.366667023803
    scale_params: 833.4630602459524
    scale_params: 624.8588743908272
    scale_params: 810.5026986402239
    scale_params: 914.7085009206301
    scale_params: 1540.7297940716394
    scale_params: 1512.0370184319538
    scale_params: 1263.485699363567
    scale_params: 976.9123628764336
    scale_params: 804.4016884569631
    scale_params: 1050.4952087354968
    scale_params: 1090.5616856848153
    scale_params: 1453.2912361915967
    scale_params: 1348.3827070930288
    scale_params: 1061.5359327857027
    scale_params: 887.0448861383887
    scale_params: 1095.8895622131918
    scale_params: 1943.6183460981629
    scale_params: 1316.6030434033719
    scale_params: 1452.8344151684946
    scale_params: 979.2890131361617
    scale_params: 838.5801727768267
    scale_params: 532.5823409256561
    scale_params: 925.5110426160778
    scale_params: 833.5501991739635
    scale_params: 1483.5265185569933
    scale_params: 1217.226315105819
    scale_params: 1358.7149810277392
    scale_params: 1017.2100624099719
    scale_params: 762.9822183819182
    scale_params: 1060.268697461324
    scale_params: 1506.3610241308133
    scale_params: 852.5596546877736
    scale_params: 1544.1423444629327
    scale_params: 775.0084911677416
    scale_params: 845.1457396019315
    scale_params: 1329.128068076827
    scale_params: 1049.899095033271
    scale_params: 457.8627011282144
    scale_params: 597.5306837894526
    scale_params: 924.3342421052563
    scale_params: 1159.6293420659485
    scale_params: 1071.3977743936855
    scale_params: 1231.038094568856
    scale_params: 1475.7186640585812
    scale_params: 1452.441862878709
    scale_params: 1074.6344983388722
    scale_params: 1752.0018213133335
    scale_params: 918.0555618630004
    scale_params: 1405.5750219775045
    scale_params: 900.3562863912003
    scale_params: 1352.214544972802
    scale_params: 824.978985788447
    scale_params: 587.5753927797414
    scale_params: 842.8907469412815
    scale_params: 698.1690221239649
    scale_params: 1098.0965329434407
    scale_params: 1155.6242244834093
    scale_params: 1057.0161989215437
    scale_params: 1186.8445593141978
    scale_params: 1589.1997336548966
    scale_params: 1211.0710223201556
    scale_params: 1318.7774944154287
    scale_params: 1330.8736565482493
    scale_params: 1408.6655159216918
    scale_params: 1243.0686860905164
    scale_params: 660.7991132721072
    scale_params: 1023.9221884919149
    scale_params: 762.6383951676926
    scale_params: 1105.9733355445467
    scale_params: 1047.210876618699
    scale_params: 1463.7903667811893
    scale_params: 1040.1210494758955
    scale_params: 1630.2244646741613
    scale_params: 1283.4306182992818
    scale_params: 1264.8571594152568
    scale_params: 1267.0985953100485
    scale_params: 1183.3345555681208
    scale_params: 565.3108741424982
    scale_params: 1113.0758563712293
    scale_params: 1189.2326861629188
  }
}
layer {
  name: "relu2_2"
  type: "ReLU"
  bottom: "conv2_2"
  top: "conv2_2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2_2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 0.02458254763386389
    scale_out: 0.019162128026527572
    scale_params: 2039.6161547220365
    scale_params: 1764.452973302761
    scale_params: 280.5247195946195
    scale_params: 706.4420015254751
    scale_params: 1382.4799449527177
    scale_params: 2118.756381165678
    scale_params: 2750.9005778284272
    scale_params: 1648.6210052692923
    scale_params: 2315.5644549648755
    scale_params: 1762.8754234048786
    scale_params: 2401.24680535092
    scale_params: 1307.6680238174438
    scale_params: 1348.2038574003636
    scale_params: 2009.6314145554948
    scale_params: 1467.9591897967257
    scale_params: 1214.877273647329
    scale_params: 2245.076523429366
    scale_params: 1096.791228476335
    scale_params: 725.0803494443192
    scale_params: 2140.425435017466
    scale_params: 2261.9127826760423
    scale_params: 2407.215276964282
    scale_params: 1796.8881822722383
    scale_params: 1867.4566678966175
    scale_params: 2457.888399981572
    scale_params: 1765.9431486459116
    scale_params: 1562.1478731589905
    scale_params: 1127.3179374064516
    scale_params: 1110.4562713560854
    scale_params: 833.1137093946513
    scale_params: 2223.4320242456356
    scale_params: 1404.1934274396672
    scale_params: 1777.2795156058362
    scale_params: 1282.4707919693687
    scale_params: 770.2336629268194
    scale_params: 1863.2827366920842
    scale_params: 2387.6424239758603
    scale_params: 2882.0717145997432
    scale_params: 1341.7316560531312
    scale_params: 1900.7393092657305
    scale_params: 1492.4567452307783
    scale_params: 1257.1803092006962
    scale_params: 2049.938225316822
    scale_params: 1049.6935594508745
    scale_params: 2971.818570305667
    scale_params: 1374.314598863825
    scale_params: 994.2985301510307
    scale_params: 2567.408496509542
    scale_params: 2727.655991476661
    scale_params: 2911.0084266587974
    scale_params: 1148.8365083795136
    scale_params: 1494.4850791297195
    scale_params: 1647.7084925034303
    scale_params: 1831.486815625483
    scale_params: 2792.7010245601664
    scale_params: 2250.692687878618
    scale_params: 1630.611999582916
    scale_params: 3583.566105070053
    scale_params: 2624.299834619235
    scale_params: 1708.593325223547
    scale_params: 1054.3849762842035
    scale_params: 3440.843513611907
    scale_params: 2214.0422919819857
    scale_params: 2114.58562417093
    scale_params: 3071.434651305936
    scale_params: 1779.3022453946592
    scale_params: 1251.287591863719
    scale_params: 2501.224732432741
    scale_params: 1660.3495392645239
    scale_params: 1760.1946906419876
    scale_params: 1952.6935207419792
    scale_params: 2915.6770288838557
    scale_params: 1285.1085440582003
    scale_params: 1078.4371525463018
    scale_params: 2088.502751584512
    scale_params: 2697.1016570678885
    scale_params: 1488.82619088005
    scale_params: 1160.7430825216272
    scale_params: 2287.2370750381665
    scale_params: 1143.862351476375
    scale_params: 1961.1672043706642
    scale_params: 1563.914208477715
    scale_params: 2637.5217273505577
    scale_params: 1719.216827166158
    scale_params: 1292.690051239987
    scale_params: 480.35555988408555
    scale_params: 1019.0550606480488
    scale_params: 522.3266083199021
    scale_params: 1383.2022977564902
    scale_params: 2707.9562107886604
    scale_params: 2035.584946896192
    scale_params: 2248.38359743851
    scale_params: 2112.0553987871604
    scale_params: 1672.405129441859
    scale_params: 1785.2706250575386
    scale_params: 1058.4820795804037
    scale_params: 2182.3499709020457
    scale_params: 1112.0901240711107
    scale_params: 1338.8002354690354
    scale_params: 1084.779860534907
    scale_params: 2513.007980061824
    scale_params: 612.11229513336
    scale_params: 1994.2326184320655
    scale_params: 1463.5756982736564
    scale_params: 1515.8580937147785
    scale_params: 1334.0469466401614
    scale_params: 3360.5872800570323
    scale_params: 1437.4724201371016
    scale_params: 2069.092227732982
    scale_params: 2025.6303998604394
    scale_params: 2201.1575045238546
    scale_params: 935.7291176244225
    scale_params: 2205.6704145240274
    scale_params: 3134.345655373616
    scale_params: 2819.4077428943965
    scale_params: 1257.9253059290997
    scale_params: 1790.0002463584678
    scale_params: 2613.203209525586
    scale_params: 1497.9405713363747
    scale_params: 1717.266045270823
    scale_params: 1862.6354695617986
    scale_params: 3792.567176379784
    scale_params: 1878.8867556828502
    scale_params: 1553.631832767974
    scale_params: 2112.747025906284
    scale_params: 1480.2893228454059
    scale_params: 1220.7744345727867
    scale_params: 1026.871526443868
    scale_params: 1641.3146245702487
    scale_params: 1375.663196931997
    scale_params: 754.9532454441011
    scale_params: 1077.456895375254
    scale_params: 1004.3722525031453
    scale_params: 688.0065032191984
    scale_params: 2249.543932923526
    scale_params: 1592.815592830408
    scale_params: 1960.5092339963808
    scale_params: 1522.3900186475603
    scale_params: 1338.5322564129303
    scale_params: 2255.116710695658
    scale_params: 2986.042681348081
    scale_params: 1172.9260786860536
    scale_params: 851.1136533085461
    scale_params: 1977.390910776154
    scale_params: 1290.296587767169
    scale_params: 1167.2479028174691
    scale_params: 1261.2276196886644
    scale_params: 3139.079373500903
    scale_params: 1974.4176971489896
    scale_params: 2725.272705674282
    scale_params: 2590.9574792930825
    scale_params: 1809.25420244128
    scale_params: 2769.085074673904
    scale_params: 1956.573134987597
    scale_params: 2118.6189165987107
    scale_params: 1092.4093974764096
    scale_params: 614.1062969627452
    scale_params: 968.9281509680726
    scale_params: 716.7194590999458
    scale_params: 568.3993338060866
    scale_params: 1267.692933594096
    scale_params: 1795.1772561577386
    scale_params: 2487.7198909648287
    scale_params: 1809.7029128149354
    scale_params: 1185.241423025249
    scale_params: 2517.4438687963425
    scale_params: 1574.3322856657837
    scale_params: 2211.3984255756322
    scale_params: 1436.1866666307178
    scale_params: 1264.067934473282
    scale_params: 1611.2139852377038
    scale_params: 3270.8404646891295
    scale_params: 873.017882430983
    scale_params: 2604.075823451171
    scale_params: 3303.800505755797
    scale_params: 1964.6747185476186
    scale_params: 2130.039330307239
    scale_params: 1579.1808691935128
    scale_params: 2882.687305321403
    scale_params: 1204.5098642019145
    scale_params: 2728.854222158186
    scale_params: 2661.7645623758617
    scale_params: 2291.8225606887922
    scale_params: 2680.2758976379723
    scale_params: 2553.1207365767636
    scale_params: 1612.561726352348
    scale_params: 2457.619960792043
    scale_params: 921.2867674225992
    scale_params: 1853.9315938982368
    scale_params: 1599.1094727549648
    scale_params: 3534.0959230386466
    scale_params: 838.8247206296344
    scale_params: 1453.5404535248097
    scale_params: 1738.6670126527688
    scale_params: 1630.2182281940943
    scale_params: 1479.5131460286593
    scale_params: 2092.985727537071
    scale_params: 2113.8361697586774
    scale_params: 2466.933600920394
    scale_params: 2886.1359115726495
    scale_params: 1649.9512637833907
    scale_params: 787.7313011428114
    scale_params: 1877.9389067959842
    scale_params: 550.6504940223512
    scale_params: 2155.546818818387
    scale_params: 1489.7878014946077
    scale_params: 1054.926454786695
    scale_params: 816.7010322476535
    scale_params: 1821.3092470250592
    scale_params: 1584.0829635577265
    scale_params: 1451.4315622741672
    scale_params: 1006.2252803008041
    scale_params: 985.710288930165
    scale_params: 2277.330506318265
    scale_params: 902.2704298348386
    scale_params: 2185.0400475165557
    scale_params: 1522.4565101396463
    scale_params: 2241.5399344435446
    scale_params: 2418.621561275837
    scale_params: 1042.509742521861
    scale_params: 2091.2957030638
    scale_params: 2298.5394625736026
    scale_params: 1553.8374723508175
    scale_params: 1327.0067714073161
    scale_params: 2275.462237714442
    scale_params: 2241.328458832959
    scale_params: 2332.563567420074
    scale_params: 900.3561912770466
    scale_params: 771.8466573864464
    scale_params: 2121.356288986755
    scale_params: 2215.6469985954673
    scale_params: 1832.3773110371976
    scale_params: 1775.538386412385
    scale_params: 2394.2394729475327
    scale_params: 2881.126420077362
    scale_params: 2091.7767668012066
    scale_params: 1426.8662882762449
    scale_params: 1879.1311696976352
    scale_params: 1907.3201431716632
    scale_params: 2228.1703637478186
    scale_params: 2087.438144603542
    scale_params: 2438.019210628299
    scale_params: 1732.9813608685702
    scale_params: 1443.587604168078
    scale_params: 1790.7326959009808
    scale_params: 1494.5135131035638
    scale_params: 1593.7150894133958
    scale_params: 1970.5440593112828
    scale_params: 1424.7235169107257
    scale_params: 2658.7850036842538
    scale_params: 1151.1109843327931
    scale_params: 1915.5299270305948
    scale_params: 898.6096757453088
    scale_params: 2749.235655570469
    scale_params: 1338.1117383043927
    scale_params: 2510.02409737196
  }
}
layer {
  name: "relu3_1"
  type: "ReLU"
  bottom: "conv3_1"
  top: "conv3_1"
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "conv3_1"
  top: "conv3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 0.019162128026527572
    scale_out: 0.02100319536205175
    scale_params: 2096.421811743474
    scale_params: 2981.272909581422
    scale_params: 2869.22747104981
    scale_params: 2908.940825240689
    scale_params: 2798.3294153841002
    scale_params: 2199.723726291527
    scale_params: 1795.3031793609427
    scale_params: 1743.8333071606353
    scale_params: 464.2942989835326
    scale_params: 1864.7436407506561
    scale_params: 1553.584254503559
    scale_params: 2345.050496245724
    scale_params: 3016.745519852816
    scale_params: 1735.3331224611734
    scale_params: 1439.9090062971754
    scale_params: 2504.2125512594703
    scale_params: 2583.630406280627
    scale_params: 976.2954252699473
    scale_params: 430.1735178697521
    scale_params: 2600.2495894027975
    scale_params: 3209.900437759453
    scale_params: 1875.0684993711143
    scale_params: 2342.361644617199
    scale_params: 2568.304604201266
    scale_params: 964.7521208736987
    scale_params: 3507.5146748229126
    scale_params: 1695.8230084093489
    scale_params: 1525.3721990534195
    scale_params: 1607.2524394038542
    scale_params: 4293.967579201718
    scale_params: 2748.318092964252
    scale_params: 2877.6997271818695
    scale_params: 1912.515005965091
    scale_params: 1347.9035350730549
    scale_params: 2567.933745171279
    scale_params: 1867.5223440590792
    scale_params: 1158.1148890310837
    scale_params: 1910.0305723194315
    scale_params: 3474.6057621825685
    scale_params: 2484.6917723913994
    scale_params: 2049.076475956368
    scale_params: 3376.195169700059
    scale_params: 2645.668018991895
    scale_params: 1717.8916903881864
    scale_params: 3038.162994200619
    scale_params: 1854.3912423424292
    scale_params: 1872.550118709318
    scale_params: 3160.1877641538836
    scale_params: 1244.002920394154
    scale_params: 2250.964937196253
    scale_params: 1540.2331989298928
    scale_params: 3390.2331317237717
    scale_params: 3070.388733103713
    scale_params: 1435.237998833498
    scale_params: 1917.7477373241663
    scale_params: 1946.858722279025
    scale_params: 1585.3123983990306
    scale_params: 1390.426502922639
    scale_params: 1727.042080160667
    scale_params: 918.3637089894485
    scale_params: 1384.231991825994
    scale_params: 2123.898805354139
    scale_params: 2503.4927795829717
    scale_params: 1942.7409067358162
    scale_params: 1200.3147285910097
    scale_params: 311.28693053195906
    scale_params: 2512.4766274168305
    scale_params: 2798.9524905620037
    scale_params: 2333.7824040901037
    scale_params: 3640.3239916159355
    scale_params: 2318.1339355582036
    scale_params: 2179.6954969877042
    scale_params: 2346.7188192428544
    scale_params: 3172.1311721483944
    scale_params: 1251.1258569095546
    scale_params: 2574.950586630482
    scale_params: 4515.073054506994
    scale_params: 2706.203423625309
    scale_params: 1747.772170993566
    scale_params: 1287.5478416590445
    scale_params: 2867.8461298259404
    scale_params: 3713.134246075218
    scale_params: 2779.858004506802
    scale_params: 1751.3622453403934
    scale_params: 2604.6786700403186
    scale_params: 1778.734088112479
    scale_params: 2403.9626079282602
    scale_params: 3943.487884851316
    scale_params: 2463.980775757842
    scale_params: 1603.0001765160657
    scale_params: 1929.3437217740275
    scale_params: 3232.1239904975964
    scale_params: 3410.923072366836
    scale_params: 1436.2828731266789
    scale_params: 3787.9145490692854
    scale_params: 2258.213642560103
    scale_params: 2584.5911723474323
    scale_params: 1180.1954539459223
    scale_params: 1466.5936127621549
    scale_params: 2561.1128035796214
    scale_params: 2355.8109403023423
    scale_params: 3124.080444058829
    scale_params: 1166.5293704376552
    scale_params: 3717.2469426839657
    scale_params: 2571.562003315823
    scale_params: 1136.7630358129024
    scale_params: 2743.9015446231165
    scale_params: 1792.0867183325831
    scale_params: 930.5953341967967
    scale_params: 2497.9312008552283
    scale_params: 2780.761140197372
    scale_params: 1765.201219656165
    scale_params: 3645.4553166489995
    scale_params: 2154.1294936826516
    scale_params: 2435.630469608616
    scale_params: 3164.32042638818
    scale_params: 2980.4685715524665
    scale_params: 1634.9907310263436
    scale_params: 1578.7749856021594
    scale_params: 2985.989849949453
    scale_params: 2667.5644472710974
    scale_params: 2186.258579294056
    scale_params: 3528.233212580398
    scale_params: 3409.808161062419
    scale_params: 2971.8540620004965
    scale_params: 2525.916918513952
    scale_params: 2347.1397048982226
    scale_params: 1307.8875577343726
    scale_params: 870.7429324888157
    scale_params: 2659.3373153482985
    scale_params: 3642.811552346879
    scale_params: 3808.2403543438363
    scale_params: 1607.900726560354
    scale_params: 2179.523815070668
    scale_params: 1802.1541347997836
    scale_params: 2070.220036850816
    scale_params: 2230.6557008185387
    scale_params: 783.3943949802172
    scale_params: 680.5955415009663
    scale_params: 1974.267224606039
    scale_params: 1719.211451800176
    scale_params: 1915.564584592909
    scale_params: 713.1877775709029
    scale_params: 1389.8336923905579
    scale_params: 1829.0866189909773
    scale_params: 2523.438465577107
    scale_params: 1242.5202125783726
    scale_params: 1877.6871497302711
    scale_params: 1816.4656027099843
    scale_params: 2294.2727350609284
    scale_params: 2949.094289987918
    scale_params: 2111.9321471860712
    scale_params: 3062.887684364821
    scale_params: 2253.5955613598426
    scale_params: 1738.1870719514643
    scale_params: 3301.401915166026
    scale_params: 1300.5319927035657
    scale_params: 1653.054800866635
    scale_params: 1904.450350603228
    scale_params: 2225.4136383854757
    scale_params: 2154.3251060090925
    scale_params: 1278.0382750524168
    scale_params: 2661.2097879754915
    scale_params: 2439.2884670713293
    scale_params: 2970.04610077646
    scale_params: 848.6277030086823
    scale_params: 1596.2719793662222
    scale_params: 1466.6702107475928
    scale_params: 1441.8692556669344
    scale_params: 2353.1407369418275
    scale_params: 2703.430562077957
    scale_params: 1652.1990278520352
    scale_params: 1863.4006736627427
    scale_params: 1812.8580330630546
    scale_params: 1134.2559319916952
    scale_params: 2527.4524980529573
    scale_params: 2435.1936038502163
    scale_params: 3312.749810755832
    scale_params: 2478.755637481192
    scale_params: 2117.380696586036
    scale_params: 1018.4294605176949
    scale_params: 3034.083579088567
    scale_params: 1809.2499776306918
    scale_params: 2451.163417758989
    scale_params: 2972.324083065654
    scale_params: 1959.7309316960136
    scale_params: 1781.529165219567
    scale_params: 2686.0281458833365
    scale_params: 2861.0426412498746
    scale_params: 2455.89059926195
    scale_params: 2599.2981562386108
    scale_params: 2887.749440006397
    scale_params: 2160.8546764457715
    scale_params: 1452.543725348923
    scale_params: 1181.590071501317
    scale_params: 1678.260096842097
    scale_params: 2732.9288191040214
    scale_params: 1316.0377648641922
    scale_params: 2511.8873833286166
    scale_params: 1637.038612466641
    scale_params: 2876.1488473740387
    scale_params: 2201.9430039568224
    scale_params: 2769.292241932176
    scale_params: 2070.857988975487
    scale_params: 4574.484584985382
    scale_params: 2232.0356907788237
    scale_params: 1432.5519036286173
    scale_params: 1848.7639249607323
    scale_params: 3160.659471751515
    scale_params: 2817.404141219196
    scale_params: 2259.0658474966845
    scale_params: 1401.5994690159685
    scale_params: 3773.7023965470557
    scale_params: 1891.1038150243871
    scale_params: 1722.978966409815
    scale_params: 2903.362756925861
    scale_params: 1803.4474477829606
    scale_params: 2985.874255092696
    scale_params: 2852.8189076506096
    scale_params: 2633.5903434900233
    scale_params: 3032.6018402003556
    scale_params: 2678.3079108331176
    scale_params: 883.3984272636653
    scale_params: 2027.4672906911824
    scale_params: 1534.6643022905735
    scale_params: 2936.745649557209
    scale_params: 3212.38307141649
    scale_params: 2664.6879043581653
    scale_params: 1494.6508500156563
    scale_params: 1489.2278603658267
    scale_params: 1492.1942669014634
    scale_params: 2642.9374411389394
    scale_params: 1749.7162227857416
    scale_params: 1494.4549429191757
    scale_params: 2011.5886985253005
    scale_params: 3139.0938256688137
    scale_params: 1644.1600217296693
    scale_params: 2267.360384057148
    scale_params: 2772.3527472201295
    scale_params: 2680.246607227584
    scale_params: 2074.0539087395186
    scale_params: 2050.320046516249
    scale_params: 2282.33828316476
    scale_params: 1305.957224774192
    scale_params: 1096.1647632477493
    scale_params: 2266.745443111518
    scale_params: 2114.280586126384
    scale_params: 2189.6162789211467
    scale_params: 2197.309916881824
    scale_params: 1960.967759102736
    scale_params: 2475.583173038974
    scale_params: 3143.766820169578
    scale_params: 1693.077277655651
    scale_params: 2448.5460768737953
    scale_params: 3322.018009541204
    scale_params: 2064.8200878178213
  }
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "conv3_2"
  top: "conv3_3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 0.02100319536205175
    scale_out: 0.02182490909840107
    scale_params: 2185.1597946476977
    scale_params: 2293.7383277638237
    scale_params: 1023.7974072157871
    scale_params: 2468.2976631493984
    scale_params: 2130.426946614941
    scale_params: 2763.8144428552737
    scale_params: 1398.1453694079603
    scale_params: 1700.1788541741162
    scale_params: 654.2770680141944
    scale_params: 1063.9526553233488
    scale_params: 3187.8480502832253
    scale_params: 2133.2054822224236
    scale_params: 2435.0527128407584
    scale_params: 1508.2475696640847
    scale_params: 768.3232782463517
    scale_params: 1831.311299419611
    scale_params: 1651.261115773925
    scale_params: 2132.67342335678
    scale_params: 2731.0409524327565
    scale_params: 922.0320873294644
    scale_params: 1645.2951959892046
    scale_params: 2852.453460682829
    scale_params: 1509.0505894633607
    scale_params: 750.2807758958019
    scale_params: 2279.312629443328
    scale_params: 1546.7185010951382
    scale_params: 1530.3264598011308
    scale_params: 1435.7035298342869
    scale_params: 2145.604301366268
    scale_params: 2134.9130112244916
    scale_params: 1973.5353131224952
    scale_params: 3536.6362855389057
    scale_params: 2586.6981503880243
    scale_params: 2819.622275372198
    scale_params: 1810.4383107031
    scale_params: 1412.8674905274356
    scale_params: 2628.266929817393
    scale_params: 481.82323696181595
    scale_params: 1410.65631336642
    scale_params: 1790.7052299831073
    scale_params: 2212.061060674211
    scale_params: 2299.4029950046383
    scale_params: 3010.2786102845694
    scale_params: 3769.4997440287943
    scale_params: 392.0482239755708
    scale_params: 1454.8392279310945
    scale_params: 2414.7695025913686
    scale_params: 1432.2074170468936
    scale_params: 2202.680675068365
    scale_params: 2116.969417450166
    scale_params: 2085.5628597290206
    scale_params: 1988.1879040448193
    scale_params: 1284.2785641041096
    scale_params: 2552.131252239299
    scale_params: 468.17126838501065
    scale_params: 2432.819421620537
    scale_params: 970.4762989651913
    scale_params: 1985.7661084094825
    scale_params: 1908.8990442095096
    scale_params: 2592.0224348493184
    scale_params: 1911.3181655186488
    scale_params: 2888.4259469866583
    scale_params: 1421.5084188943897
    scale_params: 1298.8147639382948
    scale_params: 1455.3487513294651
    scale_params: 1206.0115489676455
    scale_params: 2331.7425728732333
    scale_params: 2236.1517484182077
    scale_params: 3140.660362124844
    scale_params: 718.7046934408402
    scale_params: 2055.412063439084
    scale_params: 3316.9163675734535
    scale_params: 2996.9812358694967
    scale_params: 1880.5361254890227
    scale_params: 1894.6721960006548
    scale_params: 733.9663210819969
    scale_params: 1664.618951692446
    scale_params: 2230.0982888231274
    scale_params: 1566.6260700694868
    scale_params: 2462.0312036987552
    scale_params: 1821.818086365733
    scale_params: 2626.4160292002543
    scale_params: 2317.6932913603723
    scale_params: 1932.2428686016242
    scale_params: 1021.0350003650907
    scale_params: 1894.9769805504638
    scale_params: 2463.9182689774625
    scale_params: 2251.4779613233454
    scale_params: 1861.5101863142677
    scale_params: 3748.0664401568038
    scale_params: 1986.76482382283
    scale_params: 1926.6250600881726
    scale_params: 1427.2500355228915
    scale_params: 1093.550413409771
    scale_params: 2795.509292314636
    scale_params: 1695.9581579484118
    scale_params: 1180.492230587272
    scale_params: 2534.2546481427094
    scale_params: 2231.639877232422
    scale_params: 2739.831399678868
    scale_params: 1352.6430091343757
    scale_params: 1458.289879837913
    scale_params: 1553.6850785667923
    scale_params: 2873.835834292647
    scale_params: 3074.836246830014
    scale_params: 2186.2997999570453
    scale_params: 2038.2698740757287
    scale_params: 1926.4567452680708
    scale_params: 1629.5770609442352
    scale_params: 2033.1348908098003
    scale_params: 2119.0253050061538
    scale_params: 2146.3686179532433
    scale_params: 1905.454977312035
    scale_params: 1936.915604613876
    scale_params: 2050.7439519952964
    scale_params: 1761.414262497839
    scale_params: 2147.2922515567902
    scale_params: 1448.1596464263682
    scale_params: 2441.634203173158
    scale_params: 2636.237618856212
    scale_params: 1782.321785193942
    scale_params: 1643.788847408125
    scale_params: 1144.6067149350595
    scale_params: 1368.744063394879
    scale_params: 1122.8793053315262
    scale_params: 1935.5089070884496
    scale_params: 1539.717869429869
    scale_params: 2694.1706753930544
    scale_params: 1282.4891252915775
    scale_params: 2886.521771916258
    scale_params: 1879.2337182390495
    scale_params: 2357.676076678184
    scale_params: 2385.445637043932
    scale_params: 2422.668582365949
    scale_params: 2861.6975632850426
    scale_params: 1050.4109236589038
    scale_params: 1496.7680841003116
    scale_params: 1841.788122179414
    scale_params: 1045.9811226185432
    scale_params: 837.5037307166547
    scale_params: 2654.0827607758533
    scale_params: 1550.0059884595576
    scale_params: 1891.0597568686
    scale_params: 2281.1829547209513
    scale_params: 1900.1348108894688
    scale_params: 1421.7183940809398
    scale_params: 1843.8758678162983
    scale_params: 2703.0100114586116
    scale_params: 3889.7541484085878
    scale_params: 2770.6469032031973
    scale_params: 2866.442498409812
    scale_params: 1255.7690940699758
    scale_params: 860.2011545280076
    scale_params: 1971.100966236198
    scale_params: 1435.2999957898353
    scale_params: 2109.167090381254
    scale_params: 2906.3190724823107
    scale_params: 1706.2797861571094
    scale_params: 1539.2037185812849
    scale_params: 1163.199683146826
    scale_params: 2782.00899005835
    scale_params: 1489.4024876658245
    scale_params: 1843.963034741013
    scale_params: 1514.0515809531862
    scale_params: 1515.3505909863688
    scale_params: 1171.5855655727428
    scale_params: 2228.6782940521734
    scale_params: 2235.9502338082298
    scale_params: 796.2868085100816
    scale_params: 3071.4080865129167
    scale_params: 1428.540422377572
    scale_params: 809.7865920237763
    scale_params: 1736.7782131869055
    scale_params: 2361.5009367367757
    scale_params: 1122.692193737718
    scale_params: 1786.1760659039724
    scale_params: 1344.113120400413
    scale_params: 1355.833512712253
    scale_params: 4262.795874836643
    scale_params: 1781.4680947548038
    scale_params: 910.6659107368883
    scale_params: 2218.0067622873626
    scale_params: 1793.9033250929542
    scale_params: 3485.4611942621013
    scale_params: 2660.7171261607023
    scale_params: 1504.257601659924
    scale_params: 1638.626172950022
    scale_params: 1268.2066789120133
    scale_params: 2102.4476953329913
    scale_params: 1291.4617793064438
    scale_params: 2502.7241806773
    scale_params: 2274.625696056234
    scale_params: 2191.295759757289
    scale_params: 2534.138605468282
    scale_params: 2452.2020790483775
    scale_params: 1887.025823977165
    scale_params: 1046.508026492678
    scale_params: 2518.1090035834222
    scale_params: 2162.761943315472
    scale_params: 1805.3711106966348
    scale_params: 1557.5106016320663
    scale_params: 2000.043115268716
    scale_params: 2991.899179747205
    scale_params: 2748.0958867437616
    scale_params: 1280.9915747868708
    scale_params: 2500.0053468296687
    scale_params: 1432.9120945179777
    scale_params: 2887.8624545638595
    scale_params: 2123.4820805267877
    scale_params: 1871.3144178798823
    scale_params: 2858.531405917747
    scale_params: 2342.771952820616
    scale_params: 2468.2635298063105
    scale_params: 1950.0200149406207
    scale_params: 2835.1739841271256
    scale_params: 1149.2968524696364
    scale_params: 1911.1484431883084
    scale_params: 1551.8634856608105
    scale_params: 2405.342076242408
    scale_params: 1743.4252220877243
    scale_params: 1423.0433426824557
    scale_params: 1084.8689921032576
    scale_params: 2510.451252898525
    scale_params: 2770.324941414214
    scale_params: 2443.846224075718
    scale_params: 3327.6429701470393
    scale_params: 1472.567191333809
    scale_params: 1585.0992284409404
    scale_params: 1275.034085456258
    scale_params: 422.349809921355
    scale_params: 2558.83715031344
    scale_params: 1891.6236464227206
    scale_params: 1101.8219382883067
    scale_params: 795.1759763310187
    scale_params: 2827.488248996566
    scale_params: 2637.9211246074897
    scale_params: 1404.7946173986786
    scale_params: 3380.3845153964235
    scale_params: 1740.1087815835028
    scale_params: 1010.959668372827
    scale_params: 2201.4768970319683
    scale_params: 1714.0941377304712
    scale_params: 2064.4324724452094
    scale_params: 2017.7715084505824
    scale_params: 1617.9777708127397
    scale_params: 862.25899560505
    scale_params: 2222.946919764725
    scale_params: 2915.031316962354
    scale_params: 2675.8693151920147
    scale_params: 2476.617988247956
    scale_params: 1977.8575969107383
    scale_params: 1947.2975360344803
    scale_params: 3139.634143178791
    scale_params: 2230.966338105242
    scale_params: 2673.053227715829
    scale_params: 1806.6303668490646
  }
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "conv3_3"
  top: "conv3_3"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3_3"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 0.02182490909840107
    scale_out: 0.039953351035295494
    scale_params: 3336.4454925013097
    scale_params: 1849.9904932898758
    scale_params: 2536.0358039755697
    scale_params: 2048.1225467024983
    scale_params: 4184.207437442107
    scale_params: 2672.1439143366447
    scale_params: 2666.9807553674164
    scale_params: 1166.453135729787
    scale_params: 4626.367319797734
    scale_params: 3720.5252312143302
    scale_params: 4463.282968329773
    scale_params: 2620.993789350884
    scale_params: 1286.3380540777132
    scale_params: 4522.241629165155
    scale_params: 3105.30422092088
    scale_params: 3058.887105807608
    scale_params: 2056.062620605869
    scale_params: 2224.3117252763564
    scale_params: 2937.6923591034392
    scale_params: 3376.8683662029703
    scale_params: 3888.932822707488
    scale_params: 3531.4165361556516
    scale_params: 1398.5085434161028
    scale_params: 3376.667683425088
    scale_params: 2890.906653571448
    scale_params: 2870.153615291365
    scale_params: 3319.7228514209605
    scale_params: 2312.0398629539714
    scale_params: 2878.468260168799
    scale_params: 3186.6564223955897
    scale_params: 2161.8674543705815
    scale_params: 4579.8925831212355
    scale_params: 3707.6595439328903
    scale_params: 3405.231301359943
    scale_params: 4569.693222575566
    scale_params: 3472.4995889487673
    scale_params: 1120.1772090075497
    scale_params: 625.3095321997706
    scale_params: 3523.0764481471333
    scale_params: 1164.06744490371
    scale_params: 3617.439840953329
    scale_params: 2032.3798927869666
    scale_params: 3061.246283879738
    scale_params: 2525.3163033715646
    scale_params: 2257.0566016250054
    scale_params: 771.2153462233202
    scale_params: 2624.261654367081
    scale_params: 3029.0935503653523
    scale_params: 3654.991323560188
    scale_params: 1547.9281309316436
    scale_params: 3404.870797831912
    scale_params: 1210.4498380921
    scale_params: 1712.8980520435816
    scale_params: 1327.2593034634965
    scale_params: 3931.4442877744136
    scale_params: 3411.084842814933
    scale_params: 2713.2703305638183
    scale_params: 3311.6154686261925
    scale_params: 1877.9566999067172
    scale_params: 870.5067179918308
    scale_params: 2275.7190928738937
    scale_params: 2583.0214097696607
    scale_params: 2773.786458825328
    scale_params: 1679.5744218622276
    scale_params: 1999.201224550449
    scale_params: 4623.2504008065225
    scale_params: 2504.461459765333
    scale_params: 2375.294020201142
    scale_params: 2334.9790056492825
    scale_params: 3744.1772429499256
    scale_params: 3592.888198840898
    scale_params: 1918.6778947150408
    scale_params: 2158.3415676393583
    scale_params: 4308.496653996961
    scale_params: 2859.3458506220413
    scale_params: 979.7803063005542
    scale_params: 4159.592791795141
    scale_params: 3494.6496091093186
    scale_params: 2709.754130965225
    scale_params: 1479.4493253074936
    scale_params: 2693.5220790446224
    scale_params: 3857.19083596353
    scale_params: 2477.803494943083
    scale_params: 1030.3176506584775
    scale_params: 3525.6560439783184
    scale_params: 3055.5705306549667
    scale_params: 3825.0029746143505
    scale_params: 2137.6101110549157
    scale_params: 3526.5419199192143
    scale_params: 2429.788836113621
    scale_params: 1366.3622139496363
    scale_params: 3748.11341672173
    scale_params: 5191.852546667016
    scale_params: 5091.390310419567
    scale_params: 4214.084481191736
    scale_params: 4234.048736273556
    scale_params: 3471.4589480282684
    scale_params: 2995.209684955344
    scale_params: 4020.0121399962595
    scale_params: 3319.3776392133113
    scale_params: 3549.8132969528688
    scale_params: 1688.2438790746578
    scale_params: 1834.5158259014695
    scale_params: 3215.5008676993166
    scale_params: 4126.396400089739
    scale_params: 1745.8422689489878
    scale_params: 2145.217622531513
    scale_params: 2637.342986769229
    scale_params: 2118.4455312791847
    scale_params: 2748.0717408743967
    scale_params: 4008.5415371446143
    scale_params: 3732.0492077443682
    scale_params: 2022.3866449039524
    scale_params: 2275.2998914184827
    scale_params: 2233.171017810185
    scale_params: 2211.03241033014
    scale_params: 2302.006660776258
    scale_params: 1424.366240242169
    scale_params: 3852.3396573774853
    scale_params: 2536.6989092165113
    scale_params: 4060.7097468198376
    scale_params: 2383.833326841965
    scale_params: 3331.796300449888
    scale_params: 2835.957477736422
    scale_params: 2048.1012599276396
    scale_params: 2054.11106947613
    scale_params: 483.03684371843167
    scale_params: 1848.7982138547732
    scale_params: 2910.2368309560193
    scale_params: 3164.6009433844915
    scale_params: 2732.8584945643524
    scale_params: 4259.571398039985
    scale_params: 2567.3247782707645
    scale_params: 3222.3563922292474
    scale_params: 3993.0359279852046
    scale_params: 3098.2125761539082
    scale_params: 3622.574557683443
    scale_params: 3934.275859171925
    scale_params: 2676.5060747457005
    scale_params: 4291.992505855626
    scale_params: 4149.007688393074
    scale_params: 1247.2747927093153
    scale_params: 2125.326433798643
    scale_params: 2667.932907769038
    scale_params: 2771.9224268655935
    scale_params: 1308.6768025806166
    scale_params: 3231.20863455138
    scale_params: 881.1863668179972
    scale_params: 3559.6590158675995
    scale_params: 3216.732987774995
    scale_params: 3345.389579916968
    scale_params: 2731.85025032456
    scale_params: 1446.1360125263086
    scale_params: 1432.6937425489325
    scale_params: 4101.71884952928
    scale_params: 3031.2091387685014
    scale_params: 1964.4487498424007
    scale_params: 2305.9077148637975
    scale_params: 3792.887435430757
    scale_params: 3392.3750117793206
    scale_params: 4329.667913827534
    scale_params: 3334.0296072811875
    scale_params: 2502.351446049155
    scale_params: 2235.7274953673877
