name: "MOBILENET_V2"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.017
    mirror: false
    crop_size: 224
    mean_value: 103.94
    mean_value: 116.78
    mean_value: 123.68
    random_resize_param {
      min_size: 256
      max_size: 256
      resize_param {
        interp_mode: CUBIC
      }
    }
  }
  data_param {
    source: "/lustre/dataset/lmdb/imagenet/lmdb_raw_compressed/ilsvrc12_val_lmdb"
    batch_size: 50
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 49.7779116308
    scale_out: 36.9858807664
    scale_params: 272.839838619
    scale_params: 614.522519505
    scale_params: 280.470714974
    scale_params: 365.84181214
    scale_params: 427.78638171
    scale_params: 434.972178564
    scale_params: 953.035695794
    scale_params: 445.398211702
    scale_params: 286.701453955
    scale_params: 302.147011583
    scale_params: 247.98744971
    scale_params: 465.16408779
    scale_params: 755.837885379
    scale_params: 283.248034638
    scale_params: 360.152703474
    scale_params: 400.111474284
    scale_params: 242.152175027
    scale_params: 313.32496636
    scale_params: 585.672099655
    scale_params: 427028.538273
    scale_params: 238656.378224
    scale_params: 363.080610827
    scale_params: 358.093706253
    scale_params: 325.216121769
    scale_params: 1012.23239849
    scale_params: 287455.568342
    scale_params: 240.88040658
    scale_params: 340.200974871
    scale_params: 292.486967986
    scale_params: 479462.740437
    scale_params: 273.038200693
    scale_params: 971544.282465
    is_negative_input: true
  }
}
layer {
  name: "conv1/bn"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1/bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "conv1/scale"
  type: "Scale"
  bottom: "conv1/bn"
  top: "conv1/bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1/bn"
  top: "conv1/bn"
}
layer {
  name: "conv2_1/expand"
  type: "Convolution"
  bottom: "conv1/bn"
  top: "conv2_1/expand"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 36.9858807664
    scale_out: 34.7312844803
    scale_params: 187.161452816
    scale_params: 233.789616753
    scale_params: 374.845778265
    scale_params: 150.156634878
    scale_params: 254.430237403
    scale_params: 515.765245826
    scale_params: 5246.6170366
    scale_params: 137.619757764
    scale_params: 534.550374108
    scale_params: 123.507757657
    scale_params: 1007.95890216
    scale_params: 122.825721624
    scale_params: 510.113430166
    scale_params: 230585.820529
    scale_params: 421.610783404
    scale_params: 150.216171324
    scale_params: 44062.4048081
    scale_params: 435.876545455
    scale_params: 315.306718283
    scale_params: 54308.0200227
    scale_params: 106218.770992
    scale_params: 18779.1901926
    scale_params: 117.215970503
    scale_params: 186.007938945
    scale_params: 117.007607805
    scale_params: 482.857430469
    scale_params: 6502.21583041
    scale_params: 358.884077526
    scale_params: 430.339463032
    scale_params: 380.318294411
    scale_params: 120.284393064
    scale_params: 467.176480003
  }
}
layer {
  name: "conv2_1/expand/bn"
  type: "BatchNorm"
  bottom: "conv2_1/expand"
  top: "conv2_1/expand/bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "conv2_1/expand/scale"
  type: "Scale"
  bottom: "conv2_1/expand/bn"
  top: "conv2_1/expand/bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_1/expand"
  type: "ReLU"
  bottom: "conv2_1/expand/bn"
  top: "conv2_1/expand/bn"
}
layer {
  name: "conv2_1/dwise"
  type: "Convolution"
  bottom: "conv2_1/expand/bn"
  top: "conv2_1/dwise"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 32
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 34.7312844803
    scale_out: 22.4991522644
    scale_params: 103.3040234
    scale_params: 58.2583571383
    scale_params: 43.1744151138
    scale_params: 180.671692027
    scale_params: 63.5934311441
    scale_params: 50.0964550052
    scale_params: 0.241364094659
    scale_params: 57.3211117534
    scale_params: 48.2825590064
    scale_params: 111.962831836
    scale_params: 51.1208999515
    scale_params: 123.941995763
    scale_params: 238.507464264
    scale_params: 8.25177358186
    scale_params: 92.592687012
    scale_params: 163.074896744
    scale_params: 25.7825099686
    scale_params: 46.7019708273
    scale_params: 62.1589373588
    scale_params: 6.89062693877
    scale_params: 5.33292368701
    scale_params: 145.684666774
    scale_params: 65.9015761834
    scale_params: 46.4354059236
    scale_params: 58.3218434147
    scale_params: 34.3545854615
    scale_params: 776.490075385
    scale_params: 43.7796191541
    scale_params: 38.5359241917
    scale_params: 31.1703690249
    scale_params: 62.4022595601
    scale_params: 43.4908165194
  }
}
layer {
  name: "conv2_1/dwise/bn"
  type: "BatchNorm"
  bottom: "conv2_1/dwise"
  top: "conv2_1/dwise/bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "conv2_1/dwise/scale"
  type: "Scale"
  bottom: "conv2_1/dwise/bn"
  top: "conv2_1/dwise/bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_1/dwise"
  type: "ReLU"
  bottom: "conv2_1/dwise/bn"
  top: "conv2_1/dwise/bn"
}
layer {
  name: "conv2_1/linear"
  type: "Convolution"
  bottom: "conv2_1/dwise/bn"
  top: "conv2_1/linear"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 22.4991522644
    scale_out: 5.48043764743
    scale_params: 89.6173946469
    scale_params: 92.2952851101
    scale_params: 114.262420631
    scale_params: 105.127828185
    scale_params: 129.365129928
    scale_params: 103.912852167
    scale_params: 139.98139929
    scale_params: 110.588098956
    scale_params: 209.239468531
    scale_params: 112.280217526
    scale_params: 59.6766194057
    scale_params: 101.794293116
    scale_params: 161.969962329
    scale_params: 141.472763206
    scale_params: 110.242193302
    scale_params: 146.319869776
  }
}
layer {
  name: "conv2_1/linear/bn"
  type: "BatchNorm"
  bottom: "conv2_1/linear"
  top: "conv2_1/linear/bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "conv2_1/linear/scale"
  type: "Scale"
  bottom: "conv2_1/linear/bn"
  top: "conv2_1/linear/bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_2/expand"
  type: "Convolution"
  bottom: "conv2_1/linear/bn"
  top: "conv2_2/expand"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 5.48043764743
    scale_out: 11.7062153751
    scale_params: 199.739583941
    scale_params: 2069.02655214
    scale_params: 488747.393289
    scale_params: 992.452840703
    scale_params: 514.661338185
    scale_params: 3011.09858874
    scale_params: 707.689329074
    scale_params: 1215.22319942
    scale_params: 661.726615215
    scale_params: 1455.33881084
    scale_params: 453.335476281
    scale_params: 545.638069837
    scale_params: 598829.217572
    scale_params: 1623.01976362
    scale_params: 787.541539255
    scale_params: 941.991118819
    scale_params: 923.789816882
    scale_params: 1673.55352928
    scale_params: 1655.48192748
    scale_params: 646.778968652
    scale_params: 2119.21801867
    scale_params: 488.507360144
    scale_params: 1020.60602077
    scale_params: 767.774549468
    scale_params: 300.50736214
    scale_params: 2165.93647168
    scale_params: 1110.68556986
    scale_params: 514.695309183
    scale_params: 700.225865293
    scale_params: 17576.2158972
    scale_params: 1605.33474928
    scale_params: 558.682144459
    scale_params: 2380.22696346
    scale_params: 405.913829061
    scale_params: 1690.08282586
    scale_params: 1892.9924814
    scale_params: 935.484673178
    scale_params: 1751.39607554
    scale_params: 4252.67839416
    scale_params: 108692.7019
    scale_params: 3594443.14122
    scale_params: 1798.76711927
    scale_params: 279223.968654
    scale_params: 296.943531425
    scale_params: 341150.768561
    scale_params: 466.416388159
    scale_params: 423.421396716
    scale_params: 905.866766098
    scale_params: 482.818423817
    scale_params: 592.244484189
    scale_params: 310.511064665
    scale_params: 658.436853625
    scale_params: 462.668501962
    scale_params: 3030.28820522
    scale_params: 1300.21087524
    scale_params: 2441.54589655
    scale_params: 2192.32431012
    scale_params: 1373.20146935
    scale_params: 256.44175199
    scale_params: 33323.8240041
    scale_params: 512.118568297
    scale_params: 334.649488348
    scale_params: 934.25955079
    scale_params: 1862.58723268
    scale_params: 972.290658676
    scale_params: 620.062929199
    scale_params: 1332.46341189
    scale_params: 57757.383638
    scale_params: 442998.639208
    scale_params: 1315.51327607
    scale_params: 708.903211899
    scale_params: 1377.72363459
    scale_params: 521.746060638
    scale_params: 1383.65523276
    scale_params: 985.832742995
    scale_params: 479.950721573
    scale_params: 367.635450013
    scale_params: 877.669062673
    scale_params: 240.231505488
    scale_params: 1394.33940744
    scale_params: 1178.03718488
    scale_params: 2700.95865013
    scale_params: 1125.78611845
    scale_params: 253.462594306
    scale_params: 6037.39640934
    scale_params: 634488.783324
    scale_params: 1344.00777626
    scale_params: 369.473156313
    scale_params: 2760.7217762
    scale_params: 584.877350159
    scale_params: 2187.60241599
    scale_params: 382.521688028
    scale_params: 1236.74200523
    scale_params: 1203.31934416
    scale_params: 2126.78331433
    scale_params: 4939065.35172
    is_negative_input: true
  }
}
layer {
  name: "conv2_2/expand/bn"
  type: "BatchNorm"
  bottom: "conv2_2/expand"
  top: "conv2_2/expand/bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "conv2_2/expand/scale"
  type: "Scale"
  bottom: "conv2_2/expand/bn"
  top: "conv2_2/expand/bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_2/expand"
  type: "ReLU"
  bottom: "conv2_2/expand/bn"
  top: "conv2_2/expand/bn"
}
layer {
  name: "conv2_2/dwise"
  type: "Convolution"
  bottom: "conv2_2/expand/bn"
  top: "conv2_2/dwise"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 96
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 11.7062153751
    scale_out: 12.8431550433
    scale_params: 355.018570146
    scale_params: 65.6507150936
    scale_params: 4.59878820796
    scale_params: 72.4400107271
    scale_params: 379.542534259
    scale_params: 96.3128665683
    scale_params: 591.437063091
    scale_params: 103.197391648
    scale_params: 285.481593413
    scale_params: 66.4109404456
    scale_params: 237.995428428
    scale_params: 276.968907289
    scale_params: 72.0474817409
    scale_params: 79.2442217943
    scale_params: 139.296190715
    scale_params: 94.0886950747
    scale_params: 115.44469681
    scale_params: 64.8884566319
    scale_params: 31.7023290184
    scale_params: 446.000250347
    scale_params: 30.1251142395
    scale_params: 67.032997426
    scale_params: 73.6382352812
    scale_params: 114.948320186
    scale_params: 245.21564307
    scale_params: 56.7228298811
    scale_params: 76.1234156662
    scale_params: 54.7940025346
    scale_params: 132.707189978
    scale_params: 528.587094831
    scale_params: 50.7458508182
    scale_params: 142.341733365
    scale_params: 33.810136733
    scale_params: 223.527107156
    scale_params: 42.2345280804
    scale_params: 15.3055746345
    scale_params: 62.1493135448
    scale_params: 147.252989299
    scale_params: 25.127530435
    scale_params: 1149.05009688
    scale_params: 334.015292672
    scale_params: 32.835699391
    scale_params: 7.59985897057
    scale_params: 389.351288476
    scale_params: 5.53916698916
    scale_params: 204.92310545
    scale_params: 322.848591483
    scale_params: 179.450879776
    scale_params: 405.654323284
    scale_params: 190.604952368
    scale_params: 431.585172288
    scale_params: 139.249198455
    scale_params: 73.1084446089
    scale_params: 38.6932207619
    scale_params: 76.3619068235
    scale_params: 23.1555073405
    scale_params: 38.35149221
    scale_params: 73.2357709001
    scale_params: 485.534320737
    scale_params: 3766.06763683
    scale_params: 146.162375091
    scale_params: 205.877509484
    scale_params: 116.074864711
    scale_params: 48.8599105496
    scale_params: 173.549344368
    scale_params: 143.907716711
    scale_params: 75.9630122177
    scale_params: 14528.9069715
    scale_params: 12.1882335799
    scale_params: 99.4547964918
    scale_params: 254.070009568
    scale_params: 67.3277268248
    scale_params: 279.780479544
    scale_params: 39.8676822806
    scale_params: 85.1309219891
    scale_params: 450.967784485
    scale_params: 224.250754253
    scale_params: 37.9816225618
    scale_params: 335.794870566
    scale_params: 81.6681968437
    scale_params: 89.8818202114
    scale_params: 30.0484490043
    scale_params: 93.6535394754
    scale_params: 261.586005639
    scale_params: 50.1388558086
    scale_params: 2716.05671617
    scale_params: 47.566331738
    scale_params: 138.16138929
    scale_params: 28.1275346915
    scale_params: 175.745599465
    scale_params: 37.2000043019
    scale_params: 234.8183959
    scale_params: 144.322200253
    scale_params: 102.295844239
    scale_params: 76.683462047
    scale_params: 4.96962868424
  }
}
layer {
  name: "conv2_2/dwise/bn"
  type: "BatchNorm"
  bottom: "conv2_2/dwise"
  top: "conv2_2/dwise/bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "conv2_2/dwise/scale"
  type: "Scale"
  bottom: "conv2_2/dwise/bn"
  top: "conv2_2/dwise/bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_2/dwise"
  type: "ReLU"
  bottom: "conv2_2/dwise/bn"
  top: "conv2_2/dwise/bn"
}
layer {
  name: "conv2_2/linear"
  type: "Convolution"
  bottom: "conv2_2/dwise/bn"
  top: "conv2_2/linear"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 24
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 12.8431550433
    scale_out: 7.9926887642
    scale_params: 164.461422077
    scale_params: 167.807611009
    scale_params: 221.349490436
    scale_params: 201.528596648
    scale_params: 185.709974139
    scale_params: 109.390748303
    scale_params: 172.117948462
    scale_params: 115.365138577
    scale_params: 202.203940569
    scale_params: 249.205896994
    scale_params: 186.055334246
    scale_params: 275.358266361
    scale_params: 225.706338582
    scale_params: 232.396960339
    scale_params: 240.870358396
    scale_params: 160.677065637
    scale_params: 148.118018568
    scale_params: 127.119525821
    scale_params: 173.828126623
    scale_params: 143.237051596
    scale_params: 176.687769183
    scale_params: 258.566349002
    scale_params: 205.217048326
    scale_params: 214.239814138
  }
}
layer {
  name: "conv2_2/linear/bn"
  type: "BatchNorm"
  bottom: "conv2_2/linear"
  top: "conv2_2/linear/bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "conv2_2/linear/scale"
  type: "Scale"
  bottom: "conv2_2/linear/bn"
  top: "conv2_2/linear/bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_1/expand"
  type: "Convolution"
  bottom: "conv2_2/linear/bn"
  top: "conv3_1/expand"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 144
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 7.9926887642
    scale_out: 30.5727839688
    scale_params: 804.606651644
    scale_params: 1679.51981029
    scale_params: 1067.57931905
    scale_params: 877.269217842
    scale_params: 1091.30457521
    scale_params: 946.233112284
    scale_params: 1077.30728698
    scale_params: 705.177240984
    scale_params: 1626.72567153
    scale_params: 2111.17319783
    scale_params: 1053.53290602
    scale_params: 1287.37056971
    scale_params: 32926061.1823
    scale_params: 23343.3623527
    scale_params: 1191.90074479
    scale_params: 773244.249003
    scale_params: 1786.41623658
    scale_params: 1051.20563072
    scale_params: 1980.44695115
    scale_params: 1121.92694306
    scale_params: 1050.33260633
    scale_params: 709.498485783
    scale_params: 482.72413363
    scale_params: 975.276886578
    scale_params: 4361237.66521
    scale_params: 1323.78994194
    scale_params: 39349.0831325
    scale_params: 1177.0358995
    scale_params: 836.772574738
    scale_params: 1053.43127095
    scale_params: 1284.47385953
    scale_params: 1938.34550834
    scale_params: 972.691243705
    scale_params: 1792.8484076
    scale_params: 979.715545394
    scale_params: 1522.09882986
    scale_params: 2523.9748391
    scale_params: 1843.37975178
    scale_params: 1632.22759345
    scale_params: 1444.80496184
    scale_params: 1331.54442595
    scale_params: 844.974556852
    scale_params: 724.774945933
    scale_params: 1038.16136899
    scale_params: 716.211064987
    scale_params: 1483.48972167
    scale_params: 320642.746211
    scale_params: 1451.24731459
    scale_params: 1870.12404839
    scale_params: 1071.30781265
    scale_params: 2891.23518633
    scale_params: 751.647297264
    scale_params: 1019.49852973
    scale_params: 612.796185702
    scale_params: 1027.73187045
    scale_params: 1308.09913455
    scale_params: 1619.16057792
    scale_params: 1140.21434515
    scale_params: 2443.86111514
    scale_params: 3454.2297511
    scale_params: 1098.99666348
    scale_params: 772.433146007
    scale_params: 749.54096849
    scale_params: 851.488899996
    scale_params: 825.420900436
    scale_params: 795.501876277
    scale_params: 1205.42836126
    scale_params: 1899.13768918
    scale_params: 1044.14832551
    scale_params: 1912.98441502
    scale_params: 3610.20957816
    scale_params: 1097.05269063
    scale_params: 1695375.35027
    scale_params: 1371.36610568
    scale_params: 918.012447657
    scale_params: 2472054.03204
    scale_params: 1262.63345985
    scale_params: 899.410039954
    scale_params: 1888.80713794
    scale_params: 653.626117601
    scale_params: 922.609296797
    scale_params: 1139.97566691
    scale_params: 306.198761154
    scale_params: 1511.95466988
    scale_params: 1203.31212371
    scale_params: 689.029057767
    scale_params: 854.64798202
    scale_params: 1225.90254703
    scale_params: 752.774780162
    scale_params: 1242.64068484
    scale_params: 1199.65673717
    scale_params: 1637952.61973
    scale_params: 978.36259504
    scale_params: 44178.9934576
    scale_params: 795.342195721
    scale_params: 507.908210176
    scale_params: 920.923116856
    scale_params: 670.067025212
    scale_params: 678.152317257
    scale_params: 59041.095833
    scale_params: 779.720889163
    scale_params: 1289.68048061
    scale_params: 1149.75097366
    scale_params: 1323.11021991
    scale_params: 634.904010653
    scale_params: 1034.81416832
    scale_params: 1240.76189666
    scale_params: 909.026264817
    scale_params: 1111.15147698
    scale_params: 815.0054462
    scale_params: 925.500690909
    scale_params: 640.466475333
    scale_params: 982.309846661
    scale_params: 989.604668832
    scale_params: 898.006268152
    scale_params: 1017.85610591
    scale_params: 2042.09348645
    scale_params: 944.024371677
    scale_params: 37865.3966994
    scale_params: 1128.04390342
    scale_params: 1202.86581308
    scale_params: 1298.57650037
    scale_params: 748.866044254
    scale_params: 2269303.62454
    scale_params: 523.031675086
    scale_params: 1594.02210374
    scale_params: 1254.75162101
    scale_params: 800.761874123
    scale_params: 941.335759674
    scale_params: 1282.3570406
    scale_params: 946.796957835
    scale_params: 1442.49508991
    scale_params: 731.009989301
    scale_params: 170903.882175
    scale_params: 860.934969244
    scale_params: 850.170494241
    scale_params: 1106.27322548
    scale_params: 1688.42030183
    scale_params: 1096.36281024
    scale_params: 1727.28568882
    scale_params: 887.280740511
    scale_params: 793.14120566
    scale_params: 940.688060446
    scale_params: 1592.95030372
    is_negative_input: true
  }
}
layer {
  name: "conv3_1/expand/bn"
  type: "BatchNorm"
  bottom: "conv3_1/expand"
  top: "conv3_1/expand/bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "conv3_1/expand/scale"
  type: "Scale"
  bottom: "conv3_1/expand/bn"
  top: "conv3_1/expand/bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_1/expand"
  type: "ReLU"
  bottom: "conv3_1/expand/bn"
  top: "conv3_1/expand/bn"
}
layer {
  name: "conv3_1/dwise"
  type: "Convolution"
  bottom: "conv3_1/expand/bn"
  top: "conv3_1/dwise"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 144
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 144
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 30.5727839688
    scale_out: 17.8609350513
    scale_params: 111.632681961
    scale_params: 40.6962106474
    scale_params: 35.8446150135
    scale_params: 75.0543781364
    scale_params: 62.7325910299
    scale_params: 53.8117568548
    scale_params: 57.6440551077
    scale_params: 118.318981057
    scale_params: 71.2589254654
    scale_params: 50.7349807099
    scale_params: 49.1288771507
    scale_params: 67.4536787075
    scale_params: 922.604502872
    scale_params: 574337.419254
    scale_params: 69.5969312767
    scale_params: 52.1906544547
    scale_params: 83.5088501397
    scale_params: 68.3286870908
    scale_params: 62.6384182864
    scale_params: 70.3654153128
    scale_params: 63.6453159735
    scale_params: 32.6551553057
    scale_params: 115.008007517
    scale_params: 48.8447671359
    scale_params: 37.390431153
    scale_params: 49.4372158766
    scale_params: 38402.9591475
    scale_params: 45.4269509033
    scale_params: 43.7960905236
    scale_params: 38.5717198297
    scale_params: 46.2297981361
    scale_params: 43.3428960949
    scale_params: 39.1578356491
    scale_params: 88.6624150557
    scale_params: 51.4372160304
    scale_params: 71.0886839246
    scale_params: 48.7217865647
    scale_params: 33.7932925711
    scale_params: 77.2272822464
    scale_params: 46.0582463964
    scale_params: 60.1704170625
    scale_params: 156.206220914
    scale_params: 24.6857884344
    scale_params: 48.4190233762
    scale_params: 59.6276670198
    scale_params: 45.4987959842
    scale_params: 4147.16267934
    scale_params: 45.8496464938
    scale_params: 61.3322224656
    scale_params: 61.8154161907
    scale_params: 92.2786567091
    scale_params: 70.282243428
    scale_params: 56.2243592944
    scale_params: 33.6301108712
    scale_params: 70.0567091024
    scale_params: 73.3673913283
    scale_params: 39.776623431
    scale_params: 167.226186253
    scale_params: 28.3605783959
    scale_params: 34.243724194
    scale_params: 72.194327963
    scale_params: 47.8582005353
    scale_params: 74.222761527
    scale_params: 37.4542696473
    scale_params: 69.2966881245
    scale_params: 171.818305211
    scale_params: 38.3720411638
    scale_params: 109.815850502
    scale_params: 58.0206864212
    scale_params: 40.5709341999
    scale_params: 42.7455626962
    scale_params: 48.2842702393
    scale_params: 17.4227351984
    scale_params: 49.4719869173
    scale_params: 52.0347850279
    scale_params: 302.288449019
    scale_params: 40.1165523253
    scale_params: 48.4010116774
    scale_params: 38.7030183431
    scale_params: 41.2230262884
    scale_params: 66.5510883243
    scale_params: 38.2160100763
    scale_params: 109.303083346
    scale_params: 61.9426265386
    scale_params: 64.305939253
    scale_params: 213.92772323
    scale_params: 67.7770625833
    scale_params: 66.5038361865
    scale_params: 48.9667946061
    scale_params: 87.3810753182
    scale_params: 49.8661883597
    scale_params: 936.246466674
    scale_params: 57.9698188927
    scale_params: 18487.8167081
    scale_params: 70.5413832704
    scale_params: 23.2399839865
    scale_params: 73.3520246226
    scale_params: 45.6894724071
    scale_params: 118.365346117
    scale_params: 20481.3906579
    scale_params: 83.447239509
    scale_params: 53.1535772771
    scale_params: 41.5879249658
    scale_params: 81.8822599144
    scale_params: 52.7467288313
    scale_params: 127.38426624
    scale_params: 73.8479563654
    scale_params: 81.5269781281
    scale_params: 53.4548543546
    scale_params: 55.8500966647
    scale_params: 220.825184546
    scale_params: 53.0168328621
    scale_params: 42.3786862206
    scale_params: 70.2057166596
    scale_params: 136.817229505
    scale_params: 251.81080364
    scale_params: 71.0565748295
    scale_params: 47.5736513456
    scale_params: 45473.6237878
    scale_params: 266.962144476
    scale_params: 73.9117529565
    scale_params: 78.1004594597
    scale_params: 190.702635281
    scale_params: 28.8369940474
    scale_params: 64.1826254811
    scale_params: 52.8909397923
    scale_params: 54.7258811566
    scale_params: 72.0329161745
    scale_params: 39.9165161895
    scale_params: 60.1311505907
    scale_params: 53.1948423804
    scale_params: 57.4597023355
    scale_params: 53.8501742903
    scale_params: 16256.9321671
    scale_params: 215.317676945
    scale_params: 37.4118730145
    scale_params: 80.9139021261
    scale_params: 63.4367342332
    scale_params: 38.8656345723
    scale_params: 34.6585880264
    scale_params: 56.141055458
    scale_params: 42.8662024865
    scale_params: 74.5185105911
    scale_params: 48.2812329938
  }
}
layer {
  name: "conv3_1/dwise/bn"
  type: "BatchNorm"
  bottom: "conv3_1/dwise"
  top: "conv3_1/dwise/bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "conv3_1/dwise/scale"
  type: "Scale"
  bottom: "conv3_1/dwise/bn"
  top: "conv3_1/dwise/bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_1/dwise"
  type: "ReLU"
  bottom: "conv3_1/dwise/bn"
  top: "conv3_1/dwise/bn"
}
layer {
  name: "conv3_1/linear"
  type: "Convolution"
  bottom: "conv3_1/dwise/bn"
  top: "conv3_1/linear"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 24
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 17.8609350513
    scale_out: 7.9926887642
    scale_params: 247.192732484
    scale_params: 244.272217504
    scale_params: 241.8126385
    scale_params: 205.626630185
    scale_params: 375.726559636
    scale_params: 395.783614548
    scale_params: 136.846807311
    scale_params: 190.497115954
    scale_params: 229.785145768
    scale_params: 206.982762692
    scale_params: 325.581724327
    scale_params: 239.822751183
    scale_params: 331.738160096
    scale_params: 206.205884345
    scale_params: 242.383897303
    scale_params: 162.378347648
    scale_params: 253.485692205
    scale_params: 261.414721112
    scale_params: 155.459668563
    scale_params: 211.060063925
    scale_params: 252.845548943
    scale_params: 391.363152114
    scale_params: 237.64509468
    scale_params: 250.672229667
  }
}
layer {
  name: "conv3_1/linear/bn"
  type: "BatchNorm"
  bottom: "conv3_1/linear"
  top: "conv3_1/linear/bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "conv3_1/linear/scale"
  type: "Scale"
  bottom: "conv3_1/linear/bn"
  top: "conv3_1/linear/bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "block_3_1"
  type: "Eltwise"
  bottom: "conv2_2/linear/bn"
  bottom: "conv3_1/linear/bn"
  top: "block_3_1"
}
layer {
  name: "conv3_2/expand"
  type: "Convolution"
  bottom: "block_3_1"
  top: "conv3_2/expand"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 144
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 7.9926887642
    scale_out: 20.1481927291
    scale_params: 7912.10700178
    scale_params: 1038.40112539
    scale_params: 832.640174757
    scale_params: 752.088978276
    scale_params: 5909.37762141
    scale_params: 1131.76324405
    scale_params: 890.359230471
    scale_params: 2758.31430571
    scale_params: 482.627803169
    scale_params: 690.976522127
    scale_params: 3351.28509961
    scale_params: 7767.62782248
    scale_params: 1052.84229105
    scale_params: 984.699439046
    scale_params: 585.649965051
    scale_params: 2752.19353002
    scale_params: 1860.41773442
    scale_params: 1714.62088269
    scale_params: 1276.83681488
    scale_params: 650.853700934
    scale_params: 864.11174411
    scale_params: 1941.13693961
    scale_params: 1041.31141798
    scale_params: 542.522095544
    scale_params: 125947.946766
    scale_params: 1724.84378906
    scale_params: 4505.59320622
    scale_params: 814.849526347
    scale_params: 3632.50075407
    scale_params: 3846.93278495
    scale_params: 3934.59007409
    scale_params: 2295.38108818
    scale_params: 3137.99324046
    scale_params: 1980.45408421
    scale_params: 3477015.27946
    scale_params: 996.653282343
    scale_params: 1412.74992315
    scale_params: 2343.06484207
    scale_params: 695.295489328
    scale_params: 584.987707868
    scale_params: 870.550464921
    scale_params: 646.407430068
    scale_params: 2302048.59456
    scale_params: 1316.61361968
    scale_params: 1260.80399725
    scale_params: 995.52393196
    scale_params: 544.161545539
    scale_params: 808.345058008
    scale_params: 4183.71448743
    scale_params: 879.77683044
    scale_params: 1565.68727517
    scale_params: 863.329390346
    scale_params: 823.921306415
    scale_params: 760.95564412
    scale_params: 55411.310102
    scale_params: 615.310145469
    scale_params: 5557.161208
    scale_params: 858.24462657
    scale_params: 744.282493948
    scale_params: 2686.60729079
    scale_params: 3331.34863082
    scale_params: 739.53338663
    scale_params: 1333632.87401
    scale_params: 2106109.27637
    scale_params: 1785.92959777
    scale_params: 2204.1533683
    scale_params: 975.747404595
    scale_params: 762.550304519
    scale_params: 1021.53504486
    scale_params: 3031.15954822
    scale_params: 815.419729981
    scale_params: 995.366624628
    scale_params: 2582.07608646
    scale_params: 810.241799614
    scale_params: 725.284218258
    scale_params: 500.386715778
    scale_params: 898.93486518
    scale_params: 906.129114187
    scale_params: 691.158074561
    scale_params: 1543.3546527
    scale_params: 812.705830613
    scale_params: 883.981073313
    scale_params: 475.461794138
    scale_params: 842.213489427
    scale_params: 950.376649001
    scale_params: 1389.61467657
    scale_params: 1058.08982613
    scale_params: 1383653.9148
    scale_params: 1894258.89516
    scale_params: 1448.7111643
    scale_params: 873.198202012
    scale_params: 1382.4756842
    scale_params: 3670.97941756
    scale_params: 921.53331314
    scale_params: 622.490466199
    scale_params: 1807.73627
    scale_params: 2043.70893589
    scale_params: 1171.65691567
    scale_params: 838.333623474
    scale_params: 1182.91287155
    scale_params: 3604.53006368
    scale_params: 768.475549573
    scale_params: 1485.95760148
    scale_params: 1607.46888127
    scale_params: 5332489.8654
    scale_params: 814.059935254
    scale_params: 4143.26607805
    scale_params: 1547.25453883
    scale_params: 3924.54963651
    scale_params: 2528.25736246
    scale_params: 896.878700226
    scale_params: 815.416141303
    scale_params: 481.797579148
    scale_params: 2282.34638146
    scale_params: 2358.03794339
    scale_params: 751.562191213
    scale_params: 1549.61143976
    scale_params: 556.508238555
    scale_params: 45892.0044998
    scale_params: 958.367641305
    scale_params: 1737.86294724
    scale_params: 389.7614229
    scale_params: 841.557179021
    scale_params: 1889.46539495
    scale_params: 4749.44406699
    scale_params: 1119.44140637
    scale_params: 515.466440018
    scale_params: 788.813750721
    scale_params: 2436.63475876
    scale_params: 879.320626894
    scale_params: 776.593091978
    scale_params: 727.754903052
    scale_params: 1283.64237893
    scale_params: 1463.79464068
    scale_params: 910.202391802
    scale_params: 2572580.59379
    scale_params: 2265.81800959
    scale_params: 711.137021292
    scale_params: 719.108011759
    scale_params: 961.157604315
    scale_params: 817.908339038
    scale_params: 4231.99625801
    scale_params: 648.006643363
    scale_params: 847.207208576
    is_negative_input: true
  }
}
layer {
  name: "conv3_2/expand/bn"
  type: "BatchNorm"
  bottom: "conv3_2/expand"
  top: "conv3_2/expand/bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "conv3_2/expand/scale"
  type: "Scale"
  bottom: "conv3_2/expand/bn"
  top: "conv3_2/expand/bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_2/expand"
  type: "ReLU"
  bottom: "conv3_2/expand/bn"
  top: "conv3_2/expand/bn"
}
layer {
  name: "conv3_2/dwise"
  type: "Convolution"
  bottom: "conv3_2/expand/bn"
  top: "conv3_2/dwise"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 144
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 144
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 20.1481927291
    scale_out: 27.769091192
    scale_params: 20.9905139359
    scale_params: 234.1720506
    scale_params: 289.707013235
    scale_params: 238.004387435
    scale_params: 57.2350022826
    scale_params: 206.656039727
    scale_params: 243.857925805
    scale_params: 105.911639727
    scale_params: 321.543796723
    scale_params: 200.045425487
    scale_params: 65.0092237337
    scale_params: 33.4963561759
    scale_params: 171.398769009
    scale_params: 160.374851053
    scale_params: 417.180295373
    scale_params: 76.4045632182
    scale_params: 86.0959877459
    scale_params: 132.769160011
    scale_params: 58.4479364788
    scale_params: 312.025393667
    scale_params: 127.486474281
    scale_params: 129.559510668
    scale_params: 209.32685336
    scale_params: 235.77152749
    scale_params: 142171.791976
    scale_params: 60.9755146287
    scale_params: 44.270702927
    scale_params: 263.043535752
    scale_params: 44.0042838114
    scale_params: 31.9285038636
    scale_params: 42.3559471172
    scale_params: 153.83201208
    scale_params: 52.7271756135
    scale_params: 63.7304362926
    scale_params: 119.79054018
    scale_params: 301.008458218
    scale_params: 253.845760841
    scale_params: 53.8476266631
    scale_params: 284.107354574
    scale_params: 213.225316845
    scale_params: 267.067364522
    scale_params: 347.035060745
    scale_params: 97.0429756024
    scale_params: 219.247209821
    scale_params: 53.6132302368
    scale_params: 161.511038348
    scale_params: 386.273531668
    scale_params: 172.430973355
    scale_params: 32.1381720933
    scale_params: 202.349883327
    scale_params: 163.353386581
    scale_params: 218.406331725
    scale_params: 172.58422959
    scale_params: 154.299169595
    scale_params: 140809.748139
    scale_params: 327.154080094
    scale_params: 37.0354132362
    scale_params: 264.670959664
    scale_params: 289.522565319
    scale_params: 62.7055185634
    scale_params: 59.0216063801
    scale_params: 315.659674358
    scale_params: 20.4449184643
    scale_params: 18.8330907587
    scale_params: 91.3534396331
    scale_params: 110.92445821
    scale_params: 198.885994621
    scale_params: 163.439381984
    scale_params: 144.3434555
    scale_params: 138.388581129
    scale_params: 185.029432678
    scale_params: 262.216554753
    scale_params: 80.1978624005
    scale_params: 193.559128197
    scale_params: 164.538626189
    scale_params: 207.036864344
    scale_params: 215.549723682
    scale_params: 129.829997494
    scale_params: 121.562695342
    scale_params: 69.3250606392
    scale_params: 210.227816528
    scale_params: 186.862799252
    scale_params: 176.79584792
    scale_params: 166.108265278
    scale_params: 223.765680537
    scale_params: 160.723413243
    scale_params: 143.829662775
    scale_params: 126.048096311
    scale_params: 87.7932675245
    scale_params: 71.9939347819
    scale_params: 247.41033124
    scale_params: 185.551920331
    scale_params: 84.2232249063
    scale_params: 230.05763916
    scale_params: 365.99454763
    scale_params: 53.0238254364
    scale_params: 151.246674439
    scale_params: 62.4761447229
    scale_params: 208.784690201
    scale_params: 290.996591279
    scale_params: 26.0877460471
    scale_params: 102.588594736
    scale_params: 222.315314304
    scale_params: 71.0223782314
    scale_params: 103.29103289
    scale_params: 193.73098288
    scale_params: 45.9484020002
    scale_params: 44.2430222194
    scale_params: 30.3882778132
    scale_params: 65.9680836434
    scale_params: 216.231910485
    scale_params: 219.809655544
    scale_params: 190.702993716
    scale_params: 77.8063073934
    scale_params: 128.836142894
    scale_params: 257.322542332
    scale_params: 49.6297365893
    scale_params: 111.820013723
    scale_params: 2262323.86098
    scale_params: 215.974068999
    scale_params: 144.079733932
    scale_params: 282.145505972
    scale_params: 226.61371322
    scale_params: 67.3780195584
    scale_params: 45.3008726605
    scale_params: 166.04173061
    scale_params: 215.158758956
    scale_params: 114.211303406
    scale_params: 128.212651236
    scale_params: 234.900200735
    scale_params: 145.658065732
    scale_params: 234.277617094
    scale_params: 235.423387581
    scale_params: 181.611298444
    scale_params: 243.586530404
    scale_params: 77.9398123712
    scale_params: 63.7065680803
    scale_params: 249.100837426
    scale_params: 241.145829351
    scale_params: 160.965292658
    scale_params: 161.09803338
    scale_params: 38.9592806077
    scale_params: 245.121336478
    scale_params: 330.367615543
  }
}
layer {
  name: "conv3_2/dwise/bn"
  type: "BatchNorm"
  bottom: "conv3_2/dwise"
  top: "conv3_2/dwise/bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "conv3_2/dwise/scale"
  type: "Scale"
  bottom: "conv3_2/dwise/bn"
  top: "conv3_2/dwise/bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_2/dwise"
  type: "ReLU"
  bottom: "conv3_2/dwise/bn"
  top: "conv3_2/dwise/bn"
}
layer {
  name: "conv3_2/linear"
  type: "Convolution"
  bottom: "conv3_2/dwise/bn"
  top: "conv3_2/linear"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 27.769091192
    scale_out: 10.5052360373
    scale_params: 137.139415211
    scale_params: 288.428892617
    scale_params: 166.159471124
    scale_params: 214.61555326
    scale_params: 202.507372626
    scale_params: 250.299547049
    scale_params: 210.247253853
    scale_params: 206.519273588
    scale_params: 183.035788212
    scale_params: 183.993966308
    scale_params: 207.409161253
    scale_params: 166.128002928
    scale_params: 197.866740908
    scale_params: 194.589895932
    scale_params: 175.559582181
    scale_params: 190.061291125
    scale_params: 143.336599293
    scale_params: 235.386768226
    scale_params: 88.3886976971
    scale_params: 177.93411756
    scale_params: 242.863926854
    scale_params: 150.981635028
    scale_params: 194.939977662
    scale_params: 184.188759065
    scale_params: 223.803098403
    scale_params: 147.788152873
    scale_params: 200.887120579
    scale_params: 162.638346139
    scale_params: 213.428947718
    scale_params: 222.352387868
    scale_params: 162.576608435
    scale_params: 174.494041448
  }
}
layer {
  name: "conv3_2/linear/bn"
  type: "BatchNorm"
  bottom: "conv3_2/linear"
  top: "conv3_2/linear/bn"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "conv3_2/linear/scale"
  type: "Scale"
  bottom: "conv3_2/linear/bn"
  top: "conv3_2/linear/bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv4_1/expand"
  type: "Convolution"
  bottom: "conv3_2/linear/bn"
  top: "conv4_1/expand"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 10.5052360373
    scale_out: 53.713993431
    scale_params: 1527.77540615
    scale_params: 4057.45041085
    scale_params: 1763.51796397
    scale_params: 3050.36715407
    scale_params: 2811.09186188
    scale_params: 1312.95493505
    scale_params: 2039.78554123
    scale_params: 2047.23982459
    scale_params: 1670.2387332
    scale_params: 1762.64336309
    scale_params: 1494.34659363
    scale_params: 1674.11533148
    scale_params: 1230.66187195
    scale_params: 1757.53786408
    scale_params: 15205.2006632
    scale_params: 46997.90606
    scale_params: 39225.7614024
    scale_params: 1623.90744891
    scale_params: 3142.84692809
    scale_params: 1117.92085921
    scale_params: 1790.97428177
    scale_params: 2440.2161246
    scale_params: 7812968.16674
    scale_params: 1463.75353685
    scale_params: 1755.55904473
    scale_params: 1795.02223984
    scale_params: 4234.7748071
    scale_params: 3777.32002816
    scale_params: 1531.99646751
    scale_params: 1868.84995139
    scale_params: 1792.56861279
    scale_params: 2284.85411486
    scale_params: 2051.68093964
    scale_params: 2178.01774177
    scale_params: 1283.40404442
    scale_params: 2154.28657969
    scale_params: 1379.01634434
    scale_params: 2197.35113044
    scale_params: 2130.11359476
    scale_params: 1194.66720493
    scale_params: 2539.22013482
    scale_params: 4000.03131756
    scale_params: 1691.68566595
    scale_params: 1500.43646605
    scale_params: 1276.41449559
    scale_params: 2363.44735326
    scale_params: 1427.11094512
    scale_params: 2512.67643706
    scale_params: 2626.28795373
    scale_params: 1572.03142098
    scale_params: 2912.87710871
    scale_params: 1945.3258734
    scale_params: 1866.64765478
    scale_params: 1235.45202705
    scale_params: 1984.22360467
    scale_params: 1100.55288683
    scale_params: 2221.84686827
    scale_params: 569582.672785
    scale_params: 2372.41124863
    scale_params: 2745.76477838
    scale_params: 36876.0234822
    scale_params: 1918.10294277
    scale_params: 1911.37753259
    scale_params: 73977.5192007
    scale_params: 1469.4743738
    scale_params: 1685.77265774
    scale_params: 2170.72952903
    scale_params: 195237.96235
    scale_params: 3249.33389885
    scale_params: 2804.6391279
    scale_params: 2812.65271708
    scale_params: 4222.06114312
    scale_params: 1882.42743086
    scale_params: 1933.15228393
    scale_params: 2039.72988954
    scale_params: 1984.07047912
    scale_params: 1934.02898107
    scale_params: 6501.51521319
    scale_params: 1919.64678678
    scale_params: 1260.79224698
    scale_params: 212899.865905
    scale_params: 3228.75523429
    scale_params: 1780.55272595
    scale_params: 2485.08897262
    scale_params: 1138.18800024
    scale_params: 2228.39159887
    scale_params: 2423.78437974
    scale_params: 2833.86645326
    scale_params: 1596.57803563
    scale_params: 1271.90407889
    scale_params: 1814.30250702
    scale_params: 2395.55578579
    scale_params: 2633.57813669
    scale_params: 1589.32746148
    scale_params: 1074.39126391
    scale_params: 1287.93805077
    scale_params: 1501.62251454
    scale_params: 1917.07545161
    scale_params: 2194.48008046
    scale_params: 1559.66322956
    scale_params: 4056.70494055
    scale_params: 2645.06452167
    scale_params: 3085.70658414
    scale_params: 1513.97224008
    scale_params: 1871.56590729
    scale_params: 2973.0153929
    scale_params: 2153.01924696
    scale_params: 375684.638212
    scale_params: 1625.19376975
    scale_params: 2365.55454778
    scale_params: 2481.44504053
    scale_params: 2248.28528878
    scale_params: 1384.70427405
    scale_params: 3995.68764833
    scale_params: 47860.7723284
    scale_params: 1727.03403105
    scale_params: 1356.27225936
    scale_params: 1143.9957756
    scale_params: 2241.41834951
    scale_params: 1476.06983098
    scale_params: 3084.64729659
    scale_params: 1767.26231059
    scale_params: 2030.80552358
    scale_params: 11365150.3603
