layer {
  name: "data"
  type: "DummyData"
  top: "data"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 0.01
    }
    shape {
      dim: 1
      dim: 3
      dim: 224
      dim: 224
    }
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 3
    kernel_size: 7
    stride: 2
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 45.3980140196
    scale_out: 115.923058256
    scale_params: 1.22526346782e+11
    is_negative_input: true
  }
}
layer {
  name: "conv1_bn"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv1_scale"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 1
  }
}
layer {
  name: "resx1_conv1"
  type: "Convolution"
  bottom: "pool1"
  top: "resx1_conv1"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 45.3980140196
    scale_out: 115.923058256
    scale_params: 1.22526346782e+11
    scale_params: 3.95926493676e+13
    scale_params: 710.87544295
    scale_params: 1158.92023466
    scale_params: 606.721334732
    scale_params: 495.133080296
    scale_params: 783.888821818
    scale_params: 500.673201457
    scale_params: 558.663980376
    scale_params: 750.73334997
    scale_params: 4.03729636737e+14
    scale_params: 535.766776827
    scale_params: 51579002.5382
    scale_params: 931.664588206
    scale_params: 5.42141425817e+14
    scale_params: 606.462470995
    scale_params: 431.640297462
    scale_params: 571.635688048
    scale_params: 1181.49785162
    scale_params: 530.001821308
    scale_params: 393.020940148
    scale_params: 402.771782847
    scale_params: 358.840680827
    scale_params: 568.37215553
    scale_params: 2.59476146164e+15
    scale_params: 785.587092771
    scale_params: 762697790.187
    scale_params: 892.04830201
    scale_params: 342.965306074
    scale_params: 1072.2913431
    scale_params: 493.862817946
    scale_params: 1123295.63504
    scale_params: 561.70540279
    scale_params: 411.763891312
    scale_params: 324357.203922
    scale_params: 662.160011834
    scale_params: 22674.7560009
    scale_params: 1.90714970335e+15
    scale_params: 471.539350357
    scale_params: 929.796549851
    scale_params: 1428.25973107
    scale_params: 2.7464489143e+11
    scale_params: 43372316188.1
    scale_params: 944.47724703
    scale_params: 799.655335967
    scale_params: 1171.32311065
    scale_params: 501.747629734
    scale_params: 1.87526863252e+13
    scale_params: 2.7028898069e+14
    scale_params: 1660.42409926
    scale_params: 1049.6012595
    scale_params: 138771694.425
    scale_params: 6.68972544016e+13
    scale_params: 849.63248412
    scale_params: 2587.55003458
    scale_params: 924.30677505
    scale_params: 1250.4635566
    scale_params: 445.280371872
    scale_params: 4.21465873569e+15
    scale_params: 3.24218118623e+15
    scale_params: 457.686209976
    scale_params: 1.17244746312e+13
    scale_params: 1439.57702089
    scale_params: 472.272327889
    scale_params: 1600.67133187
    scale_params: 1943.36019343
    scale_params: 569.582644235
    scale_params: 1006.58667287
    scale_params: 666.684845381
    scale_params: 336.292743472
    scale_params: 694.148357759
    scale_params: 354.641130541
    scale_params: 3643.37566448
    scale_params: 491.834885062
    scale_params: 1939.40299345
    scale_params: 4.06252533401e+11
    scale_params: 12104.1491917
    scale_params: 634.775625577
    scale_params: 416.41939269
    scale_params: 690.922803142
    scale_params: 511.269621146
    scale_params: 496.863494705
    scale_params: 436.092525345
    scale_params: 1.07142713287e+14
    scale_params: 449.594187345
    scale_params: 507.793156478
    scale_params: 704.337065275
    scale_params: 915.721171545
    scale_params: 900.570153821
    scale_params: 710.81745913
    scale_params: 816.648444579
    scale_params: 405.962707065
    scale_params: 452.386584582
    scale_params: 2.02312834602e+14
    scale_params: 2146.0547473
    scale_params: 485322.20609
    scale_params: 1708.35359052
    scale_params: 3214.52276175
    scale_params: 1.0097263999e+13
    scale_params: 241540.294832
    scale_params: 2170.52940633
    scale_params: 552.339157046
    scale_params: 783.058264566
    scale_params: 239.919453426
    scale_params: 331.292249196
    scale_params: 453.881623463
    scale_params: 341.820823189
    scale_params: 9.00888346734e+14
    scale_params: 376.412823649
    scale_params: 405.635248259
    scale_params: 491.448615094
    scale_params: 694.604219739
    scale_params: 36388421.9941
    scale_params: 1.91827407021e+11
    scale_params: 270516.784449
    scale_params: 3079.93317388
    scale_params: 693.119638735
    scale_params: 881.306644521
    scale_params: 2.58521442201e+15
    scale_params: 426.927387799
    scale_params: 460.686011227
    scale_params: 412.964657876
    scale_params: 1130.30828924
    scale_params: 400.466234739
    scale_params: 220.550092316
    scale_params: 1661.92675283
    scale_params: 5620650329.22
    scale_params: 340158266.633
  }
}
layer {
  name: "resx1_conv1_bn"
  type: "BatchNorm"
  bottom: "resx1_conv1"
  top: "resx1_conv1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "resx1_conv1_scale"
  type: "Scale"
  bottom: "resx1_conv1"
  top: "resx1_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "resx1_conv1_relu"
  type: "ReLU"
  bottom: "resx1_conv1"
  top: "resx1_conv1"
}
layer {
  name: "resx1_conv2"
  type: "Convolution"
  bottom: "resx1_conv1"
  top: "resx1_conv2"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 32
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 115.923058256
    scale_out: 60.9504774727
    scale_params: 62.5236346665
    scale_params: 205.402416409
    scale_params: 49.9189526886
    scale_params: 133.018973579
    scale_params: 53.7162072455
    scale_params: 155.018281145
    scale_params: 136.789139796
    scale_params: 216.301780832
    scale_params: 117.490655532
    scale_params: 82.1560356147
    scale_params: 165.698166928
    scale_params: 106.161812495
    scale_params: 3.8898944952e+11
    scale_params: 109.273452052
    scale_params: 35.2054512355
    scale_params: 50.7669663417
    scale_params: 196.103512375
    scale_params: 65.551291
    scale_params: 100.07787667
    scale_params: 119.923429344
    scale_params: 123.672854566
    scale_params: 74.7666608581
    scale_params: 206.571551033
    scale_params: 163.976112984
    scale_params: 82.3907081104
    scale_params: 87.8869065115
    scale_params: 597.447748051
    scale_params: 113273.125697
    scale_params: 86.2206012191
    scale_params: 325.449069253
    scale_params: 255.710097368
    scale_params: 41.1001313225
    scale_params: 104.453449453
    scale_params: 96.2845593058
    scale_params: 303.428903157
    scale_params: 91.6359722853
    scale_params: 42.6565189823
    scale_params: 40.2645138707
    scale_params: 267.563745956
    scale_params: 1528.01891031
    scale_params: 68.3905129834
    scale_params: 62.9094900894
    scale_params: 640.151864581
    scale_params: 198.982911727
    scale_params: 281.632814016
    scale_params: 48.5103568286
    scale_params: 66.0275265191
    scale_params: 179.060876733
    scale_params: 118.359020873
    scale_params: 110.245695609
    scale_params: 175.809796273
    scale_params: 62.9679861052
    scale_params: 246.097862269
    scale_params: 103.72814749
    scale_params: 105.17316089
    scale_params: 144.321359558
    scale_params: 84.7933960443
    scale_params: 78.7835137483
    scale_params: 160.00656275
    scale_params: 32.004733568
    scale_params: 127.303005631
    scale_params: 76.2442835567
    scale_params: 34.3946627367
    scale_params: 146.680861217
    scale_params: 548.791563568
    scale_params: 85.9488316568
    scale_params: 80.9664059021
    scale_params: 73.4928182344
    scale_params: 124.971358905
    scale_params: 449.885287094
    scale_params: 134.333843212
    scale_params: 73.7674714511
    scale_params: 353.591109054
    scale_params: 80.9516281002
    scale_params: 101.840991642
    scale_params: 120.963180797
    scale_params: 48.7857303852
    scale_params: 87.2562960345
    scale_params: 357.335451814
    scale_params: 95.7048101911
    scale_params: 74.1057542646
    scale_params: 68.6716756089
    scale_params: 108.680789057
    scale_params: 132.307433684
    scale_params: 135.395536974
    scale_params: 116.789357078
    scale_params: 197.590916354
    scale_params: 303.505578128
    scale_params: 194.0251712
    scale_params: 101.495936698
    scale_params: 91.5062995159
    scale_params: 228.294214607
    scale_params: 89.6064876127
    scale_params: 35.343545658
    scale_params: 106.226415184
    scale_params: 96.438465049
    scale_params: 102.381892966
    scale_params: 11357.7120839
    scale_params: 67.0659797945
    scale_params: 64.9249165883
    scale_params: 152.954604414
    scale_params: 66.5375879869
    scale_params: 58.6237815661
    scale_params: 155.721305091
    scale_params: 145.309556569
    scale_params: 63.6119422305
    scale_params: 166.602244929
    scale_params: 110.286758786
    scale_params: 194.889998387
    scale_params: 369.89767856
    scale_params: 221.966413344
    scale_params: 3.01568061906e+11
    scale_params: 56.8353158814
    scale_params: 286.75140147
    scale_params: 67.5634479014
    scale_params: 37.8218921759
    scale_params: 45.8848483507
    scale_params: 127.693273377
    scale_params: 81.04405022
    scale_params: 77.667788892
    scale_params: 120.406227357
    scale_params: 149.004430188
    scale_params: 127.06060994
    scale_params: 202.979961279
    scale_params: 38.4940517683
    scale_params: 223.863599848
    scale_params: 264.240564221
    scale_params: 92.4432936492
  }
}
layer {
  name: "resx1_conv2_bn"
  type: "BatchNorm"
  bottom: "resx1_conv2"
  top: "resx1_conv2"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "resx1_conv2_scale"
  type: "Scale"
  bottom: "resx1_conv2"
  top: "resx1_conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "resx1_conv2_relu"
  type: "ReLU"
  bottom: "resx1_conv2"
  top: "resx1_conv2"
}
layer {
  name: "resx1_conv3"
  type: "Convolution"
  bottom: "resx1_conv2"
  top: "resx1_conv3"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 60.9504774727
    scale_out: 32.4903747841
    scale_params: 506.596934488
    scale_params: 134.461240483
    scale_params: 295.435466084
    scale_params: 328.913933084
    scale_params: 190.627240369
    scale_params: 3.32719037737e+13
    scale_params: 560.152361404
    scale_params: 320.394311022
    scale_params: 326.1880898
    scale_params: 187.254995414
    scale_params: 301.410335258
    scale_params: 553.93936271
    scale_params: 522.908192732
    scale_params: 389.488010809
    scale_params: 3.90573600762e+11
    scale_params: 274.548363957
    scale_params: 242.44964915
    scale_params: 225.499188843
    scale_params: 300.036489802
    scale_params: 5.56704188584e+11
    scale_params: 439.744700769
    scale_params: 343.616881638
    scale_params: 558.070854905
    scale_params: 107.285980146
    scale_params: 476.688420838
    scale_params: 570.761832818
    scale_params: 209.940989881
    scale_params: 239.192846082
    scale_params: 677.251414566
    scale_params: 1020.28719439
    scale_params: 449.051536554
    scale_params: 629.202575035
    scale_params: 285.920057358
    scale_params: 291.712056823
    scale_params: 835738852.752
    scale_params: 1984.2760377
    scale_params: 241.125034615
    scale_params: 2.07565142726e+14
    scale_params: 181.105288179
    scale_params: 376.217256467
    scale_params: 651.364452473
    scale_params: 4.52788485255e+13
    scale_params: 31501654989.4
    scale_params: 262.772740682
    scale_params: 1.15007134256e+14
    scale_params: 562.820091273
    scale_params: 986.713277807
    scale_params: 590.245951785
    scale_params: 376.696249676
    scale_params: 219739164.9
    scale_params: 2127.69468018
    scale_params: 458.065078497
    scale_params: 262.4296764
    scale_params: 393.588124303
    scale_params: 32661343573.4
    scale_params: 826.204982324
    scale_params: 380.921691482
    scale_params: 665.704661815
    scale_params: 238.873575754
    scale_params: 325.779203799
    scale_params: 660.596136684
    scale_params: 394.494978151
    scale_params: 217.736474566
    scale_params: 726.22575815
    scale_params: 764.502269333
    scale_params: 292.488011899
    scale_params: 118482723.528
    scale_params: 3364347.02117
    scale_params: 417.746544269
    scale_params: 332.46011111
    scale_params: 525.667910601
    scale_params: 664.592069368
    scale_params: 6.23846990801e+12
    scale_params: 694.846990553
    scale_params: 1385.47275823
    scale_params: 147.259736723
    scale_params: 775.228785216
    scale_params: 377.40611739
    scale_params: 145.679606749
    scale_params: 846.782382511
    scale_params: 4.18899228825e+13
    scale_params: 359.204891658
    scale_params: 2.62002624096e+13
    scale_params: 335.279185445
    scale_params: 409.110231998
    scale_params: 639.712888764
    scale_params: 389.137927401
    scale_params: 635.004485132
    scale_params: 554.071309779
    scale_params: 110.09163366
    scale_params: 404.392069901
    scale_params: 368.196953584
    scale_params: 412.987950565
    scale_params: 1.90604375748e+12
    scale_params: 391.666380735
    scale_params: 317.662071461
    scale_params: 539.582112426
    scale_params: 247.775231436
    scale_params: 402.812215532
    scale_params: 118.528668642
    scale_params: 353.837877577
    scale_params: 623.119525147
    scale_params: 454.865982203
    scale_params: 1156.4494888
    scale_params: 293.336884148
    scale_params: 453.348111979
    scale_params: 375.36022758
    scale_params: 228.197343036
    scale_params: 183.460392668
    scale_params: 712.55287743
    scale_params: 83.251571917
    scale_params: 1635266378.65
    scale_params: 259.69203813
    scale_params: 48970909073.0
    scale_params: 1.67506536089e+13
    scale_params: 938.61910459
    scale_params: 613.010526404
    scale_params: 418.711584306
    scale_params: 406.280120212
    scale_params: 854.53127184
    scale_params: 338.772932749
    scale_params: 9274596.16681
    scale_params: 206.328628309
    scale_params: 2857262686.14
    scale_params: 71989255261.5
    scale_params: 300.245179809
    scale_params: 928.342611283
    scale_params: 7.10593155647e+12
    scale_params: 192.497910283
    scale_params: 542.904971597
    scale_params: 399.114191327
    scale_params: 425.424148913
    scale_params: 187909889.991
    scale_params: 778.085435033
    scale_params: 518.807142116
    scale_params: 994.142653468
    scale_params: 914.185942553
    scale_params: 430.805401074
    scale_params: 725.462203521
    scale_params: 153.901435627
    scale_params: 310.973064869
    scale_params: 285.392154452
    scale_params: 153.510181735
    scale_params: 205.952353207
    scale_params: 652.179541513
    scale_params: 411.416325825
    scale_params: 169.762579459
    scale_params: 5009739528.99
    scale_params: 405.421838466
    scale_params: 902.163461219
    scale_params: 295.87911527
    scale_params: 543.523260088
    scale_params: 465.247426183
    scale_params: 9703166595.48
    scale_params: 6.64736696957e+11
    scale_params: 218.465630089
    scale_params: 353.372373618
    scale_params: 1369.29569608
    scale_params: 4.18641543448e+13
    scale_params: 249.871550204
    scale_params: 590.039307544
    scale_params: 688.715471947
    scale_params: 591.403163957
    scale_params: 1239.31474192
    scale_params: 337.004184979
    scale_params: 250.501504921
    scale_params: 450.574642603
    scale_params: 52092746304.6
    scale_params: 792.65479852
    scale_params: 503.393693459
    scale_params: 453.79119215
    scale_params: 149.113880615
    scale_params: 220.242009339
    scale_params: 412.649784234
    scale_params: 470.016634175
    scale_params: 670.900840591
    scale_params: 488.72686703
    scale_params: 501.97038909
    scale_params: 202.314434441
    scale_params: 532.064002809
    scale_params: 789608400.044
    scale_params: 1473.54905106
    scale_params: 9088.30821753
    scale_params: 424.192250267
    scale_params: 169.589289204
    scale_params: 251.795746252
    scale_params: 267.364834572
    scale_params: 1258.29107615
    scale_params: 1929.77532998
    scale_params: 4.83763831494e+12
    scale_params: 2528.18349001
    scale_params: 162.898132438
    scale_params: 453.964739913
    scale_params: 613.765414968
    scale_params: 242.030926295
    scale_params: 225.337903462
    scale_params: 1.37073970728e+13
    scale_params: 1.2158367167e+15
    scale_params: 207.795119916
    scale_params: 1053.7843108
    scale_params: 719.392929684
    scale_params: 1113.46855853
    scale_params: 171.730521476
    scale_params: 401.770263792
    scale_params: 539.403509162
    scale_params: 603.782529282
    scale_params: 475.044929144
    scale_params: 659.301369778
    scale_params: 466.060689418
    scale_params: 459.522419469
    scale_params: 18517046207.4
    scale_params: 376.190686983
    scale_params: 2925.79584029
    scale_params: 278.229702364
    scale_params: 473.597088055
    scale_params: 2419.82328881
    scale_params: 497.947158914
    scale_params: 750.132261859
    scale_params: 692.296348212
    scale_params: 260.017712197
    scale_params: 443.623605444
    scale_params: 621311903.764
    scale_params: 446.879441909
    scale_params: 12016110.0067
    scale_params: 620967.860505
    scale_params: 144.285003973
    scale_params: 1431.19778204
    scale_params: 402.996168644
    scale_params: 703.239069044
    scale_params: 256.829620694
    scale_params: 29069989141.4
    scale_params: 501.198226865
    scale_params: 361.279419377
    scale_params: 18984567.4368
    scale_params: 458.441862219
    scale_params: 394568603.459
    scale_params: 14155164717.5
    scale_params: 282.771761661
    scale_params: 778.184328
    scale_params: 319.922480106
    scale_params: 621.823248727
    scale_params: 296.624995206
    scale_params: 636.895905407
    scale_params: 318.951006882
    scale_params: 1031.75233128
    scale_params: 224119679.986
    scale_params: 633.071735187
    scale_params: 295.210929214
    scale_params: 514.005332182
    scale_params: 329.993031712
    scale_params: 1222.130745
    scale_params: 419.069612411
    scale_params: 3.9334193301e+12
    scale_params: 194.18084692
    scale_params: 212.514747124
    scale_params: 308.541117248
  }
}
layer {
  name: "resx1_conv3_bn"
  type: "BatchNorm"
  bottom: "resx1_conv3"
  top: "resx1_conv3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "resx1_conv3_scale"
  type: "Scale"
  bottom: "resx1_conv3"
  top: "resx1_conv3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "resx1_match_conv"
  type: "Convolution"
  bottom: "pool1"
  top: "resx1_match_conv"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 45.3980140196
    scale_out: 65.2365792909
    scale_params: 621.982349877
    scale_params: 156945.787406
    scale_params: 313.028247456
    scale_params: 2074.97632871
    scale_params: 50290.8871987
    scale_params: 3.51030890861e+13
    scale_params: 544.52743074
    scale_params: 235.275575583
    scale_params: 368.607227323
    scale_params: 183.530192378
    scale_params: 420.847280125
    scale_params: 925.931135301
    scale_params: 1013.73400707
    scale_params: 1282.64652395
    scale_params: 5.73951778594e+11
    scale_params: 584.747214503
    scale_params: 1765.57658669
    scale_params: 371.725829171
    scale_params: 207.865645855
    scale_params: 1.94439064758e+12
    scale_params: 223.697340627
    scale_params: 299.224203453
    scale_params: 606.688424848
    scale_params: 17212.8256461
    scale_params: 408.507214616
    scale_params: 367.668850206
    scale_params: 302.104920991
    scale_params: 2206504.66153
    scale_params: 1528.72754067
    scale_params: 575.318146235
    scale_params: 1238.07109838
    scale_params: 586.221210692
    scale_params: 2286.46822115
    scale_params: 366.056828403
    scale_params: 2878171986.54
    scale_params: 488.325427682
    scale_params: 8260.1543679
    scale_params: 2.24661744141e+14
    scale_params: 10813.4547071
    scale_params: 219.399258697
    scale_params: 1437.81398679
    scale_params: 1.10008907702e+14
    scale_params: 1.11535127456e+11
    scale_params: 11444.9024583
    scale_params: 4.71510771073e+12
    scale_params: 1213.46426543
    scale_params: 673.407920508
    scale_params: 759.357626089
    scale_params: 443.017644866
    scale_params: 255201022.679
    scale_params: 1785.52813327
    scale_params: 694.640678332
    scale_params: 2749.94862995
    scale_params: 423.9284646
    scale_params: 2264745885.81
    scale_params: 497.006396777
    scale_params: 401.204991934
    scale_params: 1321.31025373
    scale_params: 6348.7525545
    scale_params: 410.761948294
    scale_params: 20732.3096269
    scale_params: 16231.0109308
    scale_params: 219.774535751
    scale_params: 182.957817304
    scale_params: 948.899839089
    scale_params: 175.625293395
    scale_params: 284920659.093
    scale_params: 303056.84861
    scale_params: 1765.84966455
    scale_params: 454.954705271
    scale_params: 300.092016298
    scale_params: 987.944664231
    scale_params: 6.55690992706e+12
    scale_params: 1144.01205271
    scale_params: 508.006600942
    scale_params: 383.442612499
    scale_params: 171.497973735
    scale_params: 826.62953059
    scale_params: 993.650408848
    scale_params: 684.063548016
    scale_params: 1.16117388512e+13
    scale_params: 272.947803294
    scale_params: 6.40638281097e+12
    scale_params: 352.651207955
    scale_params: 2111.75841565
    scale_params: 421.208721665
    scale_params: 443.489163303
    scale_params: 484.870112002
    scale_params: 670.178779959
    scale_params: 34994.9468027
    scale_params: 417.129168991
    scale_params: 380.3356397
    scale_params: 2251.37923321
    scale_params: 1.85041718848e+11
    scale_params: 2063.44246354
    scale_params: 397.431769227
    scale_params: 295.022513208
    scale_params: 1303.15357657
    scale_params: 2909.3658296
    scale_params: 21853.2364539
    scale_params: 480.041984566
    scale_params: 277.083227906
    scale_params: 788.750385613
    scale_params: 425.416674179
    scale_params: 3773.35279213
    scale_params: 464.732992977
    scale_params: 470.003518785
    scale_params: 13910.4399848
    scale_params: 328.990162441
    scale_params: 3097.85531124
    scale_params: 3993.17156418
    scale_params: 104883730.132
    scale_params: 25787.1213508
    scale_params: 58397417321.2
    scale_params: 2.97201744277e+13
    scale_params: 541.178934952
    scale_params: 8034.64473144
    scale_params: 564.603974713
    scale_params: 345.251654754
    scale_params: 284.995384338
    scale_params: 410.969722635
    scale_params: 5040680.02977
    scale_params: 2221.05882747
    scale_params: 18045861397.8
    scale_params: 94792054683.1
    scale_params: 640.230776853
    scale_params: 1119.24191616
    scale_params: 6.97399156158e+12
    scale_params: 275.915860873
    scale_params: 15906.3065755
    scale_params: 442.623524142
    scale_params: 687.711215741
    scale_params: 43547388.0514
    scale_params: 244.592810735
    scale_params: 624.685935749
    scale_params: 1432.87499528
    scale_params: 1642.86346529
    scale_params: 1142.50439564
    scale_params: 1006.33161519
    scale_params: 91398.40662
    scale_params: 8350.12172596
    scale_params: 184.235741488
    scale_params: 321.800985412
    scale_params: 273.706974748
    scale_params: 656.600011093
    scale_params: 927.82133212
    scale_params: 518.971195017
    scale_params: 1086135576.84
    scale_params: 352.128170499
    scale_params: 220.548494283
    scale_params: 492.688984629
    scale_params: 1834.6340985
    scale_params: 602.208760645
    scale_params: 14342886896.7
    scale_params: 6.23394557803e+12
    scale_params: 4403.77877469
    scale_params: 778.230799321
    scale_params: 1676.81635023
    scale_params: 4.70203827557e+14
    scale_params: 204.903378929
    scale_params: 17948.473115
    scale_params: 3037.97889109
    scale_params: 10315.9093708
    scale_params: 1332.2968824
    scale_params: 453.609954736
    scale_params: 28239.4733543
    scale_params: 533.43955993
    scale_params: 12225687029.8
    scale_params: 460.699906713
    scale_params: 1418.25021121
    scale_params: 281.409209385
    scale_params: 9255.19761342
    scale_params: 11586.4209929
    scale_params: 547.636637621
    scale_params: 261.774060562
    scale_params: 375.314044184
    scale_params: 3572.41988843
    scale_params: 365.223127826
    scale_params: 347.094137048
    scale_params: 172.996532691
    scale_params: 10149088371.1
    scale_params: 366.109945713
    scale_params: 147.470918549
    scale_params: 279.290762211
    scale_params: 6595.48935531
    scale_params: 193.36476287
    scale_params: 194.635258627
    scale_params: 18919.6433081
    scale_params: 10847.5947832
    scale_params: 3.09875614843e+13
    scale_params: 299.784596968
    scale_params: 378608.603113
    scale_params: 359.348164938
    scale_params: 1247.06911227
    scale_params: 9675.90721989
    scale_params: 394.468722105
    scale_params: 1.46081410067e+14
    scale_params: 7.67938610895e+14
    scale_params: 324.359831139
    scale_params: 202.72181612
    scale_params: 279.432584781
    scale_params: 2195.83333921
    scale_params: 2519.43902477
    scale_params: 1564.05412072
    scale_params: 3890.13630955
    scale_params: 1786.57201701
    scale_params: 621.40695799
    scale_params: 752.775245581
    scale_params: 1050.5989329
    scale_params: 20518.4906347
    scale_params: 5319982531.62
    scale_params: 590.231849445
    scale_params: 1014.43299118
    scale_params: 35593.4092974
    scale_params: 473.795811233
    scale_params: 263.072131946
    scale_params: 515.795991402
    scale_params: 1045.76332382
    scale_params: 1707.31118491
    scale_params: 5519.99702588
    scale_params: 1502.73465709
    scale_params: 1797449795.47
    scale_params: 1533.46261391
    scale_params: 78014156.0411
    scale_params: 591852.783106
    scale_params: 970015.666687
    scale_params: 333.664632118
    scale_params: 1243.15481132
    scale_params: 748.678561729
    scale_params: 1666.43706554
    scale_params: 27969158498.3
    scale_params: 535.204916023
    scale_params: 371.648055743
    scale_params: 14343136.3367
    scale_params: 1707.37616973
    scale_params: 205296433.976
    scale_params: 33571447427.3
    scale_params: 445.499765928
    scale_params: 209.492428721
    scale_params: 358.595758933
    scale_params: 984.313913287
    scale_params: 531.5952436
    scale_params: 1296.99932136
    scale_params: 1032.88843504
    scale_params: 3373.23802663
    scale_params: 213342444.358
    scale_params: 405.633781022
    scale_params: 380.758049156
    scale_params: 28485.5675433
    scale_params: 435.9978015
    scale_params: 834.192523985
    scale_params: 149.384461875
    scale_params: 1.42802674081e+12
    scale_params: 315.764414405
    scale_params: 4314.35976563
    scale_params: 531.78258177
  }
}
layer {
  name: "resx1_match_conv_bn"
  type: "BatchNorm"
  bottom: "resx1_match_conv"
  top: "resx1_match_conv"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "resx1_match_conv_scale"
  type: "Scale"
  bottom: "resx1_match_conv"
  top: "resx1_match_conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "resx1_elewise"
  type: "Eltwise"
  bottom: "resx1_match_conv"
  bottom: "resx1_conv3"
  top: "resx1_elewise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "resx1_elewise_relu"
  type: "ReLU"
  bottom: "resx1_elewise"
  top: "resx1_elewise"
}
layer {
  name: "resx2_conv1"
  type: "Convolution"
  bottom: "resx1_elewise"
  top: "resx2_conv1"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 65.2365792909
    scale_out: 152.897674615
    scale_params: 1337.81746981
    scale_params: 1197.88849781
    scale_params: 3.36709163294e+14
    scale_params: 4.90788252555e+13
    scale_params: 895.612860351
    scale_params: 1537.49813794
    scale_params: 1093.88115803
    scale_params: 1122.83388991
    scale_params: 4.64720418285e+11
    scale_params: 923.206129619
    scale_params: 16524463373.4
    scale_params: 467706374.606
    scale_params: 942.088788072
    scale_params: 1230.25240365
    scale_params: 1232.84107084
    scale_params: 2.96988132511e+15
    scale_params: 1112.6307752
    scale_params: 501.244151179
    scale_params: 1330.46385527
    scale_params: 1010.56145799
    scale_params: 817.844059102
    scale_params: 849.88106388
    scale_params: 981.639264902
    scale_params: 998.053238556
    scale_params: 1422.02119477
    scale_params: 1568.36950606
    scale_params: 289.797561502
    scale_params: 1185.16379429
    scale_params: 786.152233104
    scale_params: 651.168373977
    scale_params: 1244.82500533
    scale_params: 17528247190.9
    scale_params: 904.067946397
    scale_params: 845.369395497
    scale_params: 943.468104689
    scale_params: 697.29051142
    scale_params: 956.343665977
    scale_params: 789.769768368
    scale_params: 1498.68231391
    scale_params: 1240.98501658
    scale_params: 1441.81217792
    scale_params: 1402.54364184
    scale_params: 1618.05195281
    scale_params: 837.181081857
    scale_params: 1577.42836311
    scale_params: 888.255406737
    scale_params: 933.416845128
    scale_params: 1362.63537247
    scale_params: 716.547062711
    scale_params: 853.24597283
    scale_params: 5.44639353763e+14
    scale_params: 732.889015737
    scale_params: 1454.61153594
    scale_params: 942.051508935
    scale_params: 1488.3527386
    scale_params: 756.231761779
    scale_params: 971.676219419
    scale_params: 887.398991931
    scale_params: 1173.50247021
    scale_params: 763.118782232
    scale_params: 1520.17980119
    scale_params: 815.454448192
    scale_params: 1715.49594265
    scale_params: 1477.99245017
    scale_params: 1029.56334206
    scale_params: 1175.11351914
    scale_params: 683.081507403
    scale_params: 912.717915781
    scale_params: 583.707490752
    scale_params: 895.217847413
    scale_params: 743.901677631
    scale_params: 564.012583105
    scale_params: 437.970969892
    scale_params: 418.329279927
    scale_params: 769.2292034
    scale_params: 529.114904092
    scale_params: 1459.19082644
    scale_params: 1154.04683646
    scale_params: 1134.5587468
    scale_params: 775.632971311
    scale_params: 842.441258265
    scale_params: 860.876444078
    scale_params: 1430.01895288
    scale_params: 1312.4567486
    scale_params: 633.195668447
    scale_params: 1334.75164671
    scale_params: 963.410205916
    scale_params: 992.039165569
    scale_params: 7.24062797603e+14
    scale_params: 1144.52425036
    scale_params: 834.706737326
    scale_params: 511.45585697
    scale_params: 645.466125211
    scale_params: 785.236272962
    scale_params: 893.285821252
    scale_params: 764.512967387
    scale_params: 717.43705066
    scale_params: 874.101456302
    scale_params: 878.532146963
    scale_params: 679.23799845
    scale_params: 944.102696724
    scale_params: 940.393701012
    scale_params: 846.467594367
    scale_params: 1566.24158066
    scale_params: 934.623870407
    scale_params: 631.170112303
    scale_params: 803.289920544
    scale_params: 1430.44485059
    scale_params: 962.042806194
    scale_params: 845.130738441
    scale_params: 687.93947365
    scale_params: 953.061592992
    scale_params: 1032.89425579
    scale_params: 903.755899689
    scale_params: 897.521989159
    scale_params: 788.150673669
    scale_params: 752.061503177
    scale_params: 968.073341094
    scale_params: 899.676543468
    scale_params: 1190.02540993
    scale_params: 652.255906278
    scale_params: 825.667750821
    scale_params: 1201.9089248
    scale_params: 849.312103719
    scale_params: 453.107816879
    scale_params: 638.16562515
    scale_params: 433.464451577
    scale_params: 721.617001081
  }
}
layer {
  name: "resx2_conv1_bn"
  type: "BatchNorm"
  bottom: "resx2_conv1"
  top: "resx2_conv1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "resx2_conv1_scale"
  type: "Scale"
  bottom: "resx2_conv1"
  top: "resx2_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "resx2_conv1_relu"
  type: "ReLU"
  bottom: "resx2_conv1"
  top: "resx2_conv1"
}
layer {
  name: "resx2_conv2"
  type: "Convolution"
  bottom: "resx2_conv1"
  top: "resx2_conv2"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 32
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 152.897674615
    scale_out: 93.1879636648
    scale_params: 105.268977904
    scale_params: 90.0163188995
    scale_params: 3.79753951958e+14
    scale_params: 73.8648477393
    scale_params: 92.6026589101
    scale_params: 106.122219636
    scale_params: 143.30591372
    scale_params: 113.765202615
    scale_params: 3.99154369766e+12
    scale_params: 3003803734.18
    scale_params: 72.3336450681
    scale_params: 435.05424267
    scale_params: 126.617969892
    scale_params: 128.341707032
    scale_params: 132.993957398
    scale_params: 100.295922303
    scale_params: 219.382609963
    scale_params: 109.391972635
    scale_params: 127.825165314
    scale_params: 292.461374372
    scale_params: 160.368357033
    scale_params: 147.265273534
    scale_params: 250.231291136
    scale_params: 110.455165561
    scale_params: 84.6655968164
    scale_params: 81.7508319514
    scale_params: 105.314213822
    scale_params: 84.1969590396
    scale_params: 272.859405028
    scale_params: 160.629921298
    scale_params: 10865665403.0
    scale_params: 106.866961842
    scale_params: 217.409661747
    scale_params: 254.348521361
    scale_params: 167.331169901
    scale_params: 131.454273491
    scale_params: 84.8750480698
    scale_params: 110.521385904
    scale_params: 17255885231.0
    scale_params: 114.318073157
    scale_params: 97.3495895586
    scale_params: 17614878.4462
    scale_params: 81.6371438188
    scale_params: 123.831541723
    scale_params: 97.7416517998
    scale_params: 146.153051079
    scale_params: 137.146759463
    scale_params: 125.56359255
    scale_params: 89.1607156066
    scale_params: 165.143363725
    scale_params: 138.14696713
    scale_params: 46.7348404716
    scale_params: 375.111031615
    scale_params: 85.1629951735
    scale_params: 175.928670292
    scale_params: 105.536168478
    scale_params: 117.123354866
    scale_params: 125.235057152
    scale_params: 157.893193177
    scale_params: 228.254717655
    scale_params: 80.0851986373
    scale_params: 74.9314106235
    scale_params: 71.8820591261
    scale_params: 166.570647881
    scale_params: 148.522042634
    scale_params: 177.098707857
    scale_params: 165.825486305
    scale_params: 101.925584167
    scale_params: 188.983085856
    scale_params: 148.958626791
    scale_params: 141.453903806
    scale_params: 180.426141431
    scale_params: 267.431832764
    scale_params: 130.165978808
    scale_params: 171.434803839
    scale_params: 181.611050769
    scale_params: 219.805505881
    scale_params: 106.792584937
    scale_params: 164.291812591
    scale_params: 158.227209488
    scale_params: 142.235965865
    scale_params: 158.521612575
    scale_params: 183.398633333
    scale_params: 197.108136433
    scale_params: 174.144220435
    scale_params: 137.810078662
    scale_params: 187.697853792
    scale_params: 333.06922229
    scale_params: 113.906702743
    scale_params: 142.749757356
    scale_params: 129.642085124
    scale_params: 128.097453569
    scale_params: 251.846371223
    scale_params: 206.607786356
    scale_params: 164.510144054
    scale_params: 208.10037387
    scale_params: 171.950392054
    scale_params: 173.624325096
    scale_params: 174.420006889
    scale_params: 169.260371824
    scale_params: 99.0955912617
    scale_params: 116.270651634
    scale_params: 152.4739776
    scale_params: 70.2449897311
    scale_params: 110.458933372
    scale_params: 141.989135502
    scale_params: 173.589230803
    scale_params: 208.112549021
    scale_params: 165.478587685
    scale_params: 209.061102134
    scale_params: 222.034833322
    scale_params: 147.664949401
    scale_params: 220.530575069
    scale_params: 142.733644296
    scale_params: 214.222991516
    scale_params: 111.823065344
    scale_params: 185.650977738
    scale_params: 138.20896793
    scale_params: 140.478512397
    scale_params: 200.937475787
    scale_params: 167.43415395
    scale_params: 397.86405366
    scale_params: 178.400189762
    scale_params: 325.148279804
    scale_params: 114.84777377
    scale_params: 111.707982051
    scale_params: 142.930069794
    scale_params: 152.776792969
  }
}
layer {
  name: "resx2_conv2_bn"
  type: "BatchNorm"
  bottom: "resx2_conv2"
  top: "resx2_conv2"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "resx2_conv2_scale"
  type: "Scale"
  bottom: "resx2_conv2"
  top: "resx2_conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "resx2_conv2_relu"
  type: "ReLU"
  bottom: "resx2_conv2"
  top: "resx2_conv2"
}
layer {
  name: "resx2_conv3"
  type: "Convolution"
  bottom: "resx2_conv2"
  top: "resx2_conv3"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 93.1879636648
    scale_out: 65.2365792909
    scale_params: 419.443445682
    scale_params: 3448.18442803
    scale_params: 1797.14071617
    scale_params: 174.275062424
    scale_params: 513.313492675
    scale_params: 194.410075461
    scale_params: 607.467255077
    scale_params: 5052.26694394
    scale_params: 599.274677044
    scale_params: 3126.15052082
    scale_params: 27314.2677539
    scale_params: 229.977136411
    scale_params: 159.383469171
    scale_params: 360.022596516
    scale_params: 589.466756348
    scale_params: 325.959593646
    scale_params: 349.09377646
    scale_params: 787.080872068
    scale_params: 51461.5658848
    scale_params: 1108.75126505
    scale_params: 402.927466562
    scale_params: 3737.54009008
    scale_params: 344.502162894
    scale_params: 3510.12465068
    scale_params: 372.085423095
    scale_params: 413.960780215
    scale_params: 11360.4683679
    scale_params: 176.854340592
    scale_params: 221.456445853
    scale_params: 289.638843868
    scale_params: 467.516239871
    scale_params: 800.333411276
    scale_params: 318.327680209
    scale_params: 810.625963655
    scale_params: 288.289475477
    scale_params: 1732.08925635
    scale_params: 464.722045931
    scale_params: 329.187298541
    scale_params: 1200.72049324
    scale_params: 6767.128162
    scale_params: 485.416737794
    scale_params: 223.022999969
    scale_params: 320.489996394
    scale_params: 327.634777896
    scale_params: 567.580843332
    scale_params: 230.456886889
    scale_params: 3850.33606559
    scale_params: 567.123324263
    scale_params: 398.245428681
    scale_params: 372.705265314
    scale_params: 1339.89892431
    scale_params: 448.451714344
    scale_params: 146.956987191
    scale_params: 424.333794171
    scale_params: 342.113436747
    scale_params: 347.522943304
    scale_params: 471.610478853
    scale_params: 297.198443001
    scale_params: 459.023232016
    scale_params: 1023.39750037
    scale_params: 334.177586298
    scale_params: 270.860403073
    scale_params: 417.006916692
    scale_params: 3791.19055204
    scale_params: 321.31679196
    scale_params: 1738.48330253
    scale_params: 337.055149804
    scale_params: 345.621079464
    scale_params: 302.910205528
    scale_params: 1099.33581603
    scale_params: 419.811411913
    scale_params: 566.5619713
    scale_params: 188.62446043
    scale_params: 301.423766698
    scale_params: 796.790050083
    scale_params: 405.573363312
    scale_params: 501.416250597
    scale_params: 275.283041456
    scale_params: 208.132918651
    scale_params: 259.286584007
    scale_params: 167.078743746
    scale_params: 27602.0309363
    scale_params: 386.731069983
    scale_params: 262.053580553
    scale_params: 110.506929599
    scale_params: 168.956116662
    scale_params: 224.855428643
    scale_params: 424.890536129
    scale_params: 322.373850562
    scale_params: 13739.3865782
    scale_params: 1410.40057701
    scale_params: 1414.72011739
    scale_params: 161.576159569
    scale_params: 307.547207928
    scale_params: 673.534737852
    scale_params: 794.899123064
    scale_params: 385.948948819
    scale_params: 370.821374958
    scale_params: 320.580071391
    scale_params: 923.801532202
    scale_params: 478.701784988
    scale_params: 311.493171863
    scale_params: 472.586260705
    scale_params: 178.631626681
    scale_params: 163.571941651
    scale_params: 520.885772543
    scale_params: 366.854641497
    scale_params: 265.398759217
    scale_params: 16160.4506512
    scale_params: 326.38815564
    scale_params: 4707.2630489
    scale_params: 234.516057923
    scale_params: 260.065840997
    scale_params: 301.479551961
    scale_params: 254.090506367
    scale_params: 884.562193271
    scale_params: 225.178847604
    scale_params: 359.761328028
    scale_params: 7242.54094318
    scale_params: 1921.07641264
    scale_params: 823.730826747
    scale_params: 192.202055195
    scale_params: 176.830372407
    scale_params: 419.949633001
    scale_params: 313.488433942
    scale_params: 1016.90275703
    scale_params: 461.055497763
    scale_params: 410.817426651
    scale_params: 480.373266509
    scale_params: 178.718559171
    scale_params: 2259.39792508
    scale_params: 274.622975448
    scale_params: 180.590808416
    scale_params: 437.02818287
    scale_params: 406.726987124
    scale_params: 358.050350059
    scale_params: 308.235726781
    scale_params: 197.116488027
    scale_params: 315.130885633
    scale_params: 951.3119598
    scale_params: 602.893802855
    scale_params: 1717.81032209
    scale_params: 582.194745426
    scale_params: 886.268579914
    scale_params: 232.061715356
    scale_params: 443.217526956
    scale_params: 11759.43033
    scale_params: 338.916943888
    scale_params: 3653.35291487
    scale_params: 505.142909706
    scale_params: 855.691132861
    scale_params: 192.747814756
    scale_params: 3962.33253706
    scale_params: 239.244654346
    scale_params: 591.022291697
    scale_params: 490.697780869
    scale_params: 225.197196982
    scale_params: 3291.48695201
    scale_params: 429.021176854
    scale_params: 116267.923244
    scale_params: 220.170935706
    scale_params: 171.22940299
    scale_params: 471.597274364
    scale_params: 390.83902505
    scale_params: 457.98409624
    scale_params: 914.242035485
    scale_params: 343.474773896
    scale_params: 154.93065349
    scale_params: 2733.68202247
    scale_params: 426.993266064
    scale_params: 1119.86973453
    scale_params: 9508.89054596
    scale_params: 216.259124479
    scale_params: 638.599751912
    scale_params: 733.707451266
    scale_params: 348.459006473
    scale_params: 472.377292348
    scale_params: 5678.45403243
    scale_params: 1121.54397087
    scale_params: 460.683172466
    scale_params: 158.460638562
    scale_params: 449.829202224
    scale_params: 3350.54566519
    scale_params: 945.437052884
    scale_params: 2629.84795848
    scale_params: 1869.93694631
    scale_params: 940.988526063
    scale_params: 295.307816202
    scale_params: 182.37991521
    scale_params: 405.660501815
    scale_params: 601.176457045
    scale_params: 1093.95585413
    scale_params: 245.032033584
    scale_params: 347.808967966
    scale_params: 177.08014791
    scale_params: 3075.52917893
    scale_params: 320.772469925
    scale_params: 201.536945791
    scale_params: 7284.39016601
    scale_params: 318.671802312
    scale_params: 2019.00474226
    scale_params: 343.197875843
    scale_params: 236.15579297
    scale_params: 615.448597618
    scale_params: 377.110075474
    scale_params: 139.688785575
    scale_params: 280.564834945
    scale_params: 236.997060653
    scale_params: 291.855384429
    scale_params: 252.894946069
    scale_params: 317.541681896
    scale_params: 283.35636873
    scale_params: 256.644380578
    scale_params: 209.364411577
    scale_params: 1721.8215859
    scale_params: 2860.15764009
    scale_params: 238.690005274
    scale_params: 342.479970881
    scale_params: 273.729988863
    scale_params: 460.562582403
    scale_params: 320.971916962
    scale_params: 449.77607459
    scale_params: 136.481699324
    scale_params: 385.752777699
    scale_params: 338.340585051
    scale_params: 3251.92787043
    scale_params: 457.141466373
    scale_params: 162.51117424
    scale_params: 314.981368968
    scale_params: 266.903171199
    scale_params: 283.757786619
    scale_params: 241.204357672
    scale_params: 1920.69781327
    scale_params: 192.758521263
    scale_params: 229.496462349
    scale_params: 527.94666781
    scale_params: 1406791.26058
    scale_params: 653.161216098
    scale_params: 441.03800663
    scale_params: 288.148985031
    scale_params: 216.88349848
    scale_params: 415.427534903
    scale_params: 419.953647364
    scale_params: 263.677827678
    scale_params: 246.738993039
    scale_params: 138.041982206
    scale_params: 416.133809261
    scale_params: 8023.74006901
    scale_params: 296.916696842
    scale_params: 465.497925725
    scale_params: 351.637871682
    scale_params: 2405.21513908
    scale_params: 343.303769103
    scale_params: 443.697648047
    scale_params: 177.952529989
    scale_params: 704.273043063
  }
}
layer {
  name: "resx2_conv3_bn"
  type: "BatchNorm"
  bottom: "resx2_conv3"
  top: "resx2_conv3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "resx2_conv3_scale"
  type: "Scale"
  bottom: "resx2_conv3"
  top: "resx2_conv3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "resx2_elewise"
  type: "Eltwise"
  bottom: "resx1_elewise"
  bottom: "resx2_conv3"
  top: "resx2_elewise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "resx2_elewise_relu"
  type: "ReLU"
  bottom: "resx2_elewise"
  top: "resx2_elewise"
}
layer {
  name: "resx3_conv1"
  type: "Convolution"
  bottom: "resx2_elewise"
  top: "resx3_conv1"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 65.2365792909
    scale_out: 168.487511723
    scale_params: 1577.17265212
    scale_params: 834.788739967
    scale_params: 1029.19688614
    scale_params: 1080.33797638
    scale_params: 954.97258983
    scale_params: 885.683191614
    scale_params: 1045.03973366
    scale_params: 1348.65304467
    scale_params: 1033.13671995
    scale_params: 908.464565212
    scale_params: 1280.25699518
    scale_params: 1008.23148323
    scale_params: 904.812743354
    scale_params: 1136.28540639
    scale_params: 1069.97268934
    scale_params: 1185.12119346
    scale_params: 955.000411566
    scale_params: 1899.17873892
    scale_params: 5.84349360835e+14
    scale_params: 978.289936262
    scale_params: 979.929908569
    scale_params: 1288.94877038
    scale_params: 1401.17698116
    scale_params: 1459.96920486
    scale_params: 816.42862009
    scale_params: 1255.20649298
    scale_params: 1492.22483454
    scale_params: 1240.22141206
    scale_params: 977.503621475
    scale_params: 1395.44721379
    scale_params: 1319.20820319
    scale_params: 1352.4750463
    scale_params: 1092.21774497
    scale_params: 847.543954549
    scale_params: 1365.71423572
    scale_params: 1642.79934028
    scale_params: 1140.70123817
    scale_params: 1139.86917089
    scale_params: 762.784256878
    scale_params: 1432.79381729
    scale_params: 729.108075309
    scale_params: 2485.30836563
    scale_params: 3100.5552785
    scale_params: 1356.79455119
    scale_params: 1500.0305764
    scale_params: 937.280924442
    scale_params: 605.881394391
    scale_params: 1216.36604931
    scale_params: 1103.00526588
    scale_params: 587.110442602
    scale_params: 1777.33288637
    scale_params: 1646.54517466
    scale_params: 1162.18295886
    scale_params: 1552.18695248
    scale_params: 1159.10409036
    scale_params: 1529.59232615
    scale_params: 854.55671914
    scale_params: 561.941725259
    scale_params: 862.595767801
    scale_params: 863.383526492
    scale_params: 984.171379343
    scale_params: 869.037529467
