name: "ResNet-50"
layer {
  name: "data"
  type: "DummyData"
  top: "data"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 0.01
    }
    shape {
      dim:11
      dim: 3
      dim: 230
      dim: 230
    }
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "msra"
      variance_norm: FAN_OUT
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 107.655632019
    scale_out: 38.4816322327
    scale_params: 1629.9642334
    scale_params: 250.628387451
    scale_params: 309.605438232
    scale_params: 159.631332397
    scale_params: 822.373535156
    scale_params: 613.281433105
    scale_params: 201.263336182
    scale_params: 448.854248047
    scale_params: 332.769195557
    scale_params: 1569.8951416
    scale_params: 812.354553223
    scale_params: 245.707504272
    scale_params: 1143.53588867
    scale_params: 334.262176514
    scale_params: 799.239746094
    scale_params: 385.446594238
    scale_params: 4434.43701172
    scale_params: 2567.22558594
    scale_params: 495.852264404
    scale_params: 582.763244629
    scale_params: 3469.6652832
    scale_params: 621.870178223
    scale_params: 353.60534668
    scale_params: 1711.31213379
    scale_params: 262.644470215
    scale_params: 1467.74780273
    scale_params: 616.633483887
    scale_params: 1273.78747559
    scale_params: 717.371948242
    scale_params: 1726.48962402
    scale_params: 271.959533691
    scale_params: 479.378295898
    scale_params: 615.289855957
    scale_params: 382.293548584
    scale_params: 325.264801025
    scale_params: 744.046325684
    scale_params: 389.720703125
    scale_params: 400.989044189
    scale_params: 609.853027344
    scale_params: 300.455566406
    scale_params: 637.329467773
    scale_params: 383.469451904
    scale_params: 842.381225586
    scale_params: 2123.33081055
    scale_params: 557.253967285
    scale_params: 256.113555908
    scale_params: 1631.06787109
    scale_params: 714.77923584
    scale_params: 285.793518066
    scale_params: 1812.72521973
    scale_params: 811.889831543
    scale_params: 252.119781494
    scale_params: 1625.48327637
    scale_params: 331.476318359
    scale_params: 264.321716309
    scale_params: 521.991455078
    scale_params: 288.730560303
    scale_params: 2102.26123047
    scale_params: 864.453918457
    scale_params: 2079.20214844
    scale_params: 461.106842041
    scale_params: 2632.11206055
    scale_params: 442.013244629
    scale_params: 532.260803223
    force_u8_input: true
  }
}
layer {
  name: "bn_conv1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale_conv1"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
  relu_param {
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "res2a_branch1"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch1"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 38.4816322327
    scale_out: 37.285900116
    scale_params: 773.957763672
    scale_params: 695.049926758
    scale_params: 1377.22375488
    scale_params: 1556.16333008
    scale_params: 5208466944.0
    scale_params: 495.107940674
    scale_params: 559.404785156
    scale_params: 404.484649658
    scale_params: 438.843383789
    scale_params: 817.581726074
    scale_params: 816.039123535
    scale_params: 745.572814941
    scale_params: 640.115234375
    scale_params: 522.893798828
    scale_params: 3164.97558594
    scale_params: 474.980804443
    scale_params: 415.691864014
    scale_params: 1939.43212891
    scale_params: 304.036987305
    scale_params: 559565.0
    scale_params: 550.829772949
    scale_params: 193.508911133
    scale_params: 449.576629639
    scale_params: 272.014923096
    scale_params: 852.88659668
    scale_params: 487.998016357
    scale_params: 641.307312012
    scale_params: 533.007385254
    scale_params: 4457.34082031
    scale_params: 239.48979187
    scale_params: 3080.92333984
    scale_params: 3945.94580078
    scale_params: 755.652038574
    scale_params: 606.86730957
    scale_params: 2431724032.0
    scale_params: 579.188537598
    scale_params: 356.381652832
    scale_params: 3717.32885742
    scale_params: 5201.46582031
    scale_params: 2698.18847656
    scale_params: 884.858093262
    scale_params: 17275.9511719
    scale_params: 1026.10375977
    scale_params: 351962.21875
    scale_params: 1063.48547363
    scale_params: 365.607391357
    scale_params: 1902.77941895
    scale_params: 2.87017900442e+13
    scale_params: 491.03427124
    scale_params: 11449.0
    scale_params: 54613.5703125
    scale_params: 601.636047363
    scale_params: 1870.48828125
    scale_params: 1024.10070801
    scale_params: 327.146270752
    scale_params: 301.294555664
    scale_params: 3092085504.0
    scale_params: 3764.32055664
    scale_params: 478.540405273
    scale_params: 1.80934918144e+11
    scale_params: 2352.52563477
    scale_params: 285.635437012
    scale_params: 2.12422361088e+12
    scale_params: 777.220825195
    scale_params: 708.881774902
    scale_params: 5860.97363281
    scale_params: 325.75479126
    scale_params: 289.194000244
    scale_params: 436.807250977
    scale_params: 685.110168457
    scale_params: 42820976640.0
    scale_params: 417.430908203
    scale_params: 1599334.0
    scale_params: 912.508300781
    scale_params: 355.422393799
    scale_params: 715.258789062
    scale_params: 1383.89624023
    scale_params: 442.43270874
    scale_params: 877.369934082
    scale_params: 480.106140137
    scale_params: 123.601371765
    scale_params: 7839.05810547
    scale_params: 585.917602539
    scale_params: 875.603942871
    scale_params: 18109.7636719
    scale_params: 23518524.0
    scale_params: 575.172363281
    scale_params: 634.597900391
    scale_params: 1056.73571777
    scale_params: 838.843139648
    scale_params: 10036400128.0
    scale_params: 396.785217285
    scale_params: 326.028289795
    scale_params: 8353.74511719
    scale_params: 2444.0402832
    scale_params: 256.143005371
    scale_params: 324.084197998
    scale_params: 7684.96923828
    scale_params: 414.3387146
    scale_params: 1342.94616699
    scale_params: 682.350402832
    scale_params: 617.174926758
    scale_params: 223.994903564
    scale_params: 48051322880.0
    scale_params: 496.044006348
    scale_params: 2031771.125
    scale_params: 484.430603027
    scale_params: 2656.26953125
    scale_params: 64903991296.0
    scale_params: 635.238098145
    scale_params: 500992608.0
    scale_params: 925.184753418
    scale_params: 570.818725586
    scale_params: 489.999389648
    scale_params: 1619.33337402
    scale_params: 436.46887207
    scale_params: 619.630493164
    scale_params: 597.847412109
    scale_params: 13639165952.0
    scale_params: 669.107177734
    scale_params: 1206.89135742
    scale_params: 586.877441406
    scale_params: 5.99801724928e+11
    scale_params: 314.406890869
    scale_params: 311.79586792
    scale_params: 525.956726074
    scale_params: 175.790725708
    scale_params: 1323.75915527
    scale_params: 947.232177734
    scale_params: 203.337600708
    scale_params: 563.960266113
    scale_params: 440.351776123
    scale_params: 50946592768.0
    scale_params: 227.320861816
    scale_params: 2056.94189453
    scale_params: 495.339538574
    scale_params: 976.59197998
    scale_params: 379.594085693
    scale_params: 464.389709473
    scale_params: 262.304351807
    scale_params: 194.893539429
    scale_params: 15582876.0
    scale_params: 402.290161133
    scale_params: 2042123.125
    scale_params: 537.785461426
    scale_params: 374.864135742
    scale_params: 377.201660156
    scale_params: 470.011749268
    scale_params: 374.468170166
    scale_params: 482.641906738
    scale_params: 2497.71411133
    scale_params: 392.491271973
    scale_params: 507.811676025
    scale_params: 602.52166748
    scale_params: 526.155456543
    scale_params: 442.457397461
    scale_params: 280.08782959
    scale_params: 386.962677002
    scale_params: 676.789306641
    scale_params: 1341.32336426
    scale_params: 214.924346924
    scale_params: 222.73197937
    scale_params: 234.863922119
    scale_params: 2779.78393555
    scale_params: 494.785949707
    scale_params: 126319.789062
    scale_params: 498.61706543
    scale_params: 1550.81884766
    scale_params: 134.004959106
    scale_params: 1462.73913574
    scale_params: 731.641357422
    scale_params: 459.307281494
    scale_params: 8283774976.0
    scale_params: 347.309967041
    scale_params: 2335.14575195
    scale_params: 328.336334229
    scale_params: 393.850616455
    scale_params: 67598.1328125
    scale_params: 262.222747803
    scale_params: 626.211730957
    scale_params: 1517.90258789
    scale_params: 1020.29016113
    scale_params: 639.189147949
    scale_params: 629.040405273
    scale_params: 429.938537598
    scale_params: 89645152.0
    scale_params: 620.079101562
    scale_params: 5946.83837891
    scale_params: 200.616195679
    scale_params: 1367.46069336
    scale_params: 2040.23803711
    scale_params: 545.996765137
    scale_params: 2192.38745117
    scale_params: 1363.01672363
    scale_params: 2731.89306641
    scale_params: 2112.42895508
    scale_params: 326.227661133
    scale_params: 2.64465432576e+11
    scale_params: 302.057281494
    scale_params: 4241846.0
    scale_params: 2.13247537971e+12
    scale_params: 98.537361145
    scale_params: 12641513472.0
    scale_params: 450.956726074
    scale_params: 715.830932617
    scale_params: 1074.34326172
    scale_params: 1072.58117676
    scale_params: 2091.08422852
    scale_params: 435.13772583
    scale_params: 3441.49682617
    scale_params: 1348.5234375
    scale_params: 1342.68518066
    scale_params: 586.175964355
    scale_params: 705.290649414
    scale_params: 149440656.0
    scale_params: 1782.10339355
    scale_params: 6.35749269504e+12
    scale_params: 997.026123047
    scale_params: 137.659408569
    scale_params: 195.264328003
    scale_params: 5754679808.0
    scale_params: 659.301635742
    scale_params: 923.513549805
    scale_params: 1.31702710272e+11
    scale_params: 402.19708252
    scale_params: 603.754699707
    scale_params: 1.68410873856e+12
    scale_params: 211102992.0
    scale_params: 1195.46374512
    scale_params: 350.668548584
    scale_params: 266.893615723
    scale_params: 356.680755615
    scale_params: 2334.97705078
    scale_params: 1.52751610266e+12
    scale_params: 628.441650391
    scale_params: 522.665893555
    scale_params: 670.915405273
    scale_params: 163.279388428
    scale_params: 49709.7695312
    scale_params: 217503936.0
    scale_params: 358.474761963
    scale_params: 307.128356934
    scale_params: 480.146209717
    scale_params: 4.43788230656e+11
    scale_params: 558.945800781
    scale_params: 327.086395264
    scale_params: 2672.94335938
    scale_params: 514.209716797
    scale_params: 2974110.0
    scale_params: 636.217651367
    scale_params: 140.07699585
    scale_params: 173.161636353
    scale_params: 528.312927246
    scale_params: 242.436981201
    scale_params: 787.270690918
    scale_params: 1080.67443848
  }
}
layer {
  name: "bn2a_branch1"
  type: "BatchNorm"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2a_branch1"
  type: "Scale"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 38.4816322327
    scale_out: 136.047943115
    scale_params: 462.316223145
    scale_params: 352.847045898
    scale_params: 723.54510498
    scale_params: 254.965087891
    scale_params: 1058.79956055
    scale_params: 328.375671387
    scale_params: 476.037750244
    scale_params: 1137.71813965
    scale_params: 740.713928223
    scale_params: 157.433547974
    scale_params: 1075.55297852
    scale_params: 332.713775635
    scale_params: 407.229888916
    scale_params: 528.931884766
    scale_params: 273.985473633
    scale_params: 733.477661133
    scale_params: 979.10723877
    scale_params: 256.453094482
    scale_params: 828.48046875
    scale_params: 799.083679199
    scale_params: 994.357788086
    scale_params: 276.441040039
    scale_params: 221.978271484
    scale_params: 416.462005615
    scale_params: 355.230682373
    scale_params: 293.372558594
    scale_params: 327.288269043
    scale_params: 555.778198242
    scale_params: 581.879089355
    scale_params: 177.170623779
    scale_params: 722.100158691
    scale_params: 302.493713379
    scale_params: 787.562988281
    scale_params: 364.681854248
    scale_params: 215.924041748
    scale_params: 549.267211914
    scale_params: 269.182983398
    scale_params: 866.955383301
    scale_params: 940.327270508
    scale_params: 151.17199707
    scale_params: 520.878967285
    scale_params: 451.86706543
    scale_params: 254.441314697
    scale_params: 277.244445801
    scale_params: 396.039154053
    scale_params: 314.682495117
    scale_params: 569.610900879
    scale_params: 490.345184326
    scale_params: 849.13659668
    scale_params: 340.883453369
    scale_params: 229.821548462
    scale_params: 242.399673462
    scale_params: 267.480316162
    scale_params: 391.646270752
    scale_params: 390.361572266
    scale_params: 352.891357422
    scale_params: 327.551940918
    scale_params: 247.204544067
    scale_params: 478.155578613
    scale_params: 1903.34985352
    scale_params: 509.607849121
    scale_params: 408.280090332
    scale_params: 874.679321289
    scale_params: 292.167327881
  }
}
layer {
  name: "bn2a_branch2a"
  type: "BatchNorm"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2a_branch2a"
  type: "Scale"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a_relu"
  type: "ReLU"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  relu_param {
  }
}
layer {
  name: "res2a_branch2b"
  type: "Convolution"
  bottom: "res2a_branch2a"
  top: "res2a_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 136.047943115
    scale_out: 125.906013489
    scale_params: 945.780944824
    scale_params: 1101.30090332
    scale_params: 543.517211914
    scale_params: 971.273376465
    scale_params: 550.995849609
    scale_params: 544.627075195
    scale_params: 981.879272461
    scale_params: 994.279052734
    scale_params: 985.920349121
    scale_params: 736.79486084
    scale_params: 1313.80871582
    scale_params: 644.910461426
    scale_params: 394.95690918
    scale_params: 946.775085449
    scale_params: 1349.71325684
    scale_params: 735.996337891
    scale_params: 1011.2588501
    scale_params: 444.171508789
    scale_params: 1274.5012207
    scale_params: 379.469116211
    scale_params: 1046.33862305
    scale_params: 232.642944336
    scale_params: 496.988189697
    scale_params: 420.458648682
    scale_params: 264.443481445
    scale_params: 939.827209473
    scale_params: 886.015319824
    scale_params: 600.626403809
    scale_params: 945.965209961
    scale_params: 730.30682373
    scale_params: 814.338806152
    scale_params: 1022.73596191
    scale_params: 1144.97473145
    scale_params: 530.064331055
    scale_params: 369.020874023
    scale_params: 833.144592285
    scale_params: 403.612335205
    scale_params: 792.657836914
    scale_params: 224.651443481
    scale_params: 762.803466797
    scale_params: 701.919189453
    scale_params: 629.930419922
    scale_params: 639.403869629
    scale_params: 850.904052734
    scale_params: 476.754272461
    scale_params: 1215.90942383
    scale_params: 755.985778809
    scale_params: 603.755737305
    scale_params: 1071.55078125
    scale_params: 305.240600586
    scale_params: 765.148010254
    scale_params: 297.785522461
    scale_params: 293.25112915
    scale_params: 623.313354492
    scale_params: 423.611816406
    scale_params: 235.572814941
    scale_params: 460.768249512
    scale_params: 218.141845703
    scale_params: 718.695617676
    scale_params: 602.587890625
    scale_params: 794.289001465
    scale_params: 719.665466309
    scale_params: 455.752716064
    scale_params: 1008.07312012
  }
}
layer {
  name: "bn2a_branch2b"
  type: "BatchNorm"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2a_branch2b"
  type: "Scale"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2b_relu"
  type: "ReLU"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  relu_param {
  }
}
layer {
  name: "res2a_branch2c"
  type: "Convolution"
  bottom: "res2a_branch2b"
  top: "res2a_branch2c"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 125.906013489
    scale_out: 74.8653945923
    scale_params: 549.36517334
    scale_params: 313.97354126
    scale_params: 1225.70556641
    scale_params: 322.695892334
    scale_params: 2643231232.0
    scale_params: 441.079284668
    scale_params: 863.01361084
    scale_params: 392.596374512
    scale_params: 392.029907227
    scale_params: 677.367919922
    scale_params: 1984.00830078
    scale_params: 670.477294922
    scale_params: 935.109436035
    scale_params: 767.752685547
    scale_params: 572.380126953
    scale_params: 615.431152344
    scale_params: 312.405059814
    scale_params: 760.270263672
    scale_params: 520.158325195
    scale_params: 46979.2617188
    scale_params: 245.089355469
    scale_params: 225.722473145
    scale_params: 657.544921875
    scale_params: 1293.30432129
    scale_params: 593.990600586
    scale_params: 739.212463379
    scale_params: 314.994049072
    scale_params: 818.153625488
    scale_params: 8497.76464844
    scale_params: 660.064941406
    scale_params: 220.284225464
    scale_params: 144.214447021
    scale_params: 298.0965271
    scale_params: 259.685546875
    scale_params: 5383244800.0
    scale_params: 604.16583252
    scale_params: 10700.9394531
    scale_params: 152.235809326
    scale_params: 1103.99755859
    scale_params: 1029.17443848
    scale_params: 348.164916992
    scale_params: 537.618347168
    scale_params: 559.938598633
    scale_params: 316880.90625
    scale_params: 382.703704834
    scale_params: 544.703430176
    scale_params: 265.395385742
    scale_params: 3.67789159219e+12
    scale_params: 209.302612305
    scale_params: 249.919525146
    scale_params: 64942.8359375
    scale_params: 443.854187012
    scale_params: 477.121856689
    scale_params: 1934.03100586
    scale_params: 248.044952393
    scale_params: 253.759017944
    scale_params: 12655089664.0
    scale_params: 335.803192139
    scale_params: 1065.95275879
    scale_params: 8.24493604864e+11
    scale_params: 3508.77416992
    scale_params: 571.712036133
    scale_params: 3.56181245952e+11
    scale_params: 1534.69165039
    scale_params: 649.984741211
    scale_params: 132.406509399
    scale_params: 1023.16253662
    scale_params: 289.998352051
    scale_params: 460.636901855
    scale_params: 531.356140137
    scale_params: 2867405824.0
    scale_params: 522.992248535
    scale_params: 96004.9375
    scale_params: 269.783325195
    scale_params: 298.726654053
    scale_params: 416.801605225
    scale_params: 134.495788574
    scale_params: 531.590332031
    scale_params: 394.679199219
    scale_params: 676.617553711
    scale_params: 168.595108032
    scale_params: 169.478103638
    scale_params: 292.661315918
    scale_params: 599.737548828
    scale_params: 409.114105225
    scale_params: 97568304.0
    scale_params: 324.665588379
    scale_params: 709.254821777
    scale_params: 1300.76171875
    scale_params: 131.676116943
    scale_params: 13079069696.0
    scale_params: 1155.94006348
    scale_params: 558.089355469
    scale_params: 163.755340576
    scale_params: 274.22052002
    scale_params: 1395.515625
    scale_params: 1218.82885742
    scale_params: 681.362304688
    scale_params: 268.474304199
    scale_params: 966.069946289
    scale_params: 588.221679688
    scale_params: 848.565795898
    scale_params: 1888.63110352
    scale_params: 9592606720.0
    scale_params: 359.402282715
    scale_params: 418248.96875
    scale_params: 790.485473633
    scale_params: 186.059509277
    scale_params: 55395344384.0
    scale_params: 344.785339355
    scale_params: 211068208.0
    scale_params: 699.86340332
    scale_params: 589.724304199
    scale_params: 804.360595703
    scale_params: 553.209960938
    scale_params: 571.352355957
    scale_params: 364.151947021
    scale_params: 484.190704346
    scale_params: 6018668544.0
    scale_params: 439.556427002
    scale_params: 1219.34729004
    scale_params: 457.667633057
    scale_params: 50098950144.0
    scale_params: 486.487365723
    scale_params: 257.349395752
    scale_params: 625.462280273
    scale_params: 878.391906738
    scale_params: 462.436126709
    scale_params: 370.626586914
    scale_params: 641.165466309
    scale_params: 249.569885254
    scale_params: 244.47505188
    scale_params: 35165032448.0
    scale_params: 1250.10302734
    scale_params: 336.516723633
    scale_params: 703.600708008
    scale_params: 326.106689453
    scale_params: 266.201385498
    scale_params: 506.528717041
    scale_params: 2007.64416504
    scale_params: 1652.76928711
    scale_params: 6371438.0
    scale_params: 1001.10443115
    scale_params: 214619.015625
    scale_params: 313.165313721
    scale_params: 625.195068359
    scale_params: 244.687637329
    scale_params: 174.13508606
    scale_params: 3047.85571289
    scale_params: 634.769897461
    scale_params: 622.278625488
    scale_params: 408.731842041
    scale_params: 224.048431396
    scale_params: 1531.03430176
    scale_params: 369.454986572
    scale_params: 211.724349976
    scale_params: 925.88848877
    scale_params: 474.490966797
    scale_params: 1376.89562988
    scale_params: 222.86831665
    scale_params: 6457.46484375
    scale_params: 201.738372803
    scale_params: 1030.91796875
    scale_params: 288.7550354
    scale_params: 910.338195801
    scale_params: 71435.2265625
    scale_params: 240.887512207
    scale_params: 252.408203125
    scale_params: 4283.72509766
    scale_params: 4300.9296875
    scale_params: 840.023132324
    scale_params: 133.211853027
    scale_params: 1027560192.0
    scale_params: 296.829620361
    scale_params: 98.1348953247
    scale_params: 272.484161377
    scale_params: 269.027801514
    scale_params: 32817.6484375
    scale_params: 719.765808105
    scale_params: 307.927368164
    scale_params: 306.387237549
    scale_params: 727.573913574
    scale_params: 328.536224365
    scale_params: 340.297393799
    scale_params: 2085.01220703
    scale_params: 25384434.0
    scale_params: 3586.05517578
    scale_params: 355.289642334
    scale_params: 731.166015625
    scale_params: 294.299102783
    scale_params: 325.310028076
    scale_params: 365.511322021
    scale_params: 536.180419922
    scale_params: 738.59173584
    scale_params: 850.344665527
    scale_params: 440.792114258
    scale_params: 568.663269043
    scale_params: 2.17658261504e+11
    scale_params: 480.842895508
    scale_params: 746730.125
    scale_params: 2.77855312282e+12
    scale_params: 518.133911133
    scale_params: 1.6380329984e+11
    scale_params: 2131.64697266
    scale_params: 731.994873047
    scale_params: 555.56060791
    scale_params: 389.182067871
    scale_params: 201.910263062
    scale_params: 339.600494385
    scale_params: 384.038909912
    scale_params: 566.247802734
    scale_params: 560.619750977
    scale_params: 219.144363403
    scale_params: 918.378845215
    scale_params: 50167716.0
    scale_params: 837.984130859
    scale_params: 1.51074124595e+12
    scale_params: 15890.6621094
    scale_params: 112.002067566
    scale_params: 956.979064941
    scale_params: 4479474176.0
    scale_params: 351.472747803
    scale_params: 580.905700684
    scale_params: 43565379584.0
    scale_params: 489.692504883
    scale_params: 405.22052002
    scale_params: 4.3664064512e+11
    scale_params: 60120440.0
    scale_params: 434.980926514
    scale_params: 345.684051514
    scale_params: 217.65133667
    scale_params: 377.039672852
    scale_params: 368.318786621
    scale_params: 5.12833775206e+12
    scale_params: 281.921600342
    scale_params: 954.36517334
    scale_params: 373.934692383
    scale_params: 1258.60546875
    scale_params: 27688.4160156
    scale_params: 254289152.0
    scale_params: 206.882156372
    scale_params: 880.702575684
    scale_params: 833.925964355
    scale_params: 1.05483952128e+11
    scale_params: 466.008850098
    scale_params: 362.253082275
    scale_params: 340.56640625
    scale_params: 341.999023438
    scale_params: 1627504.125
    scale_params: 199.507247925
    scale_params: 2181.01269531
    scale_params: 2101.34179688
    scale_params: 327.660125732
    scale_params: 199.805145264
    scale_params: 1509.23803711
    scale_params: 359.620117188
  }
}
layer {
  name: "bn2a_branch2c"
  type: "BatchNorm"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2a_branch2c"
  type: "Scale"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a"
  type: "Eltwise"
  bottom: "res2a_branch1"
  bottom: "res2a_branch2c"
  top: "res2a"
  eltwise_param {
  }
}
layer {
  name: "res2a_relu"
  type: "ReLU"
  bottom: "res2a"
  top: "res2a"
  relu_param {
  }
}
layer {
  name: "res2b_branch2a"
  type: "Convolution"
  bottom: "res2a"
  top: "res2b_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 74.8653945923
    scale_out: 94.0252914429
    scale_params: 730.936767578
    scale_params: 934.968444824
    scale_params: 462.308227539
    scale_params: 1016.67871094
    scale_params: 507.579711914
    scale_params: 867.568237305
    scale_params: 1005.38085938
    scale_params: 451.979553223
    scale_params: 1099.09606934
    scale_params: 559.334594727
    scale_params: 548.756469727
    scale_params: 762.865661621
    scale_params: 750.567871094
    scale_params: 742.180053711
    scale_params: 500.749755859
    scale_params: 469.609527588
    scale_params: 573.877746582
    scale_params: 454.667449951
    scale_params: 948.232543945
    scale_params: 452.671875
    scale_params: 622.560058594
    scale_params: 819.140869141
    scale_params: 723.57635498
    scale_params: 805.415527344
    scale_params: 708.878723145
    scale_params: 1020.45800781
    scale_params: 541.604309082
    scale_params: 925.897033691
    scale_params: 573.255249023
    scale_params: 227.67755127
    scale_params: 541.915527344
    scale_params: 548.946838379
    scale_params: 516.863769531
    scale_params: 541.205078125
    scale_params: 1031.38366699
    scale_params: 550.655090332
    scale_params: 465.321350098
    scale_params: 632.511108398
    scale_params: 648.05279541
    scale_params: 982.505615234
    scale_params: 533.840332031
    scale_params: 337.379974365
    scale_params: 507.485290527
    scale_params: 1024.50109863
    scale_params: 794.882568359
    scale_params: 503.602081299
    scale_params: 782.281433105
    scale_params: 635.346740723
    scale_params: 644.49017334
    scale_params: 725.52923584
    scale_params: 955.122619629
    scale_params: 496.095062256
    scale_params: 834.378967285
    scale_params: 822.542785645
    scale_params: 739.337890625
    scale_params: 625.404541016
    scale_params: 676.874816895
    scale_params: 565.138916016
    scale_params: 754.101928711
    scale_params: 1088.36022949
    scale_params: 379.961273193
    scale_params: 708.474243164
    scale_params: 1063.3067627
    scale_params: 447.292785645
  }
}
layer {
  name: "bn2b_branch2a"
  type: "BatchNorm"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2b_branch2a"
  type: "Scale"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2a_relu"
  type: "ReLU"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  relu_param {
  }
}
layer {
  name: "res2b_branch2b"
  type: "Convolution"
  bottom: "res2b_branch2a"
  top: "res2b_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 94.0252914429
    scale_out: 80.5582504272
    scale_params: 675.442077637
    scale_params: 1014.05993652
    scale_params: 1083.28344727
    scale_params: 1238.6550293
    scale_params: 863.931640625
    scale_params: 744.367370605
    scale_params: 414.957183838
    scale_params: 874.169616699
    scale_params: 586.293395996
    scale_params: 809.118041992
    scale_params: 748.554504395
    scale_params: 1065.87072754
    scale_params: 880.333068848
    scale_params: 858.331665039
    scale_params: 985.216247559
    scale_params: 786.453491211
    scale_params: 614.289794922
    scale_params: 478.653930664
    scale_params: 284.185119629
    scale_params: 676.030029297
    scale_params: 638.954528809
    scale_params: 665.743041992
    scale_params: 1259.0760498
    scale_params: 729.082885742
    scale_params: 1018.03198242
    scale_params: 810.02734375
    scale_params: 407.506652832
    scale_params: 550.261230469
    scale_params: 498.676818848
    scale_params: 528.151000977
    scale_params: 811.950683594
    scale_params: 868.669250488
    scale_params: 872.568237305
    scale_params: 1014.33227539
    scale_params: 628.296325684
    scale_params: 664.74029541
    scale_params: 886.142700195
    scale_params: 759.519470215
    scale_params: 697.69708252
    scale_params: 1057.11218262
    scale_params: 1118.95068359
    scale_params: 775.051391602
    scale_params: 774.775878906
    scale_params: 634.532775879
    scale_params: 1003.82452393
    scale_params: 786.536621094
    scale_params: 1253.1003418
    scale_params: 1086.68530273
    scale_params: 881.267578125
    scale_params: 859.209289551
    scale_params: 977.216918945
    scale_params: 582.512817383
    scale_params: 749.032287598
    scale_params: 444.558654785
    scale_params: 572.259521484
    scale_params: 946.310424805
    scale_params: 1618.8338623
    scale_params: 687.787475586
    scale_params: 987.534729004
    scale_params: 1071.44458008
    scale_params: 822.332092285
    scale_params: 948.167663574
    scale_params: 729.274353027
    scale_params: 414.561248779
  }
}
layer {
  name: "bn2b_branch2b"
  type: "BatchNorm"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2b_branch2b"
  type: "Scale"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2b_relu"
  type: "ReLU"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  relu_param {
  }
}
layer {
  name: "res2b_branch2c"
  type: "Convolution"
  bottom: "res2b_branch2b"
  top: "res2b_branch2c"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 80.5582504272
    scale_out: 74.8653945923
    scale_params: 51745.1054688
    scale_params: 215.846694946
    scale_params: 21913.7363281
    scale_params: 358.849914551
    scale_params: 228.679504395
    scale_params: 715.24597168
    scale_params: 450.42880249
    scale_params: 19328.4824219
    scale_params: 7956.36914062
    scale_params: 237.414611816
    scale_params: 240.43031311
    scale_params: 317.575927734
    scale_params: 254.528396606
    scale_params: 370.432037354
    scale_params: 217.49017334
    scale_params: 335.796691895
    scale_params: 11654.4833984
    scale_params: 244.104721069
    scale_params: 6022.56787109
    scale_params: 352.583526611
    scale_params: 884.606201172
    scale_params: 5178.47460938
    scale_params: 25158.3476562
    scale_params: 31578.8105469
    scale_params: 498.326171875
    scale_params: 261.001647949
    scale_params: 568.97644043
    scale_params: 301.080932617
    scale_params: 125.240516663
    scale_params: 2824.68408203
    scale_params: 217.572433472
    scale_params: 291.031341553
    scale_params: 248.668014526
    scale_params: 109.929145813
    scale_params: 289.222320557
    scale_params: 417.826080322
    scale_params: 79039.796875
    scale_params: 800.594055176
    scale_params: 114.738494873
    scale_params: 181.476028442
    scale_params: 340.768798828
    scale_params: 159.772277832
    scale_params: 639.775695801
    scale_params: 237.282333374
    scale_params: 742.382507324
    scale_params: 1615.30322266
    scale_params: 322.379241943
    scale_params: 3.66498115748e+13
    scale_params: 1102.35510254
    scale_params: 169.373748779
    scale_params: 170.837417603
    scale_params: 538.026672363
    scale_params: 249.658843994
    scale_params: 366.746612549
    scale_params: 14529.8203125
    scale_params: 503.191223145
    scale_params: 223.638549805
    scale_params: 223.262954712
    scale_params: 260.063934326
    scale_params: 319.850921631
    scale_params: 191.821533203
    scale_params: 12943.78125
    scale_params: 123.835212708
    scale_params: 6170.63671875
    scale_params: 379.98815918
    scale_params: 229.937301636
    scale_params: 531.348999023
    scale_params: 3646.13330078
    scale_params: 276.157775879
    scale_params: 484.400695801
    scale_params: 13180981248.0
    scale_params: 691.58380127
    scale_params: 158.422210693
    scale_params: 399.262023926
    scale_params: 308.063934326
    scale_params: 113.179176331
    scale_params: 233.593078613
    scale_params: 577.427124023
    scale_params: 23184.25
    scale_params: 3775.47729492
    scale_params: 865.839599609
    scale_params: 426.800567627
    scale_params: 44446.703125
    scale_params: 7792.64160156
    scale_params: 271.970672607
    scale_params: 192.097579956
    scale_params: 760.530212402
    scale_params: 291.78704834
    scale_params: 209.162033081
    scale_params: 1627.64245605
    scale_params: 230.60005188
    scale_params: 885.613037109
    scale_params: 384.328216553
    scale_params: 188.717941284
    scale_params: 417.498687744
    scale_params: 11971.6318359
    scale_params: 211.47215271
    scale_params: 297.140350342
    scale_params: 488.429321289
    scale_params: 231.173812866
    scale_params: 336.916473389
    scale_params: 222.539733887
    scale_params: 13606.3603516
    scale_params: 115.915962219
    scale_params: 1754.57226562
    scale_params: 250.108947754
    scale_params: 249.175674438
    scale_params: 335.595672607
    scale_params: 194.876358032
    scale_params: 1611.07861328
    scale_params: 126.588012695
    scale_params: 169.069229126
    scale_params: 371.431182861
    scale_params: 18036.484375
    scale_params: 254.702758789
    scale_params: 345.478210449
    scale_params: 154958.828125
    scale_params: 271.340301514
    scale_params: 457.904907227
    scale_params: 207.602035522
    scale_params: 280.088775635
    scale_params: 8579.20214844
    scale_params: 220.592971802
    scale_params: 710.646606445
    scale_params: 42542.8476562
    scale_params: 268.423156738
    scale_params: 289281.0
    scale_params: 697.896972656
    scale_params: 99.0964202881
    scale_params: 769.137634277
    scale_params: 370.272125244
    scale_params: 1019.08190918
    scale_params: 7125780992.0
    scale_params: 12839.0166016
    scale_params: 534.24432373
    scale_params: 286352.625
    scale_params: 896.305786133
    scale_params: 356.580535889
    scale_params: 715.855102539
    scale_params: 9753.390625
    scale_params: 19240.0429688
    scale_params: 354.412445068
    scale_params: 485.343109131
    scale_params: 126.610084534
    scale_params: 8399.66699219
    scale_params: 9999.9375
    scale_params: 53484.8710938
    scale_params: 989.288208008
    scale_params: 128686.1875
    scale_params: 3071.1328125
    scale_params: 8112.98583984
    scale_params: 3569.18457031
    scale_params: 309.067230225
    scale_params: 293.050109863
    scale_params: 6432.13427734
    scale_params: 3158.30566406
    scale_params: 1379.9354248
    scale_params: 326.602813721
    scale_params: 954.001159668
    scale_params: 325.433502197
    scale_params: 6951.72021484
    scale_params: 13758.2851562
    scale_params: 7028.85351562
    scale_params: 261.542358398
    scale_params: 495.776763916
    scale_params: 222.282211304
    scale_params: 29351.0996094
    scale_params: 195.807739258
    scale_params: 6299.33398438
    scale_params: 250.933670044
    scale_params: 343.791015625
    scale_params: 25894.2441406
    scale_params: 185.273178101
    scale_params: 501.20300293
    scale_params: 173.01210022
    scale_params: 713.278320312
    scale_params: 10180.3652344
    scale_params: 252.684371948
    scale_params: 488.626220703
    scale_params: 4456.52978516
    scale_params: 179.701004028
    scale_params: 321.608154297
    scale_params: 521.997497559
    scale_params: 424677.3125
    scale_params: 157.134277344
    scale_params: 343.492950439
    scale_params: 10403.0117188
    scale_params: 495.203552246
    scale_params: 8012.93652344
    scale_params: 418.2265625
    scale_params: 279.185577393
    scale_params: 12503.1269531
    scale_params: 6846.21630859
    scale_params: 98.3512268066
    scale_params: 183.41835022
    scale_params: 6177.43164062
    scale_params: 31865.703125
    scale_params: 139.737060547
    scale_params: 9443.6328125
    scale_params: 281.310302734
    scale_params: 154.50328064
    scale_params: 2257.42626953
    scale_params: 309.313171387
    scale_params: 299.879394531
    scale_params: 110.513244629
    scale_params: 178.363479614
    scale_params: 246.57901001
    scale_params: 338.347991943
    scale_params: 1488.7298584
    scale_params: 190.731338501
    scale_params: 160.078048706
    scale_params: 232.449951172
    scale_params: 291.035522461
    scale_params: 242.877044678
    scale_params: 273.04586792
    scale_params: 438.521636963
    scale_params: 184.127807617
    scale_params: 9024.421875
    scale_params: 808.027709961
    scale_params: 9799.59765625
    scale_params: 484.455596924
    scale_params: 1182.69506836
    scale_params: 176.049331665
    scale_params: 936.89239502
    scale_params: 516.592407227
    scale_params: 457.171478271
    scale_params: 202.045959473
    scale_params: 291.371795654
    scale_params: 154.564849854
    scale_params: 646.684509277
    scale_params: 60814.2304688
    scale_params: 3611.50341797
    scale_params: 378.294036865
    scale_params: 516.251342773
    scale_params: 535.09375
    scale_params: 299.963043213
    scale_params: 891.61932373
    scale_params: 72700.125
    scale_params: 124.434181213
    scale_params: 7018873.5
    scale_params: 875.23425293
    scale_params: 32159.9570312
    scale_params: 394.517303467
    scale_params: 227.973861694
    scale_params: 709991.6875
    scale_params: 915.539978027
    scale_params: 203.576019287
    scale_params: 430.434661865
    scale_params: 137.591217041
    scale_params: 2647.37402344
    scale_params: 76.5799789429
    scale_params: 13591.7646484
    scale_params: 1513.8638916
    scale_params: 4217.17919922
    scale_params: 170.604568481
    scale_params: 219.536026001
  }
}
layer {
  name: "bn2b_branch2c"
  type: "BatchNorm"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2b_branch2c"
  type: "Scale"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b"
  type: "Eltwise"
  bottom: "res2a"
  bottom: "res2b_branch2c"
  top: "res2b"
  eltwise_param {
  }
}
layer {
  name: "res2b_relu"
  type: "ReLU"
  bottom: "res2b"
  top: "res2b"
  relu_param {
  }
}
layer {
  name: "res2c_branch2a"
  type: "Convolution"
  bottom: "res2b"
  top: "res2c_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 74.8653945923
    scale_out: 85.5058135986
    scale_params: 901.576538086
    scale_params: 807.837768555
    scale_params: 477.697784424
    scale_params: 462.204406738
    scale_params: 897.943237305
    scale_params: 988.301208496
    scale_params: 434.209716797
    scale_params: 719.438415527
    scale_params: 859.299987793
    scale_params: 910.517150879
    scale_params: 997.50201416
    scale_params: 1147.65783691
    scale_params: 909.765075684
    scale_params: 665.481079102
    scale_params: 608.635742188
    scale_params: 202.08039856
    scale_params: 720.491699219
    scale_params: 889.842773438
    scale_params: 1131.4942627
    scale_params: 791.477539062
    scale_params: 910.617248535
    scale_params: 983.105957031
    scale_params: 792.706970215
    scale_params: 579.372375488
    scale_params: 747.83984375
    scale_params: 701.050231934
    scale_params: 672.573974609
    scale_params: 599.45098877
    scale_params: 827.476379395
    scale_params: 697.910583496
    scale_params: 695.933959961
    scale_params: 878.600585938
    scale_params: 433.2762146
    scale_params: 658.909912109
    scale_params: 625.407714844
    scale_params: 783.494995117
    scale_params: 918.809936523
    scale_params: 585.104797363
    scale_params: 688.671447754
    scale_params: 845.221191406
    scale_params: 671.467956543
    scale_params: 678.809814453
    scale_params: 563.355712891
    scale_params: 804.884765625
    scale_params: 633.112243652
    scale_params: 1054.99633789
    scale_params: 670.326477051
    scale_params: 1195.24377441
    scale_params: 1148.85583496
    scale_params: 811.61920166
    scale_params: 522.11126709
    scale_params: 685.180175781
    scale_params: 1129.73864746
    scale_params: 651.602783203
    scale_params: 467.56552124
    scale_params: 850.487182617
    scale_params: 529.770385742
    scale_params: 423.425140381
    scale_params: 1143.22253418
    scale_params: 993.668151855
    scale_params: 535.172302246
    scale_params: 1030.60693359
    scale_params: 890.143798828
    scale_params: 640.396057129
  }
}
layer {
  name: "bn2c_branch2a"
  type: "BatchNorm"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2c_branch2a"
  type: "Scale"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2a_relu"
  type: "ReLU"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  relu_param {
  }
}
layer {
  name: "res2c_branch2b"
  type: "Convolution"
  bottom: "res2c_branch2a"
  top: "res2c_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 85.5058135986
    scale_out: 114.139755249
    scale_params: 395.282897949
    scale_params: 770.333190918
    scale_params: 771.438110352
    scale_params: 679.782287598
    scale_params: 780.291381836
    scale_params: 742.270629883
    scale_params: 952.525512695
    scale_params: 644.553283691
    scale_params: 843.288208008
    scale_params: 627.871276855
    scale_params: 714.89263916
    scale_params: 720.246459961
    scale_params: 733.915283203
    scale_params: 971.369873047
    scale_params: 564.441711426
    scale_params: 830.686035156
    scale_params: 827.140563965
    scale_params: 610.40637207
    scale_params: 658.608398438
    scale_params: 699.246948242
    scale_params: 845.510131836
    scale_params: 784.857910156
    scale_params: 705.868652344
    scale_params: 767.539672852
    scale_params: 681.158813477
    scale_params: 1071.25488281
    scale_params: 807.911987305
    scale_params: 838.005249023
    scale_params: 565.676635742
    scale_params: 828.22857666
    scale_params: 892.397277832
    scale_params: 968.016845703
    scale_params: 799.148681641
    scale_params: 836.646911621
    scale_params: 1013.82635498
    scale_params: 667.661499023
    scale_params: 962.836303711
    scale_params: 827.028564453
    scale_params: 706.244689941
    scale_params: 732.368286133
    scale_params: 744.644714355
    scale_params: 598.359619141
    scale_params: 939.465454102
    scale_params: 928.101989746
    scale_params: 686.111755371
    scale_params: 780.136352539
    scale_params: 674.700134277
    scale_params: 578.232727051
    scale_params: 722.729675293
    scale_params: 660.564697266
    scale_params: 839.360595703
    scale_params: 891.907348633
    scale_params: 612.80267334
    scale_params: 800.138366699
    scale_params: 452.131896973
    scale_params: 785.716308594
    scale_params: 866.878356934
    scale_params: 666.928771973
    scale_params: 786.352600098
    scale_params: 700.647338867
    scale_params: 776.690185547
    scale_params: 1065.6270752
    scale_params: 651.021362305
    scale_params: 629.113952637
  }
}
layer {
  name: "bn2c_branch2b"
  type: "BatchNorm"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2c_branch2b"
  type: "Scale"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  param {
    decay_mult: 0.0
  }
  param {
