name: "ResNet-50"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.0078125
    mirror: false
    crop_size: 224
    mean_value: 104.0
    mean_value: 117.0
    mean_value: 123.0
    random_resize_param {
      min_size: 256
      max_size: 256
      resize_param {
        interp_mode: CUBIC
      }
    }
  }
  data_param {
    source: "/lustre/dataset/lmdb/imagenet/lmdb_raw_compressed/ilsvrc12_val_lmdb"
    batch_size: 50
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "msra"
      variance_norm: FAN_OUT
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 107.655629139
    scale_out: 11.0592438101
    scale_params: 189.893377868
    scale_params: 89.4487873965
    scale_params: 110.830110287
    scale_params: 125.414683721
    scale_params: 108.457679745
    scale_params: 84.9193681735
    scale_params: 203.217170945
    scale_params: 323.16288129
    scale_params: 277.029963794
    scale_params: 107.475278894
    scale_params: 632.228210344
    scale_params: 91.9690993044
    scale_params: 962.299590549
    scale_params: 582.630669752
    scale_params: 71.72332834
    scale_params: 129.467057669
    scale_params: 258.728563325
    scale_params: 484.350698672
    scale_params: 92.7036335523
    scale_params: 70.1937731026
    scale_params: 485.072557366
    scale_params: 42.9220168513
    scale_params: 156.059821262
    scale_params: 480.197719975
    scale_params: 99.6121478297
    scale_params: 108.341339222
    scale_params: 192.973652976
    scale_params: 92.1486504138
    scale_params: 219.843743129
    scale_params: 105.483022963
    scale_params: 141.688057928
    scale_params: 108.202472841
    scale_params: 158.755899924
    scale_params: 49.8378825146
    scale_params: 244.607552492
    scale_params: 170.989166332
    scale_params: 166.381498889
    scale_params: 150.156518477
    scale_params: 699.24945264
    scale_params: 148.88416397
    scale_params: 231.372735607
    scale_params: 9068835919.43
    scale_params: 316.325714589
    scale_params: 416.131858737
    scale_params: 101.549350062
    scale_params: 96.5023400173
    scale_params: 77.859878659
    scale_params: 97.3748506841
    scale_params: 130.019328135
    scale_params: 106.555854913
    scale_params: 204.441710589
    scale_params: 509.888053742
    scale_params: 424.073039778
    scale_params: 18750712717.4
    scale_params: 96.6120821008
    scale_params: 213.247126522
    scale_params: 88.9308468446
    scale_params: 160.804403885
    scale_params: 127.404252887
    scale_params: 376.328988999
    scale_params: 13914725165.9
    scale_params: 616.518321739
    scale_params: 204.773684484
    scale_params: 609.005123235
    is_negative_input: true
  }
}
layer {
  name: "bn_conv1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale_conv1"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
  relu_param {
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "res2a_branch1"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch1"
  convolution_param {
    num_output: 224
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 11.0592438101
    scale_out: 8.76233093565
    scale_params: 17655.9937805
    scale_params: 384.363475028
    scale_params: 322.014269268
    scale_params: 145172638.192
    scale_params: 5446.06859467
    scale_params: 11392.1540371
    scale_params: 597.36860359
    scale_params: 23063.1482866
    scale_params: 342.497174451
    scale_params: 387.682697581
    scale_params: 524.657609926
    scale_params: 361.129675025
    scale_params: 13295.6680991
    scale_params: 577.505196196
    scale_params: 1567.83215189
    scale_params: 1175.37994495
    scale_params: 446.673388025
    scale_params: 944.028867957
    scale_params: 1189.70314506
    scale_params: 96360.1763104
    scale_params: 273.896266039
    scale_params: 255.197543586
    scale_params: 376.092113783
    scale_params: 114.364019032
    scale_params: 290031142.042
    scale_params: 163.310904716
    scale_params: 350861.120562
    scale_params: 309.01131861
    scale_params: 455.21850497
    scale_params: 74.2794435337
    scale_params: 396.822160441
    scale_params: 948651.584921
    scale_params: 456.613037852
    scale_params: 149321813.652
    scale_params: 900.734619214
    scale_params: 386.917944116
    scale_params: 640.190957625
    scale_params: 587.02459217
    scale_params: 991.039499711
    scale_params: 456.793059991
    scale_params: 141.705415369
    scale_params: 2375.51001393
    scale_params: 483425.991766
    scale_params: 718.074638322
    scale_params: 651.504118402
    scale_params: 64648.7974983
    scale_params: 12605.8224775
    scale_params: 228.067690312
    scale_params: 204.561596741
    scale_params: 428.943186187
    scale_params: 286.334183249
    scale_params: 219.677736713
    scale_params: 267.793527503
    scale_params: 475.515114415
    scale_params: 152.99252768
    scale_params: 683.14244641
    scale_params: 86.0904914314
    scale_params: 591.777377727
    scale_params: 112.737519888
    scale_params: 428.427073364
    scale_params: 753.07616015
    scale_params: 1469.79481914
    scale_params: 232.436103664
    scale_params: 402.372385105
    scale_params: 383.375000056
    scale_params: 275.579090973
    scale_params: 84169.3412103
    scale_params: 288.168879681
    scale_params: 238.905609079
    scale_params: 1460.5823183
    scale_params: 55571.2803096
    scale_params: 617.771102392
    scale_params: 174.996009032
    scale_params: 591.548391215
    scale_params: 348.455615749
    scale_params: 5723.58970902
    scale_params: 302.938069846
    scale_params: 1166.45576985
    scale_params: 1285.90564401
    scale_params: 102564.396749
    scale_params: 570.814891454
    scale_params: 3173.71461437
    scale_params: 1348.29588921
    scale_params: 293.053117797
    scale_params: 343.19621746
    scale_params: 341.871472631
    scale_params: 196.655639635
    scale_params: 5444.89520845
    scale_params: 361.394437252
    scale_params: 180.833415898
    scale_params: 376.625702669
    scale_params: 3536.70085956
    scale_params: 240.516810107
    scale_params: 486.418289473
    scale_params: 60.0918065335
    scale_params: 303.434196547
    scale_params: 412.003748572
    scale_params: 264.337566005
    scale_params: 618.804529715
    scale_params: 245.941314773
    scale_params: 448.413349702
    scale_params: 154.15306448
    scale_params: 172.793890607
    scale_params: 118.110112638
    scale_params: 934.337185649
    scale_params: 274.302947232
    scale_params: 1507.66206735
    scale_params: 311.009650291
    scale_params: 1024.18691896
    scale_params: 716.519291814
    scale_params: 196.534142527
    scale_params: 446.466494999
    scale_params: 154.577867885
    scale_params: 764.769467315
    scale_params: 301.049690852
    scale_params: 4710.95647444
    scale_params: 955.822847403
    scale_params: 414.560174812
    scale_params: 434.967072784
    scale_params: 543.333517658
    scale_params: 358.463427192
    scale_params: 20358.4937064
    scale_params: 3092064.1729
    scale_params: 360.290184654
    scale_params: 247.646416797
    scale_params: 477.351829326
    scale_params: 685.703078299
    scale_params: 1238.59107973
    scale_params: 2326.49017718
    scale_params: 516.426224009
    scale_params: 1614.87009305
    scale_params: 1277.49662022
    scale_params: 812053.037112
    scale_params: 413.993878031
    scale_params: 704.637251808
    scale_params: 381.2111665
    scale_params: 470.088704127
    scale_params: 687.827879237
    scale_params: 349.681846935
    scale_params: 283.310346753
    scale_params: 117.549485
    scale_params: 342.514021861
    scale_params: 15416.6248817
    scale_params: 672.226714535
    scale_params: 477.813039702
    scale_params: 288.569265387
    scale_params: 365.639189154
    scale_params: 435.243890069
    scale_params: 885.035524989
    scale_params: 293983.758639
    scale_params: 488.032214105
    scale_params: 468.097625532
    scale_params: 440.993643622
    scale_params: 444.324141062
    scale_params: 2881.56087164
    scale_params: 572.423206913
    scale_params: 723.068251642
    scale_params: 277.916151931
    scale_params: 213.001439032
    scale_params: 569.647553063
    scale_params: 127.388409298
    scale_params: 216.68250216
    scale_params: 273.782906115
    scale_params: 120.393504929
    scale_params: 403.073205323
    scale_params: 63.4857114525
    scale_params: 501005590.635
    scale_params: 57371272.4628
    scale_params: 411.196156495
    scale_params: 1455.37534279
    scale_params: 595.092722202
    scale_params: 445.227243345
    scale_params: 648.003243808
    scale_params: 462.950881336
    scale_params: 203.047681707
    scale_params: 1974.6539716
    scale_params: 6928254.74553
    scale_params: 213.737675738
    scale_params: 384.24654029
    scale_params: 585.037018986
    scale_params: 238.518117281
    scale_params: 1782.94743743
    scale_params: 275.783135214
    scale_params: 266.313952918
    scale_params: 191.632159461
    scale_params: 332.958204784
    scale_params: 3082.93733213
    scale_params: 1202.78382168
    scale_params: 483.93899121
    scale_params: 163.126060073
    scale_params: 445.469588174
    scale_params: 128.870062813
    scale_params: 296.684347229
    scale_params: 10176.3139188
    scale_params: 915.793098951
    scale_params: 243.858651451
    scale_params: 415.665233942
    scale_params: 378.509096128
    scale_params: 391.31075521
    scale_params: 480.259793461
    scale_params: 141515.748056
    scale_params: 159.870383754
    scale_params: 378.651194386
    scale_params: 215.555524172
    scale_params: 358.061451374
    scale_params: 8933.51680416
    scale_params: 357.018624832
    scale_params: 361.885264527
    scale_params: 289.162790546
    scale_params: 115.683001192
    scale_params: 756.95956334
    scale_params: 1182.44875091
    scale_params: 322.229809638
    scale_params: 415.546390952
    scale_params: 403.080182389
    scale_params: 2727.24336089
    scale_params: 1012.04897595
    scale_params: 362.12150043
    scale_params: 751.873744031
    scale_params: 509.316793276
    scale_params: 1184.54420044
    scale_params: 372.356185481
    scale_params: 399.506095182
    scale_params: 290.857143052
  }
}
layer {
  name: "bn2a_branch1"
  type: "BatchNorm"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2a_branch1"
  type: "Scale"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 11.0592438101
    scale_out: 30.6295085235
    scale_params: 425.984779593
    scale_params: 838.768667538
    scale_params: 3024469839.86
    scale_params: 1090.94850433
    scale_params: 337.639840462
    scale_params: 302.013839838
    scale_params: 381.848433673
    scale_params: 753.057661999
    scale_params: 341.876244928
    scale_params: 354.66866902
    scale_params: 199.357815838
    scale_params: 317.479368932
    scale_params: 354.537184028
    scale_params: 615.005334989
    scale_params: 264.729230103
    scale_params: 482.943891233
    scale_params: 1591.68373122
    scale_params: 332.784228571
    scale_params: 228.34933753
    scale_params: 262.813531051
    scale_params: 296.621175517
    scale_params: 707.388180956
    scale_params: 1790121098.48
    scale_params: 318.608425715
    scale_params: 236.367207946
    scale_params: 1089.26733139
    scale_params: 2171880626.34
    scale_params: 305.874011066
    scale_params: 538.015503977
    scale_params: 351.275834861
    scale_params: 355.564297794
    scale_params: 928.888874263
    scale_params: 558.719501735
    scale_params: 330.261514032
    scale_params: 1023.73462834
    scale_params: 664.226759168
    scale_params: 567.353313435
    scale_params: 478.094098785
    scale_params: 408.620575932
    scale_params: 402.053459532
    scale_params: 758.366199327
    scale_params: 1036.72880959
    scale_params: 409.828355586
    scale_params: 498.523393467
    scale_params: 355.750262634
    scale_params: 210.634403561
    scale_params: 1029.82527388
    scale_params: 456.562893829
    scale_params: 317.284497251
    scale_params: 587.210154431
    scale_params: 643.198441381
    scale_params: 351.00677655
    scale_params: 947.120915574
    scale_params: 459.455435147
    scale_params: 433.204204429
    scale_params: 288.435920702
    scale_params: 394.478910058
    scale_params: 367.269270978
    scale_params: 490.192652469
    scale_params: 235.72209901
    scale_params: 1008.64839038
    scale_params: 733.976497631
    scale_params: 177.678254314
    scale_params: 446.865102389
  }
}
layer {
  name: "bn2a_branch2a"
  type: "BatchNorm"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2a_branch2a"
  type: "Scale"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a_relu"
  type: "ReLU"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  relu_param {
  }
}
layer {
  name: "res2a_branch2b"
  type: "Convolution"
  bottom: "res2a_branch2a"
  top: "res2a_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 30.6295085235
    scale_out: 28.008996839
    scale_params: 678.30878301
    scale_params: 527.381858943
    scale_params: 1477.39472728
    scale_params: 598.254499286
    scale_params: 1042.11821345
    scale_params: 990.52499572
    scale_params: 2106.8987396
    scale_params: 588.077881513
    scale_params: 1084.06540445
    scale_params: 792.804330627
    scale_params: 381.300670697
    scale_params: 603.694299898
    scale_params: 768.179791094
    scale_params: 711.519176516
    scale_params: 450.631485355
    scale_params: 571.393633501
    scale_params: 410.744013102
    scale_params: 572.441700024
    scale_params: 1186.73862825
    scale_params: 643.453186935
    scale_params: 1206.86859031
    scale_params: 1163.82646437
    scale_params: 749.770105211
    scale_params: 743.703692898
    scale_params: 813.744915591
    scale_params: 1109.0922803
    scale_params: 572.690184872
    scale_params: 2533.11935611
    scale_params: 805.770441015
    scale_params: 1000.26802614
    scale_params: 626.656060771
    scale_params: 1607.12242043
    scale_params: 938.744922932
    scale_params: 901.763127175
    scale_params: 1399.58632749
    scale_params: 650.27323998
    scale_params: 525.75277258
    scale_params: 1337.17414292
    scale_params: 1438.89856891
    scale_params: 541.147356683
    scale_params: 15373719374.7
    scale_params: 1633.49457364
    scale_params: 713.656688025
    scale_params: 678.042742467
    scale_params: 354.253095424
    scale_params: 1135.37748017
    scale_params: 1124.66658529
    scale_params: 1543.45541115
    scale_params: 711.733795596
    scale_params: 453.569399027
    scale_params: 878.420501888
    scale_params: 356.333340162
    scale_params: 2004.24248891
    scale_params: 415.440656772
    scale_params: 569.850026555
    scale_params: 1034.45633286
    scale_params: 446.008979391
    scale_params: 1352.94823942
    scale_params: 803.363064375
    scale_params: 571.009014127
    scale_params: 348.354067071
    scale_params: 334.911337572
    scale_params: 374.911174103
    scale_params: 1049.41270264
  }
}
layer {
  name: "bn2a_branch2b"
  type: "BatchNorm"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2a_branch2b"
  type: "Scale"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2b_relu"
  type: "ReLU"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  relu_param {
  }
}
layer {
  name: "res2a_branch2c"
  type: "Convolution"
  bottom: "res2a_branch2b"
  top: "res2a_branch2c"
  convolution_param {
    num_output: 224
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 28.008996839
    scale_out: 17.5936566031
    scale_params: 4827.55741897
    scale_params: 155.517832383
    scale_params: 1781.5978745
    scale_params: 1806003.26989
    scale_params: 965.887672999
    scale_params: 311.280563789
    scale_params: 506.814678528
    scale_params: 732.942273274
    scale_params: 1714.11034044
    scale_params: 213.352695463
    scale_params: 433.542771957
    scale_params: 436.956214892
    scale_params: 746.569653667
    scale_params: 6626.64388515
    scale_params: 221.11580925
    scale_params: 378.363644242
    scale_params: 356.250645406
    scale_params: 9038.06610591
    scale_params: 1123.52024665
    scale_params: 276.659375971
    scale_params: 410.923197785
    scale_params: 4868.89413444
    scale_params: 393.476591104
    scale_params: 342.568236623
    scale_params: 4273446.27733
    scale_params: 390.183461304
    scale_params: 32170.2826335
    scale_params: 265.000861216
    scale_params: 1426.66052134
    scale_params: 471.054235077
    scale_params: 478.629415436
    scale_params: 304633.446583
    scale_params: 1021.42173931
    scale_params: 70581007.3876
    scale_params: 990.365696552
    scale_params: 262.961029755
    scale_params: 2445.00003062
    scale_params: 276.627193109
    scale_params: 3519.89468927
    scale_params: 215.689152651
    scale_params: 2999.90486837
    scale_params: 207.094395959
    scale_params: 84080.7520787
    scale_params: 340.022252424
    scale_params: 335.090180457
    scale_params: 866.400393941
    scale_params: 861.463882566
    scale_params: 1118.97513384
    scale_params: 460.385098322
    scale_params: 321.25538633
    scale_params: 414.931537477
    scale_params: 11499.6445625
    scale_params: 165.074069822
    scale_params: 370.764591471
    scale_params: 151.53316235
    scale_params: 2835.45530332
    scale_params: 447.937899812
    scale_params: 1440.01471437
    scale_params: 478.279490183
    scale_params: 197.120135233
    scale_params: 8162.56383105
    scale_params: 352.616395496
    scale_params: 1500.19744783
    scale_params: 350.870191842
    scale_params: 6737.02685993
    scale_params: 180.4707957
    scale_params: 1683.66896175
    scale_params: 454.661861225
    scale_params: 6569.67080868
    scale_params: 2240.55790533
    scale_params: 5972.70424515
    scale_params: 364.105594234
    scale_params: 336.258007764
    scale_params: 18474.6569324
    scale_params: 852.782815199
    scale_params: 9149.99988916
    scale_params: 712.075837335
    scale_params: 475.651679453
    scale_params: 5945.36453895
    scale_params: 966.460945413
    scale_params: 171.918079552
    scale_params: 1825.16062631
    scale_params: 892.692999503
    scale_params: 197.362484142
    scale_params: 215.363772036
    scale_params: 272.895872422
    scale_params: 346.045211814
    scale_params: 766.766831633
    scale_params: 446.704571973
    scale_params: 102.19859573
    scale_params: 355.778864742
    scale_params: 162.679721114
    scale_params: 399.658252054
    scale_params: 112.976064439
    scale_params: 350.998594659
    scale_params: 1032.06611655
    scale_params: 342.393978949
    scale_params: 350.027378015
    scale_params: 611.596834128
    scale_params: 175.672570468
    scale_params: 226.562195372
    scale_params: 3221.98849977
    scale_params: 1284.46524515
    scale_params: 858.846219148
    scale_params: 3227.71465253
    scale_params: 303.444740668
    scale_params: 441.37448825
    scale_params: 252.564179758
    scale_params: 437.501493943
    scale_params: 397.645048138
    scale_params: 1602.62685898
    scale_params: 1275.51380634
    scale_params: 688.751426282
    scale_params: 469.463779548
    scale_params: 313.050714151
    scale_params: 864.876910371
    scale_params: 361.421440604
    scale_params: 289.474656371
    scale_params: 642.527532297
    scale_params: 413.722214342
    scale_params: 5029.70427929
    scale_params: 684.619854943
    scale_params: 1260.63457201
    scale_params: 268523.234818
    scale_params: 708.50501288
    scale_params: 469.736859748
    scale_params: 501.340212672
    scale_params: 129.865677593
    scale_params: 237.649282604
    scale_params: 294.682853083
    scale_params: 312.059941925
    scale_params: 1453.00841426
    scale_params: 17849.0657967
    scale_params: 478.28995795
    scale_params: 425.470107305
    scale_params: 1621.90307147
    scale_params: 324.367805827
    scale_params: 182.789748329
    scale_params: 332.796521321
    scale_params: 2558.0194192
    scale_params: 3462.54876223
    scale_params: 487.225419338
    scale_params: 9142.94359132
    scale_params: 4671.33283037
    scale_params: 610.546380195
    scale_params: 522.117371543
    scale_params: 397.808044896
    scale_params: 298.23283296
    scale_params: 894.248022867
    scale_params: 161.87874136
    scale_params: 19998.6466156
    scale_params: 1059.91103653
    scale_params: 257.771072952
    scale_params: 537.646681126
    scale_params: 269.682757867
    scale_params: 673.587277531
    scale_params: 663.431439695
    scale_params: 285.773472061
    scale_params: 2614.50447041
    scale_params: 225.075756403
    scale_params: 293.670815815
    scale_params: 276.907859698
    scale_params: 154.05822439
    scale_params: 614.552739733
    scale_params: 746.593131887
    scale_params: 313.668163727
    scale_params: 2184870920.82
    scale_params: 614316992.655
    scale_params: 812.792713689
    scale_params: 16875.8915888
    scale_params: 217.819968
    scale_params: 469.403379464
    scale_params: 167.68161193
    scale_params: 218.212359199
    scale_params: 468.492749896
    scale_params: 15759.2877721
    scale_params: 9280.85650455
    scale_params: 207.451810902
    scale_params: 467.605143794
    scale_params: 819.242128149
    scale_params: 1612.02217649
    scale_params: 804.010581496
    scale_params: 141.418471505
    scale_params: 196.591534733
    scale_params: 407.746262297
    scale_params: 455.829215277
    scale_params: 2679.9804942
    scale_params: 10958.1331616
    scale_params: 186.133529154
    scale_params: 46241.6290998
    scale_params: 247.512244251
    scale_params: 855.029268825
    scale_params: 365.786731718
    scale_params: 159.75708419
    scale_params: 842.902334174
    scale_params: 1102.78347931
    scale_params: 321.816149845
    scale_params: 181.31738224
    scale_params: 141.445058151
    scale_params: 1922.59555662
    scale_params: 139.113906569
    scale_params: 652.58847609
    scale_params: 375.600418912
    scale_params: 391.033622973
    scale_params: 342.089131554
    scale_params: 230.774509713
    scale_params: 308.511319299
    scale_params: 301.907348433
    scale_params: 623.382228817
    scale_params: 699.990935
    scale_params: 1049.53734418
    scale_params: 177.899546966
    scale_params: 283.774396107
    scale_params: 491.724387316
    scale_params: 16248.5077882
    scale_params: 4837.79879515
    scale_params: 304.343394642
    scale_params: 427.037766784
    scale_params: 475.55793846
    scale_params: 525.166400248
    scale_params: 949.163078749
    scale_params: 208.316974825
    scale_params: 242.043436141
    scale_params: 366.36924344
  }
}
layer {
  name: "bn2a_branch2c"
  type: "BatchNorm"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2a_branch2c"
  type: "Scale"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a"
  type: "Eltwise"
  bottom: "res2a_branch1"
  bottom: "res2a_branch2c"
  top: "res2a"
  eltwise_param {
  }
}
layer {
  name: "res2a_relu"
  type: "ReLU"
  bottom: "res2a"
  top: "res2a"
  relu_param {
  }
}
layer {
  name: "res2b_branch2a"
  type: "Convolution"
  bottom: "res2a"
  top: "res2b_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 17.5936566031
    scale_out: 27.7604415892
    scale_params: 666.488244255
    scale_params: 589.384821111
    scale_params: 4477590117.29
    scale_params: 738.375522267
    scale_params: 466.119620455
    scale_params: 856.903682979
    scale_params: 544.119370344
    scale_params: 820.630525189
    scale_params: 590.805397146
    scale_params: 549.292287734
    scale_params: 267.093025423
    scale_params: 812.358716274
    scale_params: 577.393966337
    scale_params: 832.730558914
    scale_params: 3749027491.53
    scale_params: 366.3213096
    scale_params: 649.196605857
    scale_params: 384.496716214
    scale_params: 897.138133782
    scale_params: 5204684573.18
    scale_params: 713.819625155
    scale_params: 1106.19217169
    scale_params: 11989309444.5
    scale_params: 581.779606757
    scale_params: 1158.07727902
    scale_params: 690.763263869
    scale_params: 493.787165327
    scale_params: 597.877168418
    scale_params: 985.159621896
    scale_params: 622.63467064
    scale_params: 1123.28117734
    scale_params: 999.19079811
    scale_params: 900.610503194
    scale_params: 646.982529443
    scale_params: 889.209486515
    scale_params: 473.552932443
    scale_params: 545.263435055
    scale_params: 684.831812456
    scale_params: 727.942683098
    scale_params: 670.713410175
    scale_params: 631.607735638
    scale_params: 374.460363947
    scale_params: 790.090152401
    scale_params: 946.169033674
    scale_params: 1016.55356224
    scale_params: 629.694878627
    scale_params: 6343547187.34
    scale_params: 487.394435916
    scale_params: 706.37835718
    scale_params: 894.701347872
    scale_params: 279.414024648
    scale_params: 1185.48113088
    scale_params: 687.780476448
    scale_params: 4334131929.24
    scale_params: 1121.65061283
    scale_params: 907.579581546
    scale_params: 560.563337751
    scale_params: 892.858248027
    scale_params: 1142.16410927
    scale_params: 7891883917.76
    scale_params: 453.9918234
    scale_params: 882.600609829
    scale_params: 658.869566668
    scale_params: 947.030408156
  }
}
layer {
  name: "bn2b_branch2a"
  type: "BatchNorm"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2b_branch2a"
  type: "Scale"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2a_relu"
  type: "ReLU"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  relu_param {
  }
}
layer {
  name: "res2b_branch2b"
  type: "Convolution"
  bottom: "res2b_branch2a"
  top: "res2b_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 27.7604415892
    scale_out: 22.4355684138
    scale_params: 511.739859112
    scale_params: 249.188643198
    scale_params: 634.484291967
    scale_params: 301.372605713
    scale_params: 599.739602841
    scale_params: 835.827306292
    scale_params: 128.409230491
    scale_params: 355.539675377
    scale_params: 478.542342908
    scale_params: 1193.70918336
    scale_params: 870.471954769
    scale_params: 563.913877083
    scale_params: 685.124246363
    scale_params: 513.154757766
    scale_params: 296.652293361
    scale_params: 297.32995271
    scale_params: 544.641183397
    scale_params: 978.868698207
    scale_params: 728.420619504
    scale_params: 406.07110044
    scale_params: 1325.44875989
    scale_params: 794.086291356
    scale_params: 338.719993298
    scale_params: 451.860125464
    scale_params: 787.543285783
    scale_params: 853.41548185
    scale_params: 615.864417165
    scale_params: 618.128239827
    scale_params: 523.884355097
    scale_params: 739.094788351
    scale_params: 359.966122369
    scale_params: 432.713819882
    scale_params: 765.124625307
    scale_params: 821.157500999
    scale_params: 684.270326587
    scale_params: 609.484011713
    scale_params: 592.090482558
    scale_params: 705.398968091
    scale_params: 690.54577307
    scale_params: 973.185716363
    scale_params: 681.045525585
    scale_params: 574.451627967
    scale_params: 703.307836536
    scale_params: 737.657718609
    scale_params: 351.18751143
    scale_params: 1109.77710811
    scale_params: 655.750279525
    scale_params: 608.658360282
    scale_params: 690.180499941
    scale_params: 927.702766797
    scale_params: 622.280213916
    scale_params: 496.323111497
    scale_params: 698.413089758
    scale_params: 238.561032678
    scale_params: 441.195677054
    scale_params: 590.773904547
    scale_params: 248.50931391
    scale_params: 480.465340337
    scale_params: 317.078634058
    scale_params: 145.502101057
    scale_params: 682.310116328
    scale_params: 955.276683731
    scale_params: 969.538677402
    scale_params: 264.608278537
  }
}
layer {
  name: "bn2b_branch2b"
  type: "BatchNorm"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2b_branch2b"
  type: "Scale"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2b_relu"
  type: "ReLU"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  relu_param {
  }
}
layer {
  name: "res2b_branch2c"
  type: "Convolution"
  bottom: "res2b_branch2b"
  top: "res2b_branch2c"
  convolution_param {
    num_output: 224
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 22.4355684138
    scale_out: 17.5936566031
    scale_params: 331.223110278
    scale_params: 26265.3384741
    scale_params: 97582.1847391
    scale_params: 286.75470105
    scale_params: 208.759365656
    scale_params: 334.95690581
    scale_params: 254.432409721
    scale_params: 186.943019445
    scale_params: 4522156.71034
    scale_params: 192.67182229
    scale_params: 356.959471058
    scale_params: 923.657064034
    scale_params: 156.71560275
    scale_params: 1769.47625878
    scale_params: 775.477003901
    scale_params: 445.134508161
    scale_params: 33538.269426
    scale_params: 58913.0625511
    scale_params: 226.284888703
    scale_params: 209.102238193
    scale_params: 595.925370689
    scale_params: 95018.0319178
    scale_params: 205.559320621
    scale_params: 325618.766534
    scale_params: 481.720240916
    scale_params: 35656.3748593
    scale_params: 496.272362729
    scale_params: 1261.36929491
    scale_params: 1087.39852197
    scale_params: 561.223929636
    scale_params: 222.127144497
    scale_params: 889.113197907
    scale_params: 181.228828625
    scale_params: 26163.0161927
    scale_params: 242.280460021
    scale_params: 1089.80559276
    scale_params: 632.844736319
    scale_params: 324.949904076
    scale_params: 171.344696931
    scale_params: 42945.0944042
    scale_params: 1173.45852243
    scale_params: 706.314665763
    scale_params: 213.986526934
    scale_params: 367.915622268
    scale_params: 210.943363754
    scale_params: 201.308071657
    scale_params: 233.880666666
    scale_params: 440104.726295
    scale_params: 22719.8143244
    scale_params: 86907.4241381
    scale_params: 142.633222924
    scale_params: 4159.60116598
    scale_params: 1067.2588066
    scale_params: 290.596817806
    scale_params: 1920.72162016
    scale_params: 2060.36019763
    scale_params: 26338.316546
    scale_params: 1022.04035925
    scale_params: 377.625710017
    scale_params: 37279.2393992
    scale_params: 54330.8746318
    scale_params: 199.321468252
    scale_params: 867.879053696
    scale_params: 451.203473581
    scale_params: 2866.78236891
    scale_params: 4132.07303805
    scale_params: 291.045800475
    scale_params: 432.933493391
    scale_params: 310090.582421
    scale_params: 584.338084099
    scale_params: 156.161148261
    scale_params: 134.918642031
    scale_params: 2681.38392442
    scale_params: 1062.48762048
    scale_params: 2737.7081811
    scale_params: 317.286269023
    scale_params: 653.716459664
    scale_params: 151.464727954
    scale_params: 15458.7753196
    scale_params: 9670.94866477
    scale_params: 2262.32946739
    scale_params: 356.353960251
    scale_params: 12877.1699079
    scale_params: 14831.6318085
    scale_params: 44195.5131563
    scale_params: 2178.76453063
    scale_params: 91700.9702661
    scale_params: 56062.3929899
    scale_params: 59953.546855
    scale_params: 392.535968138
    scale_params: 1126.69954137
    scale_params: 231.978389831
    scale_params: 267.0114733
    scale_params: 1919.14752529
    scale_params: 11324.7679676
    scale_params: 71318.3301647
    scale_params: 762.034179133
    scale_params: 1817.45800345
    scale_params: 1198.40340774
    scale_params: 610.175886313
    scale_params: 10038.0410468
    scale_params: 4172.9982461
    scale_params: 455745.470728
    scale_params: 1939.23552739
    scale_params: 72733.4806099
    scale_params: 850.216122516
    scale_params: 181.670574017
    scale_params: 2081.16901627
    scale_params: 169.758792343
    scale_params: 702.588040705
    scale_params: 29937.4877177
    scale_params: 989.88730153
    scale_params: 10034.5051078
    scale_params: 300.291853429
    scale_params: 2230.53018586
    scale_params: 37495.8409001
    scale_params: 142.545901589
    scale_params: 238.071667993
    scale_params: 100404.878204
    scale_params: 237.452292037
    scale_params: 310.139296184
    scale_params: 207.197626478
    scale_params: 273.835984602
    scale_params: 267164.4036
    scale_params: 32252.3924415
    scale_params: 3229.50490541
    scale_params: 227.507252406
    scale_params: 333.27172176
    scale_params: 228.605900047
    scale_params: 29120.5334193
    scale_params: 220.216401158
    scale_params: 527.427158457
    scale_params: 145.81563244
    scale_params: 315.308118083
    scale_params: 308.686727453
    scale_params: 1583.71222415
    scale_params: 336.012117657
    scale_params: 202.948080043
    scale_params: 8224.29661148
    scale_params: 10110.1203024
    scale_params: 318379.844842
    scale_params: 410.858381745
    scale_params: 195.237547951
    scale_params: 618.639640593
    scale_params: 71697.0047943
    scale_params: 2420.78742187
    scale_params: 369.950150032
    scale_params: 11289.5034023
    scale_params: 3497.55692439
    scale_params: 776.269912464
    scale_params: 3923.70497214
    scale_params: 668.214633078
    scale_params: 393.460860161
    scale_params: 251.209139377
    scale_params: 221.26910612
    scale_params: 27747.1862482
    scale_params: 191.906969849
    scale_params: 703.439954273
    scale_params: 201800.797805
    scale_params: 1321.18930365
    scale_params: 3843.31886276
    scale_params: 1598.01359417
    scale_params: 10630.869306
    scale_params: 51380.3027212
    scale_params: 322.225034044
    scale_params: 994.031111019
    scale_params: 306.85718417
    scale_params: 120828.81594
    scale_params: 54630.8498859
    scale_params: 328.854792071
    scale_params: 219.504676475
    scale_params: 8333.47409222
    scale_params: 1848.12990995
    scale_params: 4851497.23973
    scale_params: 611.400804918
    scale_params: 2804.81634231
    scale_params: 249.220004913
    scale_params: 1310.40430912
    scale_params: 474.848384602
    scale_params: 196.085050242
    scale_params: 428.708133479
    scale_params: 611.908774261
    scale_params: 14093.6559421
    scale_params: 1195.83805723
    scale_params: 205.14508837
    scale_params: 268.674953276
    scale_params: 219.742599863
    scale_params: 22452.2242302
    scale_params: 665732.13979
    scale_params: 127742.078449
    scale_params: 2256.65395637
    scale_params: 86676.5341345
    scale_params: 1868.17342212
    scale_params: 164.985336815
    scale_params: 250.947771292
    scale_params: 9617.10976469
    scale_params: 8261.04158134
    scale_params: 843.855243641
    scale_params: 5574.90966457
    scale_params: 17996.7540365
    scale_params: 511.698227921
    scale_params: 56735.3957854
    scale_params: 491.401918138
    scale_params: 970.970180937
    scale_params: 1718.32792125
    scale_params: 220.927304176
    scale_params: 1390.34405283
    scale_params: 359.097799123
    scale_params: 10173.0942718
    scale_params: 586.585986536
    scale_params: 301.360947702
    scale_params: 530.587717319
    scale_params: 1024.53220313
    scale_params: 13396.7606786
    scale_params: 501.60700727
    scale_params: 406.268964993
    scale_params: 349.022239761
    scale_params: 647.037836052
    scale_params: 308.840174641
    scale_params: 30964.8972279
    scale_params: 8963.71855001
    scale_params: 354.381570018
    scale_params: 16228.5249396
    scale_params: 1219.63585592
  }
}
layer {
  name: "bn2b_branch2c"
  type: "BatchNorm"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2b_branch2c"
  type: "Scale"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b"
  type: "Eltwise"
  bottom: "res2a"
  bottom: "res2b_branch2c"
  top: "res2b"
  eltwise_param {
  }
}
layer {
  name: "res2b_relu"
  type: "ReLU"
  bottom: "res2b"
  top: "res2b"
  relu_param {
  }
}
layer {
  name: "res2c_branch2a"
  type: "Convolution"
  bottom: "res2b"
  top: "res2c_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 17.5936566031
    scale_out: 34.8933423655
    scale_params: 309.920169215
    scale_params: 276.369479728
    scale_params: 716.254161049
    scale_params: 893.504304539
    scale_params: 503.508487213
    scale_params: 583.30652026
    scale_params: 644.518102118
    scale_params: 885.003635201
    scale_params: 637.378637426
    scale_params: 764.142207775
    scale_params: 882.703812172
    scale_params: 276.300813352
    scale_params: 743.9545996
    scale_params: 703.72380369
    scale_params: 527.410904567
    scale_params: 507.48523142
    scale_params: 881.65280831
    scale_params: 526.928314089
    scale_params: 1010.18188007
    scale_params: 525.695114039
    scale_params: 4837870744.64
    scale_params: 499.163810487
    scale_params: 803.40978951
    scale_params: 658.099314105
    scale_params: 3691783904.71
    scale_params: 686.878848954
    scale_params: 926.185407133
    scale_params: 945.8824669
    scale_params: 996.6269432
    scale_params: 652.032652028
    scale_params: 694.134450315
    scale_params: 460.39643888
    scale_params: 273.706482509
    scale_params: 857.62048848
    scale_params: 992.578709793
    scale_params: 556.60113368
    scale_params: 657.263439935
    scale_params: 501.289140407
    scale_params: 602.411925442
    scale_params: 920.094652825
    scale_params: 252.921543278
    scale_params: 658.552853097
    scale_params: 518.727096191
    scale_params: 530.556339071
    scale_params: 647.781659903
    scale_params: 631.987662828
    scale_params: 799.404371819
    scale_params: 3938501670.96
    scale_params: 427.005203328
    scale_params: 634.757944189
    scale_params: 621.410673214
    scale_params: 523.87041186
    scale_params: 842.340178964
    scale_params: 478.727813267
    scale_params: 732.326093959
    scale_params: 632.03471716
    scale_params: 734.537529061
    scale_params: 609.037458034
    scale_params: 249.694159504
    scale_params: 736.013808982
    scale_params: 714.203891742
    scale_params: 815.488389075
    scale_params: 1034.51164365
    scale_params: 2162.65876915
  }
}
layer {
  name: "bn2c_branch2a"
  type: "BatchNorm"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2c_branch2a"
  type: "Scale"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2a_relu"
  type: "ReLU"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  relu_param {
  }
}
layer {
  name: "res2c_branch2b"
  type: "Convolution"
  bottom: "res2c_branch2a"
  top: "res2c_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 34.8933423655
    scale_out: 27.5401249131
    scale_params: 582.632262928
    scale_params: 361.279909442
    scale_params: 345.941636752
    scale_params: 1059.27206747
    scale_params: 615.780585443
    scale_params: 320.394768711
    scale_params: 392.357825868
    scale_params: 481.549912089
    scale_params: 288.413275878
    scale_params: 853.336614188
    scale_params: 602.679828826
    scale_params: 459.975521871
    scale_params: 246.889892215
    scale_params: 555.919606759
    scale_params: 479.963424946
    scale_params: 939.145450302
    scale_params: 579.571790034
    scale_params: 672.578374622
    scale_params: 493.525878645
    scale_params: 435.32258804
    scale_params: 178.09914794
    scale_params: 513.71441367
    scale_params: 441.517074363
    scale_params: 535.749567064
    scale_params: 491.4574001
    scale_params: 622.018392649
    scale_params: 601.162972457
    scale_params: 557.704686354
    scale_params: 768.745601971
    scale_params: 622.675247287
    scale_params: 449.165936557
    scale_params: 677.24603295
    scale_params: 485.820330244
    scale_params: 505.421620746
    scale_params: 559.223140172
    scale_params: 552.326127801
    scale_params: 498.822696306
    scale_params: 853.894127188
    scale_params: 567.512663454
    scale_params: 688.585488832
    scale_params: 770.607501947
    scale_params: 466.495222363
    scale_params: 880.04581825
    scale_params: 611.396901403
    scale_params: 619.691793043
    scale_params: 711.318103487
    scale_params: 790.950088292
    scale_params: 477.685672254
    scale_params: 776.668249077
    scale_params: 682.525619699
    scale_params: 560.199746745
    scale_params: 465.279631953
    scale_params: 840.403304015
    scale_params: 563.840644248
    scale_params: 978.278931699
    scale_params: 476.082853852
    scale_params: 575.578036417
    scale_params: 516.810618903
    scale_params: 945.42782377
    scale_params: 664.503773863
    scale_params: 1219.55644871
    scale_params: 621.936144978
    scale_params: 273.842125935
    scale_params: 674.035075532
  }
}
layer {
  name: "bn2c_branch2b"
  type: "BatchNorm"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2c_branch2b"
  type: "Scale"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2b_relu"
  type: "ReLU"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  relu_param {
  }
}
layer {
  name: "res2c_branch2c"
  type: "Convolution"
  bottom: "res2c_branch2b"
  top: "res2c_branch2c"
  convolution_param {
    num_output: 224
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 27.5401249131
    scale_out: 17.5936566031
    scale_params: 126.232801566
    scale_params: 52467.9296546
    scale_params: 62078.6454151
    scale_params: 156.709528472
    scale_params: 174.431844198
    scale_params: 7033.57810211
    scale_params: 216.13908331
    scale_params: 317.374386473
    scale_params: 44034.0371287
    scale_params: 311.830677346
    scale_params: 455.579903015
    scale_params: 1192.08612736
    scale_params: 298.786080147
    scale_params: 9267.97056109
    scale_params: 1542.1955498
    scale_params: 625.521148229
    scale_params: 23970.8450794
    scale_params: 148098.902575
    scale_params: 1691.9974958
    scale_params: 1846.75713455
    scale_params: 542.295092699
    scale_params: 67971.6812008
    scale_params: 239.811063623
    scale_params: 2209.60163954
    scale_params: 119.754897026
    scale_params: 420.975454501
    scale_params: 171.970223987
    scale_params: 368.801886808
    scale_params: 86.4594537345
    scale_params: 3513.18738846
    scale_params: 259.310108676
    scale_params: 194.854833907
    scale_params: 905.723617405
    scale_params: 140.462204231
    scale_params: 269.540495627
    scale_params: 188914.902652
    scale_params: 73.3804444446
    scale_params: 964.809894487
    scale_params: 3929.02926629
    scale_params: 9874.97951706
    scale_params: 4594.56196784
    scale_params: 64518.6177184
    scale_params: 384.089549359
    scale_params: 349.620194193
    scale_params: 271.874085178
    scale_params: 388.077730057
    scale_params: 339.243246721
    scale_params: 145963.98581
    scale_params: 226.811278726
    scale_params: 1478.97244939
    scale_params: 1034.01500026
    scale_params: 63938.3014509
    scale_params: 501.25482286
    scale_params: 233.514486194
    scale_params: 2189.78927324
    scale_params: 103.422169507
    scale_params: 767.924527595
    scale_params: 146.541856601
    scale_params: 178848.945434
    scale_params: 21183.4078317
    scale_params: 31376.4262539
    scale_params: 306.786691168
    scale_params: 134.266529126
    scale_params: 1082.66963718
    scale_params: 9757.61396442
