name: "ResNet-50"
layer {
  name: "data"
  type: "DummyData"
  top: "data"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 0.01
    }
    shape {
      dim: 64
      dim: 3
      dim: 224
      dim: 224
    }
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 0.789830446243
    scale_out: 8.12105941772
    scale_params: 15080.0996094
    scale_params: 99465.0859375
    scale_params: 173115.5625
    scale_params: 11128.5810547
    scale_params: 14022.6171875
    scale_params: 28568.96875
    scale_params: 153647.71875
    scale_params: 21552.6269531
    scale_params: 23374.9042969
    scale_params: 5475.21972656
    scale_params: 20287.5507812
    scale_params: 8116.69384766
    scale_params: 8731.93066406
    scale_params: 53525.2148438
    scale_params: 15007.5283203
    scale_params: 12752.8212891
    scale_params: 37056.203125
    scale_params: 58204.203125
    scale_params: 6236.59960938
    scale_params: 53042.1640625
    scale_params: 12115.5107422
    scale_params: 14664.6064453
    scale_params: 50204.875
    scale_params: 159775.84375
    scale_params: 13167.9726562
    scale_params: 41848.3125
    scale_params: 54796.9609375
    scale_params: 24042.1816406
    scale_params: 14904.6445312
    scale_params: 21783.1914062
    scale_params: 23500.7773438
    scale_params: 128000.28125
    scale_params: 7732.32763672
    scale_params: 36472.7929688
    scale_params: 31271.7519531
    scale_params: 250784.234375
    scale_params: 9309.20507812
    scale_params: 51890.1015625
    scale_params: 29751.0058594
    scale_params: 38078.7148438
    scale_params: 17506.2539062
    scale_params: 8578.92773438
    scale_params: 25078.3964844
    scale_params: 73881.96875
    scale_params: 10138.1269531
    scale_params: 81844.2109375
    scale_params: 17890.7109375
    scale_params: 17035.5859375
    scale_params: 33184.5117188
    scale_params: 10322.5791016
    scale_params: 76040.84375
    scale_params: 25666.6757812
    scale_params: 32228.9179688
    scale_params: 18662.8847656
    scale_params: 46139.2304688
    scale_params: 11391.8251953
    scale_params: 81166.40625
    scale_params: 9657.83007812
    scale_params: 54063.6953125
    scale_params: 8307.62109375
    scale_params: 8215.99316406
    scale_params: 68782.2421875
    scale_params: 91589.109375
    scale_params: 9809.52539062
    is_negative_input: true
  }
}
layer {
  name: "bn_conv1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  batch_norm_param {
  }
}
layer {
  name: "scale_conv1"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
  relu_param {
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "res2a_branch1"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch1"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 8.12105941772
    scale_out: 7.73090314865
    scale_params: 3828.66894531
    scale_params: 618.321228027
    scale_params: 587.330749512
    scale_params: 1369.48376465
    scale_params: 814.807434082
    scale_params: 1789.86340332
    scale_params: 920.71697998
    scale_params: 199.799423218
    scale_params: 1450.02331543
    scale_params: 575.434082031
    scale_params: 384.107727051
    scale_params: 3843.9753418
    scale_params: 577.203063965
    scale_params: 420.648864746
    scale_params: 234.671737671
    scale_params: 543.028076172
    scale_params: 573.451843262
    scale_params: 329.976257324
    scale_params: 514.514404297
    scale_params: 1706.61987305
    scale_params: 1049.72265625
    scale_params: 489.925231934
    scale_params: 273.531463623
    scale_params: 146.749908447
    scale_params: 261.734436035
    scale_params: 526.024902344
    scale_params: 537.212036133
    scale_params: 714.500671387
    scale_params: 238.242721558
    scale_params: 1328.52355957
    scale_params: 186.795394897
    scale_params: 3482.09008789
    scale_params: 563.324157715
    scale_params: 311.20526123
    scale_params: 272.513427734
    scale_params: 376.676452637
    scale_params: 1690.90429688
    scale_params: 371.645782471
    scale_params: 319.967376709
    scale_params: 1471.15222168
    scale_params: 177.70149231
    scale_params: 369.58996582
    scale_params: 305.294586182
    scale_params: 441.888916016
    scale_params: 1084.99304199
    scale_params: 550.773498535
    scale_params: 560.963134766
    scale_params: 521.900756836
    scale_params: 210.17338562
    scale_params: 236.662399292
    scale_params: 2190.15039062
    scale_params: 821.173461914
    scale_params: 775.838989258
    scale_params: 626.157287598
    scale_params: 412.893707275
    scale_params: 322.104705811
    scale_params: 409.800018311
    scale_params: 390.28527832
    scale_params: 1059.69628906
    scale_params: 340.560699463
    scale_params: 255.07824707
    scale_params: 1060.39343262
    scale_params: 716.245422363
    scale_params: 1808.01953125
    scale_params: 178.31817627
    scale_params: 385.139068604
    scale_params: 169.164382935
    scale_params: 443.104675293
    scale_params: 947.276306152
    scale_params: 295.337677002
    scale_params: 562.836914062
    scale_params: 1002.90093994
    scale_params: 3527.50610352
    scale_params: 399.81918335
    scale_params: 483.519104004
    scale_params: 8887.55175781
    scale_params: 1260.28149414
    scale_params: 117.425605774
    scale_params: 253.14465332
    scale_params: 123.947502136
    scale_params: 432.127075195
    scale_params: 1442.68371582
    scale_params: 1017.52185059
    scale_params: 244.547424316
    scale_params: 403.563659668
    scale_params: 499.992950439
    scale_params: 564.49420166
    scale_params: 246.912780762
    scale_params: 512.768066406
    scale_params: 967.212585449
    scale_params: 158.648254395
    scale_params: 420.730865479
    scale_params: 211.38633728
    scale_params: 416.336761475
    scale_params: 698.515136719
    scale_params: 314.289550781
    scale_params: 553.191345215
    scale_params: 1144.92443848
    scale_params: 544.803649902
    scale_params: 2448.44433594
    scale_params: 654.004760742
    scale_params: 666.644714355
    scale_params: 1038.1973877
    scale_params: 486.622131348
    scale_params: 1200.72338867
    scale_params: 95.9519882202
    scale_params: 260.665679932
    scale_params: 213.843002319
    scale_params: 365.15246582
    scale_params: 257.642883301
    scale_params: 659.51385498
    scale_params: 439.34564209
    scale_params: 779.766540527
    scale_params: 1673.7010498
    scale_params: 429.212890625
    scale_params: 537.288574219
    scale_params: 203.874450684
    scale_params: 801.684448242
    scale_params: 1464.76245117
    scale_params: 425.605194092
    scale_params: 272.120513916
    scale_params: 195.600418091
    scale_params: 1187.5994873
    scale_params: 109.027626038
    scale_params: 158.489196777
    scale_params: 506.32800293
    scale_params: 142.486099243
    scale_params: 414.021575928
    scale_params: 393.532440186
    scale_params: 318.269775391
    scale_params: 1301.23205566
    scale_params: 245.736206055
    scale_params: 206.509613037
    scale_params: 1103.89306641
    scale_params: 277131.71875
    scale_params: 788.98449707
    scale_params: 322.844787598
    scale_params: 560.177490234
    scale_params: 498.093780518
    scale_params: 772.19720459
    scale_params: 1337.73632812
    scale_params: 984.823364258
    scale_params: 589.082214355
    scale_params: 743.321594238
    scale_params: 1245.66796875
    scale_params: 212.157470703
    scale_params: 500.03024292
    scale_params: 103.530342102
    scale_params: 1093.62963867
    scale_params: 127.437927246
    scale_params: 789.333190918
    scale_params: 1030.48730469
    scale_params: 131.424163818
    scale_params: 1322.54785156
    scale_params: 746.349487305
    scale_params: 326.069732666
    scale_params: 5814.01025391
    scale_params: 5018.57666016
    scale_params: 375.912353516
    scale_params: 1040.49621582
    scale_params: 1152.6027832
    scale_params: 113.639846802
    scale_params: 342.281768799
    scale_params: 1272.02001953
    scale_params: 268.378631592
    scale_params: 353.730987549
    scale_params: 428.639007568
    scale_params: 427.328887939
    scale_params: 528.016235352
    scale_params: 271.881896973
    scale_params: 618.630554199
    scale_params: 363.260345459
    scale_params: 812.010375977
    scale_params: 333.443634033
    scale_params: 1090.98632812
    scale_params: 342.890258789
    scale_params: 549.105651855
    scale_params: 616.597961426
    scale_params: 425.660644531
    scale_params: 535.809753418
    scale_params: 220.588012695
    scale_params: 734.373413086
    scale_params: 1452.54162598
    scale_params: 2120.28930664
    scale_params: 209.975296021
    scale_params: 736.582824707
    scale_params: 165.243743896
    scale_params: 448.170440674
    scale_params: 120.57673645
    scale_params: 231.176269531
    scale_params: 577.932312012
    scale_params: 339.722930908
    scale_params: 764.042907715
    scale_params: 889.227478027
    scale_params: 1363.8223877
    scale_params: 451.16897583
    scale_params: 1019.57049561
    scale_params: 807.037414551
    scale_params: 6748.09863281
    scale_params: 352.978942871
    scale_params: 474.225799561
    scale_params: 205.063919067
    scale_params: 3108.5012207
    scale_params: 264.17401123
    scale_params: 248.80809021
    scale_params: 550.532470703
    scale_params: 431.087310791
    scale_params: 270.558410645
    scale_params: 905.743835449
    scale_params: 371.501831055
    scale_params: 7559.11914062
    scale_params: 795.854675293
    scale_params: 657.826599121
    scale_params: 751.862792969
    scale_params: 341.940582275
    scale_params: 438.733337402
    scale_params: 9547.5859375
    scale_params: 469.317138672
    scale_params: 619.888671875
    scale_params: 357.591552734
    scale_params: 410.894897461
    scale_params: 324.608642578
    scale_params: 398.42755127
    scale_params: 278.899932861
    scale_params: 456.298126221
    scale_params: 316.278015137
    scale_params: 268.126190186
    scale_params: 754.454650879
    scale_params: 255.755935669
    scale_params: 1370.49121094
    scale_params: 993.676025391
    scale_params: 319.8175354
    scale_params: 849.072631836
    scale_params: 3807.34008789
    scale_params: 2119.58227539
    scale_params: 313.335540771
    scale_params: 793.53894043
    scale_params: 527.812927246
    scale_params: 349.45880127
    scale_params: 549.562683105
    scale_params: 478.788604736
    scale_params: 1185.48901367
    scale_params: 586.456726074
    scale_params: 569.398803711
    scale_params: 524.88079834
    scale_params: 75.9232025146
    scale_params: 407.049591064
    scale_params: 347.98348999
    scale_params: 930.729553223
    scale_params: 297.369384766
    scale_params: 6495.53271484
    scale_params: 1748.1229248
    scale_params: 3387.83105469
    scale_params: 204.078979492
    scale_params: 142.479232788
    scale_params: 664.10748291
  }
}
layer {
  name: "bn2a_branch1"
  type: "BatchNorm"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  batch_norm_param {
  }
}
layer {
  name: "scale2a_branch1"
  type: "Scale"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 8.12105941772
    scale_out: 21.6193752289
    scale_params: 695.08380127
    scale_params: 411.19354248
    scale_params: 419.415222168
    scale_params: 593.304077148
    scale_params: 733.221862793
    scale_params: 373.226959229
    scale_params: 391.625335693
    scale_params: 822.532409668
    scale_params: 389.699951172
    scale_params: 649.979858398
    scale_params: 589.477416992
    scale_params: 400.722564697
    scale_params: 907.156555176
    scale_params: 321.363372803
    scale_params: 1182.46765137
    scale_params: 566.082458496
    scale_params: 449.189086914
    scale_params: 451.429992676
    scale_params: 299.026733398
    scale_params: 415.015075684
    scale_params: 535.050170898
    scale_params: 339.691558838
    scale_params: 301.874206543
    scale_params: 480.931060791
    scale_params: 373.453491211
    scale_params: 218.039138794
    scale_params: 365.197479248
    scale_params: 296.92175293
    scale_params: 345.503417969
    scale_params: 210.931610107
    scale_params: 482.314788818
    scale_params: 537.323791504
    scale_params: 266.434417725
    scale_params: 553.1875
    scale_params: 329.805084229
    scale_params: 566.149902344
    scale_params: 338.927276611
    scale_params: 556.954162598
    scale_params: 377.313812256
    scale_params: 224.813430786
    scale_params: 166.910369873
    scale_params: 206.882034302
    scale_params: 1631.98120117
    scale_params: 413.789154053
    scale_params: 298.516357422
    scale_params: 157.396240234
    scale_params: 374.282897949
    scale_params: 779.105895996
    scale_params: 510.992340088
    scale_params: 209.781188965
    scale_params: 535.766418457
    scale_params: 306.58203125
    scale_params: 216.153198242
    scale_params: 151.085357666
    scale_params: 508.375274658
    scale_params: 330.496368408
    scale_params: 601.443969727
    scale_params: 596.136962891
    scale_params: 153.200256348
    scale_params: 355.340759277
    scale_params: 530.736450195
    scale_params: 390.325317383
    scale_params: 296.371917725
    scale_params: 434.643035889
  }
}
layer {
  name: "bn2a_branch2a"
  type: "BatchNorm"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  batch_norm_param {
  }
}
layer {
  name: "scale2a_branch2a"
  type: "Scale"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a_relu"
  type: "ReLU"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  relu_param {
  }
}
layer {
  name: "res2a_branch2b"
  type: "Convolution"
  bottom: "res2a_branch2a"
  top: "res2a_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 21.6193752289
    scale_out: 20.5058460236
    scale_params: 1121.42102051
    scale_params: 708.39831543
    scale_params: 962.02355957
    scale_params: 1040.93664551
    scale_params: 773.380249023
    scale_params: 550.097229004
    scale_params: 937.491577148
    scale_params: 1531.5480957
    scale_params: 1760.12158203
    scale_params: 1492.20581055
    scale_params: 672.248596191
    scale_params: 1122.7253418
    scale_params: 510.655029297
    scale_params: 1296.98486328
    scale_params: 547.13684082
    scale_params: 1375.06481934
    scale_params: 1437.6217041
    scale_params: 1250.99047852
    scale_params: 424.72958374
    scale_params: 1660.33435059
    scale_params: 774.949768066
    scale_params: 832.550048828
    scale_params: 711.316650391
    scale_params: 939.714111328
    scale_params: 625.579467773
    scale_params: 416.323669434
    scale_params: 819.169006348
    scale_params: 1239.57714844
    scale_params: 1370.93115234
    scale_params: 2002.09863281
    scale_params: 778.046386719
    scale_params: 488.19329834
    scale_params: 970.938781738
    scale_params: 1279.6862793
    scale_params: 649.571960449
    scale_params: 977.585449219
    scale_params: 1374.99597168
    scale_params: 701.126281738
    scale_params: 1191.04187012
    scale_params: 823.521728516
    scale_params: 650.578857422
    scale_params: 2296.07519531
    scale_params: 750.90045166
    scale_params: 1421.80236816
    scale_params: 873.258300781
    scale_params: 780.386169434
    scale_params: 1610.42590332
    scale_params: 1084.50268555
    scale_params: 880.402893066
    scale_params: 532.145141602
    scale_params: 1174.31274414
    scale_params: 783.270202637
    scale_params: 1476.43249512
    scale_params: 1455.10827637
    scale_params: 945.98840332
    scale_params: 650.548156738
    scale_params: 2028.63684082
    scale_params: 1127.40795898
    scale_params: 661.008789062
    scale_params: 738.785522461
    scale_params: 885.248596191
    scale_params: 686.310668945
    scale_params: 1795.27514648
    scale_params: 815.777587891
  }
}
layer {
  name: "bn2a_branch2b"
  type: "BatchNorm"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  batch_norm_param {
  }
}
layer {
  name: "scale2a_branch2b"
  type: "Scale"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2b_relu"
  type: "ReLU"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  relu_param {
  }
}
layer {
  name: "res2a_branch2c"
  type: "Convolution"
  bottom: "res2a_branch2b"
  top: "res2a_branch2c"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 20.5058460236
    scale_out: 15.5226793289
    scale_params: 621.090393066
    scale_params: 612.051269531
    scale_params: 291.46697998
    scale_params: 526.05670166
    scale_params: 602.146606445
    scale_params: 548.633239746
    scale_params: 326.257751465
    scale_params: 248.807693481
    scale_params: 493.045898438
    scale_params: 937.873962402
    scale_params: 398.665618896
    scale_params: 1214.15136719
    scale_params: 366.340270996
    scale_params: 257.499206543
    scale_params: 771.894897461
    scale_params: 339.219482422
    scale_params: 613.40625
    scale_params: 217.525695801
    scale_params: 197.408935547
    scale_params: 425.230133057
    scale_params: 311.971160889
    scale_params: 568.343933105
    scale_params: 421.345855713
    scale_params: 196.585983276
    scale_params: 444.844055176
    scale_params: 389.483764648
    scale_params: 232.955978394
    scale_params: 982.776733398
    scale_params: 261.319244385
    scale_params: 773.660217285
    scale_params: 237.973846436
    scale_params: 2193.35131836
    scale_params: 271.213806152
    scale_params: 1386.41931152
    scale_params: 1790.66943359
    scale_params: 136.525375366
    scale_params: 1592.18310547
    scale_params: 500.280334473
    scale_params: 349.865783691
    scale_params: 759.824890137
    scale_params: 519.655761719
    scale_params: 195.854995728
    scale_params: 601.106140137
    scale_params: 630.411071777
    scale_params: 473.52230835
    scale_params: 131.739776611
    scale_params: 382.171875
    scale_params: 6148.69775391
    scale_params: 167.069213867
    scale_params: 247.891082764
    scale_params: 1551.43457031
    scale_params: 164.557693481
    scale_params: 404.029144287
    scale_params: 244.135910034
    scale_params: 269.903839111
    scale_params: 191.116821289
    scale_params: 130.417526245
    scale_params: 354.560058594
    scale_params: 297.049163818
    scale_params: 336.812561035
    scale_params: 334.866851807
    scale_params: 226.631408691
    scale_params: 171.004486084
    scale_params: 2042.4185791
    scale_params: 558.257568359
    scale_params: 180.317565918
    scale_params: 181.795806885
    scale_params: 283.473388672
    scale_params: 808.496643066
    scale_params: 742.463012695
    scale_params: 400.181060791
    scale_params: 810.904418945
    scale_params: 1557.78869629
    scale_params: 285.445831299
    scale_params: 644.141540527
    scale_params: 968.871643066
    scale_params: 443.2578125
    scale_params: 897.236572266
    scale_params: 465.059417725
    scale_params: 791.670654297
    scale_params: 507.785217285
    scale_params: 1005.61181641
    scale_params: 235.566146851
    scale_params: 267.268859863
    scale_params: 247.560333252
    scale_params: 987.586120605
    scale_params: 563.932312012
    scale_params: 382.896331787
    scale_params: 123.963790894
    scale_params: 879.996643066
    scale_params: 1379.16357422
    scale_params: 152.520095825
    scale_params: 337.446624756
    scale_params: 350.431549072
    scale_params: 540.73248291
    scale_params: 309.518157959
    scale_params: 476.305084229
    scale_params: 673.05255127
    scale_params: 386.694946289
    scale_params: 5247.37695312
    scale_params: 169.708694458
    scale_params: 1722.46826172
    scale_params: 1184.18774414
    scale_params: 245.766204834
    scale_params: 829.660217285
    scale_params: 156.56918335
    scale_params: 282.364593506
    scale_params: 151.227386475
    scale_params: 492.758148193
    scale_params: 788.917663574
    scale_params: 392.911010742
    scale_params: 454.713378906
    scale_params: 586.483093262
    scale_params: 772.264343262
    scale_params: 271.788818359
    scale_params: 573.316711426
    scale_params: 550.65411377
    scale_params: 731.298522949
    scale_params: 633.938659668
    scale_params: 474.619689941
    scale_params: 270.204650879
    scale_params: 263.278442383
    scale_params: 1527.12414551
    scale_params: 398.016967773
    scale_params: 537.20098877
    scale_params: 375.20211792
    scale_params: 250.597702026
    scale_params: 351.658935547
    scale_params: 613.259765625
    scale_params: 134.732925415
    scale_params: 838.722473145
    scale_params: 394.880279541
    scale_params: 330.914489746
    scale_params: 2011.99353027
    scale_params: 1018.08782959
    scale_params: 1681.28674316
    scale_params: 272.017913818
    scale_params: 278.02142334
    scale_params: 475.616119385
    scale_params: 790.315979004
    scale_params: 253.716445923
    scale_params: 661.830078125
    scale_params: 569.590942383
    scale_params: 347.275848389
    scale_params: 271.195373535
    scale_params: 404.130126953
    scale_params: 407.824981689
    scale_params: 971.409667969
    scale_params: 318.721740723
    scale_params: 685.844055176
    scale_params: 486.800628662
    scale_params: 585.727355957
    scale_params: 452.894683838
    scale_params: 1017.39471436
    scale_params: 225.926177979
    scale_params: 364.037200928
    scale_params: 1110.46691895
    scale_params: 917.610473633
    scale_params: 292.808654785
    scale_params: 306.593688965
    scale_params: 230.455871582
    scale_params: 279.88458252
    scale_params: 323.107513428
    scale_params: 438.104797363
    scale_params: 193.24647522
    scale_params: 237.107040405
    scale_params: 517.036132812
    scale_params: 385.173858643
    scale_params: 203.719390869
    scale_params: 235.506607056
    scale_params: 253.467086792
    scale_params: 176.221710205
    scale_params: 406.019836426
    scale_params: 4184.95458984
    scale_params: 6892.43847656
    scale_params: 580.018127441
    scale_params: 306.796600342
    scale_params: 728.452331543
    scale_params: 384.817199707
    scale_params: 129.378707886
    scale_params: 595.522338867
    scale_params: 350.931335449
    scale_params: 598.399780273
    scale_params: 1809.15148926
    scale_params: 647.939208984
    scale_params: 241.562454224
    scale_params: 325.12097168
    scale_params: 301.21887207
    scale_params: 331.800628662
    scale_params: 273.849487305
    scale_params: 1696.07336426
    scale_params: 198.569595337
    scale_params: 702.32244873
    scale_params: 242.835998535
    scale_params: 1068.01306152
    scale_params: 458.476837158
    scale_params: 349.436950684
    scale_params: 144.760162354
    scale_params: 436.306091309
    scale_params: 437.578948975
    scale_params: 417.562927246
    scale_params: 150.443023682
    scale_params: 760.946533203
    scale_params: 809.730712891
    scale_params: 61196.203125
    scale_params: 304.91583252
    scale_params: 263.790252686
    scale_params: 414.39654541
    scale_params: 521.952209473
    scale_params: 390.98236084
    scale_params: 8452.56152344
    scale_params: 686.904418945
    scale_params: 72.1709442139
    scale_params: 926.275695801
    scale_params: 231.477050781
    scale_params: 564.800292969
    scale_params: 4142.37304688
    scale_params: 353.029693604
    scale_params: 557.154968262
    scale_params: 312.292358398
    scale_params: 272.156982422
    scale_params: 355.890960693
    scale_params: 343.815338135
    scale_params: 1638.13439941
    scale_params: 478.391906738
    scale_params: 2612.11010742
    scale_params: 198.523254395
    scale_params: 447.50604248
    scale_params: 276.998596191
    scale_params: 312.614135742
    scale_params: 692.745178223
    scale_params: 160.575668335
    scale_params: 1311.4967041
    scale_params: 760.422058105
    scale_params: 133.688583374
    scale_params: 166.384246826
    scale_params: 213.436187744
    scale_params: 293.098419189
    scale_params: 171.74029541
    scale_params: 482.59664917
    scale_params: 281.916046143
    scale_params: 855.382568359
    scale_params: 241.103042603
    scale_params: 989.067443848
    scale_params: 498.119567871
    scale_params: 369.982513428
    scale_params: 313.772766113
    scale_params: 448.125183105
    scale_params: 248.348648071
    scale_params: 627.346374512
    scale_params: 4630.62402344
    scale_params: 1036.15893555
    scale_params: 2267.00512695
    scale_params: 521.396484375
    scale_params: 811.815979004
    scale_params: 1704.74377441
  }
}
layer {
  name: "bn2a_branch2c"
  type: "BatchNorm"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  batch_norm_param {
  }
}
layer {
  name: "scale2a_branch2c"
  type: "Scale"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a"
  type: "Eltwise"
  bottom: "res2a_branch1"
  bottom: "res2a_branch2c"
  top: "res2a"
  eltwise_param {
  }
}
layer {
  name: "res2a_relu"
  type: "ReLU"
  bottom: "res2a"
  top: "res2a"
  relu_param {
  }
}
layer {
  name: "res2b_branch2a"
  type: "Convolution"
  bottom: "res2a"
  top: "res2b_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 15.5226793289
    scale_out: 22.9968719482
    scale_params: 964.264221191
    scale_params: 1277.33459473
    scale_params: 968.994445801
    scale_params: 927.704284668
    scale_params: 502.546142578
    scale_params: 429.395965576
    scale_params: 192.331207275
    scale_params: 557.983520508
    scale_params: 552.422119141
    scale_params: 1092.6361084
    scale_params: 675.28338623
    scale_params: 1192.98120117
    scale_params: 538.356079102
    scale_params: 922.03894043
    scale_params: 479.451019287
    scale_params: 715.586975098
    scale_params: 450.345855713
    scale_params: 1016.08666992
    scale_params: 442.871551514
    scale_params: 738.142211914
    scale_params: 806.916687012
    scale_params: 1318.98449707
    scale_params: 967.868774414
    scale_params: 541.525939941
    scale_params: 576.480529785
    scale_params: 518.295898438
    scale_params: 448.535766602
    scale_params: 505.041503906
    scale_params: 474.382995605
    scale_params: 1037.92785645
    scale_params: 836.875366211
    scale_params: 775.871643066
    scale_params: 880.785522461
    scale_params: 689.926818848
    scale_params: 687.426940918
    scale_params: 721.564453125
    scale_params: 1184.24914551
    scale_params: 518.565551758
    scale_params: 659.561157227
    scale_params: 653.470825195
    scale_params: 1107.99389648
    scale_params: 485.771148682
    scale_params: 670.421813965
    scale_params: 858.461425781
    scale_params: 854.605712891
    scale_params: 762.585266113
    scale_params: 786.249694824
    scale_params: 829.166809082
    scale_params: 634.371398926
    scale_params: 963.096801758
    scale_params: 846.43951416
    scale_params: 758.942321777
    scale_params: 908.873596191
    scale_params: 437.289825439
    scale_params: 416.264221191
    scale_params: 679.067687988
    scale_params: 644.733886719
    scale_params: 834.652282715
    scale_params: 960.960021973
    scale_params: 604.071716309
    scale_params: 977.873413086
    scale_params: 823.914123535
    scale_params: 1231.15258789
    scale_params: 751.682373047
  }
}
layer {
  name: "bn2b_branch2a"
  type: "BatchNorm"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  batch_norm_param {
  }
}
layer {
  name: "scale2b_branch2a"
  type: "Scale"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2a_relu"
  type: "ReLU"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  relu_param {
  }
}
layer {
  name: "res2b_branch2b"
  type: "Convolution"
  bottom: "res2b_branch2a"
  top: "res2b_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 22.9968719482
    scale_out: 23.656047821
    scale_params: 879.38470459
    scale_params: 813.863647461
    scale_params: 786.770019531
    scale_params: 778.871643066
    scale_params: 574.137573242
    scale_params: 1499.5279541
    scale_params: 1155.15588379
    scale_params: 735.628601074
    scale_params: 834.884277344
    scale_params: 710.537109375
    scale_params: 531.454650879
    scale_params: 210.525314331
    scale_params: 370.405914307
    scale_params: 846.130126953
    scale_params: 504.001434326
    scale_params: 732.822265625
    scale_params: 544.336120605
    scale_params: 515.910339355
    scale_params: 366.80368042
    scale_params: 470.741699219
    scale_params: 427.822662354
    scale_params: 812.907470703
    scale_params: 616.242553711
    scale_params: 821.143676758
    scale_params: 1459.44030762
    scale_params: 309.803955078
    scale_params: 672.822692871
    scale_params: 1026.56945801
    scale_params: 1282.9276123
    scale_params: 900.625427246
    scale_params: 722.118041992
    scale_params: 833.294677734
    scale_params: 684.376525879
    scale_params: 854.776794434
    scale_params: 601.819824219
    scale_params: 507.819854736
    scale_params: 1026.98864746
    scale_params: 989.359619141
    scale_params: 744.581054688
    scale_params: 892.298156738
    scale_params: 1519.03552246
    scale_params: 1362.22717285
    scale_params: 876.055480957
    scale_params: 585.679626465
    scale_params: 992.335449219
    scale_params: 642.560546875
    scale_params: 624.418945312
    scale_params: 807.596740723
    scale_params: 588.686096191
    scale_params: 1028.02380371
    scale_params: 751.126403809
    scale_params: 782.350646973
    scale_params: 909.16784668
    scale_params: 872.613342285
    scale_params: 406.214233398
    scale_params: 698.381652832
    scale_params: 679.384155273
    scale_params: 1015.65588379
    scale_params: 504.497161865
    scale_params: 468.800750732
    scale_params: 362.435760498
    scale_params: 710.172058105
    scale_params: 1067.13415527
    scale_params: 1151.77331543
  }
}
layer {
  name: "bn2b_branch2b"
  type: "BatchNorm"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  batch_norm_param {
  }
}
layer {
  name: "scale2b_branch2b"
  type: "Scale"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2b_relu"
  type: "ReLU"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  relu_param {
  }
}
layer {
  name: "res2b_branch2c"
  type: "Convolution"
  bottom: "res2b_branch2b"
  top: "res2b_branch2c"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 23.656047821
    scale_out: 15.5226793289
    scale_params: 123.251464844
    scale_params: 758.057250977
    scale_params: 894.192504883
    scale_params: 257.051879883
    scale_params: 182.95300293
    scale_params: 275.763244629
    scale_params: 323.268585205
    scale_params: 330.634094238
    scale_params: 113.878311157
    scale_params: 238.027206421
    scale_params: 319.161376953
    scale_params: 260.935760498
    scale_params: 635.780517578
    scale_params: 376.436309814
    scale_params: 179816.03125
    scale_params: 156.157516479
    scale_params: 610.240905762
    scale_params: 1126.51086426
    scale_params: 476.771606445
    scale_params: 166.907974243
    scale_params: 124.790542603
    scale_params: 994.237548828
    scale_params: 783.399597168
    scale_params: 66579.921875
    scale_params: 10198.4150391
    scale_params: 1256125.5
    scale_params: 135712.0
    scale_params: 212.148223877
    scale_params: 3124.11303711
    scale_params: 209.612792969
    scale_params: 13438.3515625
    scale_params: 222.526855469
    scale_params: 353.989044189
    scale_params: 34190.1015625
    scale_params: 11976.0048828
    scale_params: 230.463470459
    scale_params: 776.19519043
    scale_params: 795.147216797
    scale_params: 880.334228516
    scale_params: 5296.21826172
    scale_params: 293318.625
    scale_params: 204.66418457
    scale_params: 334.205047607
    scale_params: 828.358154297
    scale_params: 183.393844604
    scale_params: 20299.1796875
    scale_params: 212.609848022
    scale_params: 317.822021484
    scale_params: 6849.76757812
    scale_params: 545.550109863
    scale_params: 245.005355835
    scale_params: 233.821151733
    scale_params: 224.913574219
    scale_params: 196.263336182
    scale_params: 511.504730225
    scale_params: 1496.33776855
    scale_params: 8881.30175781
    scale_params: 220.058700562
    scale_params: 165.536254883
    scale_params: 756.252502441
    scale_params: 453.156524658
    scale_params: 193.113327026
    scale_params: 332.988006592
    scale_params: 216.759429932
    scale_params: 38268.2460938
    scale_params: 636.922729492
    scale_params: 20656.5742188
    scale_params: 934.282104492
    scale_params: 119.044212341
    scale_params: 3033.63134766
    scale_params: 332.851379395
    scale_params: 133.050033569
    scale_params: 194.93560791
    scale_params: 516.72076416
    scale_params: 703.023620605
    scale_params: 554.428833008
    scale_params: 183.035140991
    scale_params: 55723.8632812
    scale_params: 713.191162109
    scale_params: 106029.9375
    scale_params: 307.933349609
    scale_params: 196.652740479
    scale_params: 239.893112183
    scale_params: 626.086425781
    scale_params: 229.410324097
    scale_params: 278.992980957
    scale_params: 1050.05871582
    scale_params: 1466.40966797
    scale_params: 343.995788574
    scale_params: 249.08303833
    scale_params: 25339.0449219
    scale_params: 1450.88757324
    scale_params: 55624.2929688
    scale_params: 299.328399658
    scale_params: 176.843521118
    scale_params: 296.5284729
    scale_params: 267.755126953
    scale_params: 133.808532715
    scale_params: 192.850219727
    scale_params: 287.418395996
    scale_params: 815.517578125
    scale_params: 229.368148804
    scale_params: 181.389801025
    scale_params: 268.031188965
    scale_params: 215.799911499
    scale_params: 316.962097168
    scale_params: 191.633117676
    scale_params: 1729.59985352
    scale_params: 746.549682617
    scale_params: 91732.1015625
    scale_params: 559.619812012
    scale_params: 594.38494873
    scale_params: 132.621444702
    scale_params: 185.080993652
    scale_params: 192.580947876
    scale_params: 197.183380127
    scale_params: 29150.8867188
    scale_params: 147.218811035
    scale_params: 164.779281616
    scale_params: 8098.87890625
    scale_params: 592.799621582
    scale_params: 322.585540771
    scale_params: 132.604187012
    scale_params: 28230.1640625
    scale_params: 3018.56176758
    scale_params: 264.489776611
    scale_params: 25531.609375
    scale_params: 1138.56262207
    scale_params: 228.043273926
    scale_params: 1057.76721191
    scale_params: 347.068054199
    scale_params: 4566.22949219
    scale_params: 678.826416016
    scale_params: 10211.7851562
    scale_params: 162.555206299
    scale_params: 4298.04052734
    scale_params: 542.018127441
    scale_params: 281.872894287
    scale_params: 452.731872559
    scale_params: 179.174407959
    scale_params: 173.613555908
    scale_params: 211.704177856
    scale_params: 258.09463501
    scale_params: 257.747375488
    scale_params: 255.953125
    scale_params: 73848.0
    scale_params: 202.040161133
    scale_params: 1594.93493652
    scale_params: 290.592559814
    scale_params: 547.295776367
    scale_params: 189.888717651
    scale_params: 209.62550354
    scale_params: 558.40234375
    scale_params: 192.54574585
    scale_params: 272.597229004
    scale_params: 1355.16357422
    scale_params: 132.130584717
    scale_params: 160.685882568
    scale_params: 31540.2480469
    scale_params: 633.87878418
    scale_params: 293.143585205
    scale_params: 19520.4472656
    scale_params: 424.576080322
    scale_params: 233.104232788
    scale_params: 892.198913574
    scale_params: 534.626525879
    scale_params: 164.689849854
    scale_params: 405.979034424
    scale_params: 252.759292603
    scale_params: 1844.56689453
    scale_params: 305.524993896
    scale_params: 301.203063965
    scale_params: 320.910247803
    scale_params: 71589.8828125
    scale_params: 454.876525879
    scale_params: 234.628723145
    scale_params: 862.80645752
    scale_params: 262.448944092
    scale_params: 199.428604126
    scale_params: 5689.91113281
    scale_params: 635.494445801
    scale_params: 145.843856812
    scale_params: 1899.17150879
    scale_params: 285.074432373
    scale_params: 46164.3945312
    scale_params: 1662.2677002
    scale_params: 15501.5820312
    scale_params: 19768.5488281
    scale_params: 113.282951355
    scale_params: 2265.09863281
    scale_params: 88.4599685669
    scale_params: 640.388183594
    scale_params: 163.891723633
    scale_params: 296.56817627
    scale_params: 113.891593933
    scale_params: 468.567657471
    scale_params: 147.010009766
    scale_params: 207.092041016
    scale_params: 287.324066162
    scale_params: 217.659622192
    scale_params: 312.535400391
    scale_params: 10175.0117188
    scale_params: 228.928329468
    scale_params: 236.72114563
    scale_params: 13981.6923828
    scale_params: 248.146789551
    scale_params: 760.727111816
    scale_params: 411.225372314
    scale_params: 203.599090576
    scale_params: 261.635192871
    scale_params: 177.627212524
    scale_params: 179.186569214
    scale_params: 2778.45214844
    scale_params: 177.201538086
    scale_params: 1522.91064453
    scale_params: 333.95489502
    scale_params: 162.267288208
    scale_params: 630.942443848
    scale_params: 161.441711426
    scale_params: 211.718383789
    scale_params: 515.928649902
    scale_params: 534.17980957
    scale_params: 394.761871338
    scale_params: 16959.65625
    scale_params: 630.161132812
    scale_params: 292.689758301
    scale_params: 28850.4335938
    scale_params: 194.378860474
    scale_params: 247.277679443
    scale_params: 336.626281738
    scale_params: 221.804504395
    scale_params: 8659.64550781
    scale_params: 195.895401001
    scale_params: 204.543289185
    scale_params: 226.660964966
    scale_params: 3218.79736328
    scale_params: 1004.20422363
    scale_params: 266.897460938
    scale_params: 470.571838379
    scale_params: 207.416213989
    scale_params: 277.75177002
    scale_params: 189.026779175
    scale_params: 166.358520508
    scale_params: 230.112518311
    scale_params: 410.493286133
    scale_params: 7752.32324219
    scale_params: 371.665649414
    scale_params: 287.46295166
    scale_params: 120.280441284
    scale_params: 226.370376587
    scale_params: 189.938751221
    scale_params: 343.507873535
    scale_params: 197.690170288
    scale_params: 792.86315918
    scale_params: 18814.0
    scale_params: 271.33984375
  }
}
layer {
  name: "bn2b_branch2c"
  type: "BatchNorm"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  batch_norm_param {
  }
}
layer {
  name: "scale2b_branch2c"
  type: "Scale"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b"
  type: "Eltwise"
  bottom: "res2a"
  bottom: "res2b_branch2c"
  top: "res2b"
  eltwise_param {
  }
}
layer {
  name: "res2b_relu"
  type: "ReLU"
  bottom: "res2b"
  top: "res2b"
  relu_param {
  }
}
layer {
  name: "res2c_branch2a"
  type: "Convolution"
  bottom: "res2b"
  top: "res2c_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 15.5226793289
    scale_out: 23.84375
    scale_params: 438.103088379
    scale_params: 495.962432861
    scale_params: 1222.39135742
    scale_params: 1140.3079834
    scale_params: 1216.84448242
    scale_params: 1179.60754395
    scale_params: 1018.7434082
    scale_params: 881.206848145
    scale_params: 1203.83483887
    scale_params: 1162.67370605
    scale_params: 821.485595703
    scale_params: 1243.66479492
    scale_params: 1042.43640137
    scale_params: 863.64453125
    scale_params: 1167.9284668
    scale_params: 995.71307373
    scale_params: 939.213439941
    scale_params: 1017.12194824
    scale_params: 824.498168945
    scale_params: 1136.38903809
    scale_params: 1190.42346191
    scale_params: 1071.87475586
    scale_params: 5229.68017578
    scale_params: 996.277526855
    scale_params: 655.676757812
    scale_params: 683.407165527
    scale_params: 1147.60583496
    scale_params: 1214.78259277
    scale_params: 1382.98620605
    scale_params: 659.1484375
    scale_params: 1073.58190918
    scale_params: 835.567321777
    scale_params: 360.362915039
    scale_params: 1339.77600098
    scale_params: 743.257751465
    scale_params: 1253.24389648
    scale_params: 582.460144043
    scale_params: 486.371429443
    scale_params: 1079.02148438
    scale_params: 451.607147217
    scale_params: 487.95135498
    scale_params: 732.40838623
    scale_params: 1296.71887207
    scale_params: 715.435668945
    scale_params: 927.776306152
    scale_params: 872.750854492
    scale_params: 1039.28259277
    scale_params: 1184.31652832
    scale_params: 443.182922363
    scale_params: 863.332458496
    scale_params: 605.917541504
    scale_params: 445.836853027
    scale_params: 842.971557617
    scale_params: 555.04699707
    scale_params: 565.340026855
    scale_params: 925.932250977
    scale_params: 748.753845215
    scale_params: 1177.86816406
    scale_params: 1162.24291992
    scale_params: 1352.59460449
    scale_params: 620.755554199
    scale_params: 1210.74682617
    scale_params: 893.121154785
    scale_params: 774.020629883
  }
}
layer {
  name: "bn2c_branch2a"
  type: "BatchNorm"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  batch_norm_param {
  }
}
layer {
  name: "scale2c_branch2a"
  type: "Scale"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2a_relu"
  type: "ReLU"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  relu_param {
  }
}
layer {
  name: "res2c_branch2b"
  type: "Convolution"
  bottom: "res2c_branch2a"
  top: "res2c_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 23.84375
    scale_out: 19.1301403046
    scale_params: 454.14465332
    scale_params: 1096.62463379
    scale_params: 414.497833252
    scale_params: 559.856140137
    scale_params: 431.014038086
    scale_params: 415.815734863
    scale_params: 545.617858887
    scale_params: 397.051544189
    scale_params: 568.197753906
    scale_params: 492.172027588
    scale_params: 465.658874512
    scale_params: 595.898803711
    scale_params: 479.412109375
    scale_params: 650.014404297
    scale_params: 730.622131348
    scale_params: 549.327575684
    scale_params: 671.557983398
    scale_params: 759.951782227
    scale_params: 311.12210083
    scale_params: 489.364990234
    scale_params: 378.984039307
    scale_params: 560.2578125
    scale_params: 513.625732422
    scale_params: 551.499694824
    scale_params: 582.075317383
    scale_params: 603.605651855
    scale_params: 606.445983887
    scale_params: 649.066894531
    scale_params: 562.489929199
    scale_params: 477.643280029
    scale_params: 700.863830566
    scale_params: 454.503112793
    scale_params: 410.219207764
    scale_params: 484.011993408
    scale_params: 576.02557373
    scale_params: 524.321228027
    scale_params: 474.664581299
    scale_params: 623.352233887
    scale_params: 655.85168457
    scale_params: 546.806945801
    scale_params: 672.939575195
    scale_params: 520.07611084
    scale_params: 525.962097168
    scale_params: 714.261413574
    scale_params: 602.933105469
    scale_params: 692.955566406
    scale_params: 771.766723633
    scale_params: 308.029266357
    scale_params: 399.389678955
    scale_params: 974.74407959
    scale_params: 712.403198242
    scale_params: 349.016326904
    scale_params: 511.444000244
    scale_params: 438.249420166
    scale_params: 593.142700195
    scale_params: 705.829772949
    scale_params: 643.488037109
    scale_params: 649.693237305
    scale_params: 462.622802734
    scale_params: 497.816619873
    scale_params: 928.61907959
    scale_params: 624.256774902
    scale_params: 448.844787598
    scale_params: 559.186340332
  }
}
layer {
  name: "bn2c_branch2b"
  type: "BatchNorm"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  batch_norm_param {
  }
}
layer {
  name: "scale2c_branch2b"
  type: "Scale"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2b_relu"
  type: "ReLU"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  relu_param {
  }
}
layer {
  name: "res2c_branch2c"
  type: "Convolution"
  bottom: "res2c_branch2b"
  top: "res2c_branch2c"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 19.1301403046
    scale_out: 14.8084812164
    scale_params: 223.855163574
    scale_params: 185.73487854
    scale_params: 961.32824707
    scale_params: 319.056640625
    scale_params: 572.575927734
    scale_params: 52988.71875
    scale_params: 987.832702637
    scale_params: 214.773696899
    scale_params: 382.869018555
    scale_params: 305.924133301
    scale_params: 723.54675293
    scale_params: 150.115875244
    scale_params: 479.208862305
    scale_params: 6076.55712891
    scale_params: 106797.765625
    scale_params: 785.684997559
    scale_params: 253.171432495
    scale_params: 736.968994141
    scale_params: 474.448181152
    scale_params: 364.12701416
    scale_params: 278.292480469
    scale_params: 4092.59057617
    scale_params: 225.450592041
    scale_params: 23934.03125
    scale_params: 70101.9921875
    scale_params: 218193.75
    scale_params: 120513.460938
    scale_params: 314.720611572
    scale_params: 3708.02416992
    scale_params: 352.610809326
    scale_params: 40917.4023438
    scale_params: 340.254852295
    scale_params: 527.43145752
    scale_params: 88240.25
    scale_params: 72343.0390625
    scale_params: 5583.79345703
    scale_params: 226623.625
    scale_params: 13381.6279297
    scale_params: 298.04989624
    scale_params: 393298.90625
    scale_params: 726225.9375
    scale_params: 335.907440186
    scale_params: 179.571228027
    scale_params: 991.196350098
    scale_params: 274.757415771
    scale_params: 61464.4140625
    scale_params: 192.313201904
    scale_params: 2324.82617188
    scale_params: 114211.398438
    scale_params: 4279.78271484
    scale_params: 283.518218994
    scale_params: 188.234298706
    scale_params: 416.285247803
    scale_params: 391.935424805
