layer {
  name: "data"
  type: "DummyData"
  top: "data"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 0.01
    }
    shape {
      dim: 1
      dim: 3
      dim: 224
      dim: 224
    }
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 3
    kernel_size: 7
    stride: 2
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 48.3166708632
    scale_out: 45.4193208221
    scale_params: 3731.50386577
    scale_params: 798.764624096
    scale_params: 1912.7195258
    scale_params: 115143.452884
    scale_params: 7661.44040633
    scale_params: 707.092392725
    scale_params: 12415.6686058
    scale_params: 5856.51132108
    scale_params: 7816.13299434
    scale_params: 1748.2638753
    scale_params: 9326.11106987
    scale_params: 844.327237141
    scale_params: 1830.93204747
    scale_params: 2261.29509297
    scale_params: 2816.52358866
    scale_params: 3.63752129674e+15
    scale_params: 1455.73653619
    scale_params: 765.967048274
    scale_params: 527832890.416
    scale_params: 782.396277177
    scale_params: 3727.31352877
    scale_params: 3289.54861978
    scale_params: 780.986903197
    scale_params: 6701.87712464
    scale_params: 8005.43825623
    scale_params: 2031.26847672
    scale_params: 2194.87765856
    scale_params: 2361.67172757
    scale_params: 8468.75747518
    scale_params: 4872.9254105
    scale_params: 8286.08955985
    scale_params: 7.05449259151e+14
    scale_params: 923.057748767
    scale_params: 712.337883235
    scale_params: 870.407592341
    scale_params: 14349.8402434
    scale_params: 4621.92033953
    scale_params: 508.737913677
    scale_params: 1124.03575042
    scale_params: 1098.02848491
    scale_params: 1983.57592733
    scale_params: 3243.73453773
    scale_params: 809.258736695
    scale_params: 782.697479537
    scale_params: 1880.55085579
    scale_params: 40902.5026999
    scale_params: 891.478660817
    scale_params: 1920.68980563
    scale_params: 731.334225973
    scale_params: 829.109057552
    scale_params: 2944.32475775
    scale_params: 1537.88529285
    scale_params: 541.108636239
    scale_params: 3922.6837302
    scale_params: 1624.44709022
    scale_params: 10422.3848348
    scale_params: 7240.74425209
    scale_params: 57962.714239
    scale_params: 713.987242296
    scale_params: 769.73475516
    scale_params: 1160.84118209
    scale_params: 2692.71193214
    scale_params: 4172.19312171
    scale_params: 7022.99565399
    is_negative_input: true
  }
}
layer {
  name: "conv1_bn"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv1_scale"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 1
  }
}
layer {
  name: "resx1_conv1"
  type: "Convolution"
  bottom: "pool1"
  top: "resx1_conv1"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 45.4193208221
    scale_out: 115.925809911
    scale_params: 1.22526346782e+11
    scale_params: 3.95926466911e+13
    scale_params: 710.875324365
    scale_params: 1158.92023466
    scale_params: 606.721291541
    scale_params: 495.133080296
    scale_params: 783.888821818
    scale_params: 500.673201457
    scale_params: 558.663980376
    scale_params: 750.733217715
    scale_params: 4.03729601949e+14
    scale_params: 535.766776827
    scale_params: 51579002.5382
    scale_params: 931.664588206
    scale_params: 5.42141363088e+14
    scale_params: 606.462470995
    scale_params: 431.64025374
    scale_params: 571.635611365
    scale_params: 1181.49776972
    scale_params: 530.001821308
    scale_params: 393.020940148
    scale_params: 402.771820916
    scale_params: 358.840680827
    scale_params: 568.37215553
    scale_params: 2.59476110241e+15
    scale_params: 785.587092771
    scale_params: 762697790.187
    scale_params: 892.048395376
    scale_params: 342.965361279
    scale_params: 1072.2913431
    scale_params: 493.862817946
    scale_params: 1123295.63504
    scale_params: 561.705365771
    scale_params: 411.763891312
    scale_params: 324357.228032
    scale_params: 662.160011834
    scale_params: 22674.7522306
    scale_params: 1.90714950928e+15
    scale_params: 471.539350357
    scale_params: 929.796549851
    scale_params: 1428.25985074
    scale_params: 2.746449244e+11
    scale_params: 43372312899.2
    scale_params: 944.477142366
    scale_params: 799.655335967
    scale_params: 1171.32311065
    scale_params: 501.747629734
    scale_params: 1.87526839235e+13
    scale_params: 2.7028898069e+14
    scale_params: 1660.42393752
    scale_params: 1049.6012595
    scale_params: 138771677.186
    scale_params: 6.68972467606e+13
    scale_params: 849.632399422
    scale_params: 2587.54983818
    scale_params: 924.306674803
    scale_params: 1250.4635566
    scale_params: 445.280325344
    scale_params: 4.21465826178e+15
    scale_params: 3.24218062536e+15
    scale_params: 457.686209976
    scale_params: 1.17244736923e+13
    scale_params: 1439.57689931
    scale_params: 472.272327889
    scale_params: 1600.67133187
    scale_params: 1943.36019343
    scale_params: 569.582644235
    scale_params: 1006.58667287
    scale_params: 666.684897531
    scale_params: 336.29279655
    scale_params: 694.148357759
    scale_params: 354.641101027
    scale_params: 3643.37566448
    scale_params: 491.834885062
    scale_params: 1939.40299345
    scale_params: 4.06252497331e+11
    scale_params: 12104.1491917
    scale_params: 634.775483745
    scale_params: 416.41939269
    scale_params: 690.922803142
    scale_params: 511.269621146
    scale_params: 496.863494705
    scale_params: 436.092525345
    scale_params: 1.07142703487e+14
    scale_params: 449.594187345
    scale_params: 507.793156478
    scale_params: 704.337065275
    scale_params: 915.721171545
    scale_params: 900.57024898
    scale_params: 710.81734056
    scale_params: 816.648601083
    scale_params: 405.962707065
    scale_params: 452.386536558
    scale_params: 2.02312817131e+14
    scale_params: 2146.0546122
    scale_params: 485322.20609
    scale_params: 1708.35359052
    scale_params: 3214.52276175
    scale_params: 1.0097263999e+13
    scale_params: 241540.294832
    scale_params: 2170.52926814
    scale_params: 552.339085455
    scale_params: 783.058192621
    scale_params: 239.919426411
    scale_params: 331.292249196
    scale_params: 453.881623463
    scale_params: 341.820823189
    scale_params: 9.00888260123e+14
    scale_params: 376.412823649
    scale_params: 405.635248259
    scale_params: 491.448558416
    scale_params: 694.604219739
    scale_params: 36388421.9941
    scale_params: 1.91827390937e+11
    scale_params: 270516.784449
    scale_params: 3079.93317388
    scale_params: 693.119638735
    scale_params: 881.306644521
    scale_params: 2.58521406541e+15
    scale_params: 426.927387799
    scale_params: 460.686011227
    scale_params: 412.964577836
    scale_params: 1130.30828924
    scale_params: 400.466234739
    scale_params: 220.550092316
    scale_params: 1661.92659079
    scale_params: 5620649445.48
    scale_params: 340158266.633
  }
}
layer {
  name: "resx1_conv1_bn"
  type: "BatchNorm"
  bottom: "resx1_conv1"
  top: "resx1_conv1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "resx1_conv1_scale"
  type: "Scale"
  bottom: "resx1_conv1"
  top: "resx1_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "resx1_conv1_relu"
  type: "ReLU"
  bottom: "resx1_conv1"
  top: "resx1_conv1"
}
layer {
  name: "resx1_conv2"
  type: "Convolution"
  bottom: "resx1_conv1"
  top: "resx1_conv2"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 32
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 115.925809911
    scale_out: 60.9560006707
    scale_params: 62.5236346665
    scale_params: 205.402396608
    scale_params: 49.9189526886
    scale_params: 133.018990187
    scale_params: 53.7162126621
    scale_params: 155.018281145
    scale_params: 136.789148577
    scale_params: 216.301780832
    scale_params: 117.490655532
    scale_params: 82.1560356147
    scale_params: 165.698166928
    scale_params: 106.161812495
    scale_params: 3.88989416452e+11
    scale_params: 109.273452052
    scale_params: 35.2054512355
    scale_params: 50.7669663417
    scale_params: 196.103512375
    scale_params: 65.551291
    scale_params: 100.077867269
    scale_params: 119.923429344
    scale_params: 123.67284021
    scale_params: 74.7666556109
    scale_params: 206.571551033
    scale_params: 163.976112984
    scale_params: 82.3907017386
    scale_params: 87.8869065115
    scale_params: 597.447748051
    scale_params: 113273.125697
    scale_params: 86.2206012191
    scale_params: 325.449069253
    scale_params: 255.710112712
    scale_params: 41.1001344937
    scale_params: 104.453439212
    scale_params: 96.2845767099
    scale_params: 303.428946368
    scale_params: 91.6359722853
    scale_params: 42.6565189823
    scale_params: 40.2645108271
    scale_params: 267.563779556
    scale_params: 1528.01891031
    scale_params: 68.3905129834
    scale_params: 62.9094900894
    scale_params: 640.151912666
    scale_params: 198.98293031
    scale_params: 281.632814016
    scale_params: 48.5103612465
    scale_params: 66.0275265191
    scale_params: 179.060876733
    scale_params: 118.359020873
    scale_params: 110.245695609
    scale_params: 175.809781767
    scale_params: 62.9679712181
    scale_params: 246.097862269
    scale_params: 103.72814749
    scale_params: 105.17316089
    scale_params: 144.321340007
    scale_params: 84.7933892954
    scale_params: 78.7835137483
    scale_params: 160.00656275
    scale_params: 32.0047354909
    scale_params: 127.303005631
    scale_params: 76.2442835567
    scale_params: 34.3946627367
    scale_params: 146.680861217
    scale_params: 548.791457558
    scale_params: 85.9488316568
    scale_params: 80.9664059021
    scale_params: 73.4928182344
    scale_params: 124.971358905
    scale_params: 449.885287094
    scale_params: 134.333826274
    scale_params: 73.7674714511
    scale_params: 353.591109054
    scale_params: 80.9516342514
    scale_params: 101.840972172
    scale_params: 120.963180797
    scale_params: 48.7857259171
    scale_params: 87.2563031811
    scale_params: 357.335481779
    scale_params: 95.7048101911
    scale_params: 74.1057439549
    scale_params: 68.6716756089
    scale_params: 108.680766883
    scale_params: 132.307433684
    scale_params: 135.395536974
    scale_params: 116.789357078
    scale_params: 197.590916354
    scale_params: 303.505556512
    scale_params: 194.0251712
    scale_params: 101.495936698
    scale_params: 91.5062995159
    scale_params: 228.294214607
    scale_params: 89.6064876127
    scale_params: 35.343545658
    scale_params: 106.226415184
    scale_params: 96.4384563191
    scale_params: 102.381892966
    scale_params: 11357.7120839
    scale_params: 67.0659755725
    scale_params: 64.9249165883
    scale_params: 152.954582454
    scale_params: 66.5375879869
    scale_params: 58.6237751142
    scale_params: 155.72129371
    scale_params: 145.309556569
    scale_params: 63.6119422305
    scale_params: 166.602244929
    scale_params: 110.286758786
    scale_params: 194.889980561
    scale_params: 369.897646451
    scale_params: 221.966390221
    scale_params: 3.01568042031e+11
    scale_params: 56.8353158814
    scale_params: 286.751362879
    scale_params: 67.5634479014
    scale_params: 37.8218975469
    scale_params: 45.8848562558
    scale_params: 127.693273377
    scale_params: 81.0440625505
    scale_params: 77.667788892
    scale_params: 120.406213749
    scale_params: 149.004409348
    scale_params: 127.06060994
    scale_params: 202.979999952
    scale_params: 38.4940489865
    scale_params: 223.863576328
    scale_params: 264.240564221
    scale_params: 92.4432936492
  }
}
layer {
  name: "resx1_conv2_bn"
  type: "BatchNorm"
  bottom: "resx1_conv2"
  top: "resx1_conv2"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "resx1_conv2_scale"
  type: "Scale"
  bottom: "resx1_conv2"
  top: "resx1_conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "resx1_conv2_relu"
  type: "ReLU"
  bottom: "resx1_conv2"
  top: "resx1_conv2"
}
layer {
  name: "resx1_conv3"
  type: "Convolution"
  bottom: "resx1_conv2"
  top: "resx1_conv3"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 60.9560006707
    scale_out: 32.5589744285
    scale_params: 506.596934488
    scale_params: 134.461240483
    scale_params: 295.435445602
    scale_params: 328.913933084
    scale_params: 190.627223314
    scale_params: 3.32718999934e+13
    scale_params: 560.152361404
    scale_params: 320.394311022
    scale_params: 326.1880898
    scale_params: 187.254995414
    scale_params: 301.410335258
    scale_params: 553.939290704
    scale_params: 522.90816065
    scale_params: 389.488010809
    scale_params: 3.90573600762e+11
    scale_params: 274.548328581
    scale_params: 242.44964915
    scale_params: 225.499188843
    scale_params: 300.036489802
    scale_params: 5.56704188584e+11
    scale_params: 439.744610012
    scale_params: 343.616909345
    scale_params: 558.070781822
    scale_params: 107.285980146
    scale_params: 476.688420838
    scale_params: 570.761832818
    scale_params: 209.940989881
    scale_params: 239.19281923
    scale_params: 677.25136075
    scale_params: 1020.28719439
    scale_params: 449.051583873
    scale_params: 629.202621489
    scale_params: 285.920057358
    scale_params: 291.712016885
    scale_params: 835738852.752
    scale_params: 1984.27580671
    scale_params: 241.125034615
    scale_params: 2.07565124336e+14
    scale_params: 181.105288179
    scale_params: 376.217223252
    scale_params: 651.364452473
    scale_params: 4.5278845025e+13
    scale_params: 31501658459.4
    scale_params: 262.772756885
    scale_params: 1.15007122965e+14
    scale_params: 562.820054106
    scale_params: 986.713163574
    scale_params: 590.245951785
    scale_params: 376.696282975
    scale_params: 219739143.288
    scale_params: 2127.69441459
    scale_params: 458.065029257
    scale_params: 262.429644077
    scale_params: 393.588124303
    scale_params: 32661343573.4
    scale_params: 826.204902232
    scale_params: 380.921725533
    scale_params: 665.704557822
    scale_params: 238.873575754
    scale_params: 325.779203799
    scale_params: 660.596136684
    scale_params: 394.494978151
    scale_params: 217.736452316
    scale_params: 726.225820034
    scale_params: 764.502269333
    scale_params: 292.488011899
    scale_params: 118482723.528
    scale_params: 3364347.02117
    scale_params: 417.746503317
    scale_params: 332.46011111
    scale_params: 525.667910601
    scale_params: 664.591965719
    scale_params: 6.23846937642e+12
    scale_params: 694.846990553
    scale_params: 1385.47287084
    scale_params: 147.259736723
    scale_params: 775.228785216
    scale_params: 377.40611739
    scale_params: 145.679576868
    scale_params: 846.782466642
    scale_params: 4.18899198864e+13
    scale_params: 359.204831103
    scale_params: 2.62002600655e+13
    scale_params: 335.279185445
    scale_params: 409.110231998
    scale_params: 639.712888764
    scale_params: 389.137962936
    scale_params: 635.004532443
    scale_params: 554.071309779
    scale_params: 110.09163366
    scale_params: 404.392069901
    scale_params: 368.196921771
    scale_params: 412.987950565
    scale_params: 1.90604355898e+12
    scale_params: 391.666380735
    scale_params: 317.662047782
    scale_params: 539.582112426
    scale_params: 247.775202623
    scale_params: 402.812215532
    scale_params: 118.528668642
    scale_params: 353.837848197
    scale_params: 623.11947959
    scale_params: 454.865982203
    scale_params: 1156.4494888
    scale_params: 293.336884148
    scale_params: 453.348111979
    scale_params: 375.360194517
    scale_params: 228.197343036
    scale_params: 183.460392668
    scale_params: 712.55287743
    scale_params: 83.251571917
    scale_params: 1635266229.04
    scale_params: 259.69203813
    scale_params: 48970904880.3
    scale_params: 1.67506516927e+13
    scale_params: 938.61910459
    scale_params: 613.010570494
    scale_params: 418.711584306
    scale_params: 406.280120212
    scale_params: 854.53127184
    scale_params: 338.772932749
    scale_params: 9274596.16681
    scale_params: 206.328628309
    scale_params: 2857262686.14
    scale_params: 71989250731.1
    scale_params: 300.245179809
    scale_params: 928.342510166
    scale_params: 7.10593086677e+12
    scale_params: 192.497910283
    scale_params: 542.904902431
    scale_params: 399.114266086
    scale_params: 425.424106441
    scale_params: 187909889.991
    scale_params: 778.085435033
    scale_params: 518.80720528
    scale_params: 994.142653468
    scale_params: 914.185942553
    scale_params: 430.805401074
    scale_params: 725.462203521
    scale_params: 153.901435627
    scale_params: 310.973064869
    scale_params: 285.392116226
    scale_params: 153.510181735
    scale_params: 205.952353207
    scale_params: 652.179641326
    scale_params: 411.416325825
    scale_params: 169.762579459
    scale_params: 5009739528.99
    scale_params: 405.421877036
    scale_params: 902.163461219
    scale_params: 295.879074183
    scale_params: 543.523260088
    scale_params: 465.247426183
    scale_params: 9703165937.01
    scale_params: 6.64736696957e+11
    scale_params: 218.465652488
    scale_params: 353.372373618
    scale_params: 1369.29558608
    scale_params: 4.18641513524e+13
    scale_params: 249.871579507
    scale_params: 590.039348392
    scale_params: 688.715471947
    scale_params: 591.403081882
    scale_params: 1239.31465182
    scale_params: 337.004184979
    scale_params: 250.501504921
    scale_params: 450.574642603
    scale_params: 52092746304.6
    scale_params: 792.65479852
    scale_params: 503.393693459
    scale_params: 453.791240473
    scale_params: 149.113880615
    scale_params: 220.242032104
    scale_params: 412.649784234
    scale_params: 470.016634175
    scale_params: 670.900840591
    scale_params: 488.726810978
    scale_params: 501.97038909
    scale_params: 202.314434441
    scale_params: 532.064002809
    scale_params: 789608400.044
    scale_params: 1473.54905106
    scale_params: 9088.30700615
    scale_params: 424.192208043
    scale_params: 169.589289204
    scale_params: 251.795746252
    scale_params: 267.364834572
    scale_params: 1258.29116904
    scale_params: 1929.77532998
    scale_params: 4.83763767562e+12
    scale_params: 2528.18349001
    scale_params: 162.89810753
    scale_params: 453.964739913
    scale_params: 613.765370768
    scale_params: 242.030926295
    scale_params: 225.337903462
    scale_params: 1.37073957896e+13
    scale_params: 1.21583655894e+15
    scale_params: 207.795099651
    scale_params: 1053.78424566
    scale_params: 719.392929684
    scale_params: 1113.46855853
    scale_params: 171.730521476
    scale_params: 401.770263792
    scale_params: 539.40357744
    scale_params: 603.782529282
    scale_params: 475.0449821
    scale_params: 659.301369778
    scale_params: 466.060689418
    scale_params: 459.522369918
    scale_params: 18517046207.4
    scale_params: 376.190686983
    scale_params: 2925.79609139
    scale_params: 278.229702364
    scale_params: 473.597088055
    scale_params: 2419.82328881
    scale_params: 497.947158914
    scale_params: 750.132261859
    scale_params: 692.296235741
    scale_params: 260.017712197
    scale_params: 443.623605444
    scale_params: 621311903.764
    scale_params: 446.879441909
    scale_params: 12016108.9727
    scale_params: 620967.816321
    scale_params: 144.285003973
    scale_params: 1431.19778204
    scale_params: 402.996206756
    scale_params: 703.239069044
    scale_params: 256.829620694
    scale_params: 29069989141.4
    scale_params: 501.198226865
    scale_params: 361.279419377
    scale_params: 18984567.4368
    scale_params: 458.441862219
    scale_params: 394568568.618
    scale_params: 14155166118.8
    scale_params: 282.771742898
    scale_params: 778.184185891
    scale_params: 319.922480106
    scale_params: 621.823248727
    scale_params: 296.624995206
    scale_params: 636.89581022
    scale_params: 318.951006882
    scale_params: 1031.75226883
    scale_params: 224119702.468
    scale_params: 633.071735187
    scale_params: 295.210929214
    scale_params: 514.005301183
    scale_params: 329.993031712
    scale_params: 1222.130745
    scale_params: 419.069612411
    scale_params: 3.93341890742e+12
    scale_params: 194.18084692
    scale_params: 212.514725928
    scale_params: 308.541139588
  }
}
layer {
  name: "resx1_conv3_bn"
  type: "BatchNorm"
  bottom: "resx1_conv3"
  top: "resx1_conv3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "resx1_conv3_scale"
  type: "Scale"
  bottom: "resx1_conv3"
  top: "resx1_conv3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "resx1_match_conv"
  type: "Convolution"
  bottom: "pool1"
  top: "resx1_match_conv"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 45.4193208221
    scale_out: 65.3743187345
    scale_params: 621.982304486
    scale_params: 156945.776116
    scale_params: 313.028247456
    scale_params: 2074.97632871
    scale_params: 50290.8871987
    scale_params: 3.51030869821e+13
    scale_params: 544.527361158
    scale_params: 235.275549603
    scale_params: 368.607195439
    scale_params: 183.530208187
    scale_params: 420.847238562
    scale_params: 925.931135301
    scale_params: 1013.7338865
    scale_params: 1282.64652395
    scale_params: 5.73951814592e+11
    scale_params: 584.747294743
    scale_params: 1765.57658669
    scale_params: 371.725829171
    scale_params: 207.865645855
    scale_params: 1.94439064758e+12
    scale_params: 223.697340627
    scale_params: 299.224245475
    scale_params: 606.688424848
    scale_params: 17212.8234734
    scale_params: 408.507214616
    scale_params: 367.668850206
    scale_params: 302.104920991
    scale_params: 2206504.66153
    scale_params: 1528.72754067
    scale_params: 575.318146235
    scale_params: 1238.07091853
    scale_params: 586.221210692
    scale_params: 2286.46822115
    scale_params: 366.056828403
    scale_params: 2878171986.54
    scale_params: 488.325427682
    scale_params: 8260.1543679
    scale_params: 2.24661722596e+14
    scale_params: 10813.4547071
    scale_params: 219.399236105
    scale_params: 1437.81398679
    scale_params: 1.10008887039e+14
    scale_params: 1.11535127456e+11
    scale_params: 11444.9024583
    scale_params: 4.7151067997e+12
    scale_params: 1213.46426543
    scale_params: 673.407920508
    scale_params: 759.357626089
    scale_params: 443.017644866
    scale_params: 255201022.679
    scale_params: 1785.52813327
    scale_params: 694.640621717
    scale_params: 2749.94862995
    scale_params: 423.9284646
    scale_params: 2264745742.32
    scale_params: 497.006396777
    scale_params: 401.204991934
    scale_params: 1321.31004888
    scale_params: 6348.75196332
    scale_params: 410.761948294
    scale_params: 20732.3096269
    scale_params: 16231.0109308
    scale_params: 219.774535751
    scale_params: 182.957817304
    scale_params: 948.899733436
    scale_params: 175.625307871
    scale_params: 284920659.093
    scale_params: 303056.84861
    scale_params: 1765.84966455
    scale_params: 454.954705271
    scale_params: 300.092016298
    scale_params: 987.944549713
    scale_params: 6.55690992706e+12
    scale_params: 1144.01205271
    scale_params: 508.006600942
    scale_params: 383.442647001
    scale_params: 171.497973735
    scale_params: 826.62953059
    scale_params: 993.650408848
    scale_params: 684.063602924
    scale_params: 1.16117379303e+13
    scale_params: 272.947750846
    scale_params: 6.40638225038e+12
    scale_params: 352.651120405
    scale_params: 2111.75854646
    scale_params: 421.208763298
    scale_params: 443.489163303
    scale_params: 484.870056833
    scale_params: 670.178779959
    scale_params: 34994.937822
    scale_params: 417.129168991
    scale_params: 380.3356397
    scale_params: 2251.37908453
    scale_params: 1.85041703882e+11
    scale_params: 2063.44246354
    scale_params: 397.431769227
    scale_params: 295.022513208
    scale_params: 1303.1536762
    scale_params: 2909.3658296
    scale_params: 21853.2364539
    scale_params: 480.041984566
    scale_params: 277.083227906
    scale_params: 788.750312619
    scale_params: 425.416631709
    scale_params: 3773.35237448
    scale_params: 464.732992977
    scale_params: 470.003518785
    scale_params: 13910.4385658
    scale_params: 328.990162441
    scale_params: 3097.85531124
    scale_params: 3993.17109645
    scale_params: 104883730.132
    scale_params: 25787.1189126
    scale_params: 58397411358.9
    scale_params: 2.97201714114e+13
    scale_params: 541.178934952
    scale_params: 8034.64473144
    scale_params: 564.603974713
    scale_params: 345.251654754
    scale_params: 284.995403398
    scale_params: 410.969643367
    scale_params: 5040679.66585
    scale_params: 2221.05882747
    scale_params: 18045861397.8
    scale_params: 94792054683.1
    scale_params: 640.230776853
    scale_params: 1119.24191616
    scale_params: 6.97399089725e+12
    scale_params: 275.915860873
    scale_params: 15906.3065755
    scale_params: 442.623478168
    scale_params: 687.711104754
    scale_params: 43547388.0514
    scale_params: 244.592782658
    scale_params: 624.685981535
    scale_params: 1432.87499528
    scale_params: 1642.86362363
    scale_params: 1142.50439564
    scale_params: 1006.33161519
    scale_params: 91398.3989623
    scale_params: 8350.12121467
    scale_params: 184.235741488
    scale_params: 321.800985412
    scale_params: 273.706939587
    scale_params: 656.599960509
    scale_params: 927.82133212
    scale_params: 518.971195017
    scale_params: 1086135444.83
    scale_params: 352.128170499
    scale_params: 220.548494283
    scale_params: 492.688984629
    scale_params: 1834.63390104
    scale_params: 602.208760645
    scale_params: 14342884019.3
    scale_params: 6.23394504718e+12
    scale_params: 4403.77905913
    scale_params: 778.230799321
    scale_params: 1676.81635023
    scale_params: 4.7020378037e+14
    scale_params: 204.903378929
    scale_params: 17948.473115
    scale_params: 3037.97862036
    scale_params: 10315.9093708
    scale_params: 1332.29667413
    scale_params: 453.609954736
    scale_params: 28239.4733543
    scale_params: 533.43955993
    scale_params: 12225687029.8
    scale_params: 460.699856905
    scale_params: 1418.25021121
    scale_params: 281.409209385
    scale_params: 9255.19698528
    scale_params: 11586.4209929
    scale_params: 547.636532054
    scale_params: 261.774060562
    scale_params: 375.313978074
    scale_params: 3572.41988843
    scale_params: 365.223065223
    scale_params: 347.094165318
    scale_params: 172.9965046
    scale_params: 10149088371.1
    scale_params: 366.109945713
    scale_params: 147.470898135
    scale_params: 279.290762211
    scale_params: 6595.48935531
    scale_params: 193.36476287
    scale_params: 194.635258627
    scale_params: 18919.6419957
    scale_params: 10847.5956461
    scale_params: 3.09875549262e+13
    scale_params: 299.784596968
    scale_params: 378608.570264
    scale_params: 359.348104334
    scale_params: 1247.06911227
    scale_params: 9675.90721989
    scale_params: 394.468722105
    scale_params: 1.46081391849e+14
    scale_params: 7.67938547961e+14
    scale_params: 324.359831139
    scale_params: 202.721796832
    scale_params: 279.432584781
    scale_params: 2195.8329149
    scale_params: 2519.43902477
    scale_params: 1564.05397721
    scale_params: 3890.13630955
    scale_params: 1786.57201701
    scale_params: 621.406912683
    scale_params: 752.775245581
    scale_params: 1050.59906241
    scale_params: 20518.4921784
    scale_params: 5319982135.77
    scale_params: 590.231849445
    scale_params: 1014.43299118
    scale_params: 35593.4092974
    scale_params: 473.795863911
    scale_params: 263.072131946
    scale_params: 515.795960187
    scale_params: 1045.76332382
    scale_params: 1707.31118491
    scale_params: 5519.99702588
    scale_params: 1502.73465709
    scale_params: 1797449795.47
    scale_params: 1533.46261391
    scale_params: 78014150.5928
    scale_params: 591852.783106
    scale_params: 970015.558872
    scale_params: 333.664632118
    scale_params: 1243.15462998
    scale_params: 748.678495963
    scale_params: 1666.43706554
    scale_params: 27969155762.9
    scale_params: 535.204916023
    scale_params: 371.648120568
    scale_params: 14343134.8634
    scale_params: 1707.37616973
    scale_params: 205296433.976
    scale_params: 33571447427.3
    scale_params: 445.499765928
    scale_params: 209.492428721
    scale_params: 358.595758933
    scale_params: 984.313913287
    scale_params: 531.595276757
    scale_params: 1296.99932136
    scale_params: 1032.88856022
    scale_params: 3373.23802663
    scale_params: 213342444.358
    scale_params: 405.633742411
    scale_params: 380.758015136
    scale_params: 28485.5645681
    scale_params: 435.9978015
    scale_params: 834.192605633
    scale_params: 149.384461875
    scale_params: 1.42802662939e+12
    scale_params: 315.764437803
    scale_params: 4314.35976563
    scale_params: 531.782648133
  }
}
layer {
  name: "resx1_match_conv_bn"
  type: "BatchNorm"
  bottom: "resx1_match_conv"
  top: "resx1_match_conv"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "resx1_match_conv_scale"
  type: "Scale"
  bottom: "resx1_match_conv"
  top: "resx1_match_conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "resx1_elewise"
  type: "Eltwise"
  bottom: "resx1_match_conv"
  bottom: "resx1_conv3"
  top: "resx1_elewise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "resx1_elewise_relu"
  type: "ReLU"
  bottom: "resx1_elewise"
  top: "resx1_elewise"
}
layer {
  name: "resx2_conv1"
  type: "Convolution"
  bottom: "resx1_elewise"
  top: "resx2_conv1"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 65.3743187345
    scale_out: 152.903248496
    scale_params: 1337.81746981
    scale_params: 1197.88849781
    scale_params: 3.36709139097e+14
    scale_params: 4.90788211429e+13
    scale_params: 895.612860351
    scale_params: 1537.49799925
    scale_params: 1093.88108783
    scale_params: 1122.83388991
    scale_params: 4.64720465483e+11
    scale_params: 923.206129619
    scale_params: 16524461463.7
    scale_params: 467706374.606
    scale_params: 942.088683937
    scale_params: 1230.25240365
    scale_params: 1232.84107084
    scale_params: 2.9698810898e+15
    scale_params: 1112.6307752
    scale_params: 501.244151179
    scale_params: 1330.46375142
    scale_params: 1010.56145799
    scale_params: 817.844059102
    scale_params: 849.88106388
    scale_params: 981.639264902
    scale_params: 998.053238556
    scale_params: 1422.02119477
    scale_params: 1568.36950606
    scale_params: 289.797561502
    scale_params: 1185.16362948
    scale_params: 786.152233104
    scale_params: 651.168324227
    scale_params: 1244.82500533
    scale_params: 17528246116.6
    scale_params: 904.067850498
    scale_params: 845.369395497
    scale_params: 943.468104689
    scale_params: 697.290454372
    scale_params: 956.343665977
    scale_params: 789.769695185
    scale_params: 1498.68218215
    scale_params: 1240.98492623
    scale_params: 1441.81217792
    scale_params: 1402.54364184
    scale_params: 1618.05179922
    scale_params: 837.181081857
    scale_params: 1577.42821713
    scale_params: 888.255406737
    scale_params: 933.416845128
    scale_params: 1362.63537247
    scale_params: 716.547062711
    scale_params: 853.24597283
    scale_params: 5.44639290454e+14
    scale_params: 732.889015737
    scale_params: 1454.61153594
    scale_params: 942.051508935
    scale_params: 1488.3527386
    scale_params: 756.231828883
    scale_params: 971.676219419
    scale_params: 887.398991931
    scale_params: 1173.50247021
    scale_params: 763.118782232
    scale_params: 1520.17953004
    scale_params: 815.454448192
    scale_params: 1715.49577
    scale_params: 1477.99245017
    scale_params: 1029.56334206
    scale_params: 1175.11351914
    scale_params: 683.081507403
    scale_params: 912.717818031
    scale_params: 583.707490752
    scale_params: 895.217941444
    scale_params: 743.901677631
    scale_params: 564.012583105
    scale_params: 437.970969892
    scale_params: 418.329320994
    scale_params: 769.2292034
    scale_params: 529.114936942
    scale_params: 1459.19082644
    scale_params: 1154.0469146
    scale_params: 1134.5587468
    scale_params: 775.633041898
    scale_params: 842.441258265
    scale_params: 860.876444078
    scale_params: 1430.01895288
    scale_params: 1312.4567486
    scale_params: 633.195621405
    scale_params: 1334.75154219
    scale_params: 963.410205916
    scale_params: 992.039165569
    scale_params: 7.24062741655e+14
    scale_params: 1144.52425036
    scale_params: 834.70657383
    scale_params: 511.455795586
    scale_params: 645.466125211
    scale_params: 785.236272962
    scale_params: 893.285727627
    scale_params: 764.512967387
    scale_params: 717.436990268
    scale_params: 874.101456302
    scale_params: 878.532146963
    scale_params: 679.237944315
    scale_params: 944.102801304
    scale_params: 940.393701012
    scale_params: 846.467594367
    scale_params: 1566.24143674
    scale_params: 934.623767916
    scale_params: 631.170112303
    scale_params: 803.289920544
    scale_params: 1430.44485059
    scale_params: 962.042806194
    scale_params: 845.130738441
    scale_params: 687.93947365
    scale_params: 953.061592992
    scale_params: 1032.89425579
    scale_params: 903.755899689
    scale_params: 897.521989159
    scale_params: 788.150673669
    scale_params: 752.061503177
    scale_params: 968.073231135
    scale_params: 899.676543468
    scale_params: 1190.02532685
    scale_params: 652.255806444
    scale_params: 825.667670833
    scale_params: 1201.90884005
    scale_params: 849.312019084
    scale_params: 453.107816879
    scale_params: 638.16562515
    scale_params: 433.464451577
    scale_params: 721.617001081
  }
}
layer {
  name: "resx2_conv1_bn"
  type: "BatchNorm"
  bottom: "resx2_conv1"
  top: "resx2_conv1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "resx2_conv1_scale"
  type: "Scale"
  bottom: "resx2_conv1"
  top: "resx2_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "resx2_conv1_relu"
  type: "ReLU"
  bottom: "resx2_conv1"
  top: "resx2_conv1"
}
layer {
  name: "resx2_conv2"
  type: "Convolution"
  bottom: "resx2_conv1"
  top: "resx2_conv2"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 32
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 152.903248496
    scale_out: 93.0972699208
    scale_params: 105.268977904
    scale_params: 90.0163112936
    scale_params: 3.79753890401e+14
    scale_params: 73.8648477393
    scale_params: 92.6026589101
    scale_params: 106.122209065
    scale_params: 143.30591372
    scale_params: 113.765202615
    scale_params: 3.99154326242e+12
    scale_params: 3003803229.37
    scale_params: 72.3336401573
    scale_params: 435.05424267
    scale_params: 126.617954843
    scale_params: 128.341707032
    scale_params: 132.993957398
    scale_params: 100.295922303
    scale_params: 219.382609963
    scale_params: 109.391983867
    scale_params: 127.825165314
    scale_params: 292.461374372
    scale_params: 160.368332893
    scale_params: 147.265273534
    scale_params: 250.231291136
    scale_params: 110.455154109
    scale_params: 84.6655968164
    scale_params: 81.7508319514
    scale_params: 105.314213822
    scale_params: 84.1969523853
    scale_params: 272.859387557
    scale_params: 160.629921298
    scale_params: 10865663751.7
    scale_params: 106.866961842
    scale_params: 217.409661747
    scale_params: 254.348521361
    scale_params: 167.33115676
    scale_params: 131.454265381
    scale_params: 84.8750413079
    scale_params: 110.52139737
    scale_params: 17255883148.5
    scale_params: 114.318073157
    scale_params: 97.3495806629
    scale_params: 17614878.4462
    scale_params: 81.6371438188
    scale_params: 123.831541723
    scale_params: 97.7416517998
    scale_params: 146.153061104
    scale_params: 137.146777118
    scale_params: 125.56359255
    scale_params: 89.1607081446
    scale_params: 165.143350925
    scale_params: 138.146958173
    scale_params: 46.7348404716
    scale_params: 375.111031615
    scale_params: 85.1630019814
    scale_params: 175.928670292
    scale_params: 105.536168478
    scale_params: 117.123354866
    scale_params: 125.235057152
    scale_params: 157.893193177
    scale_params: 228.254717655
    scale_params: 80.0851986373
    scale_params: 74.9314106235
    scale_params: 71.8820445758
    scale_params: 166.570647881
    scale_params: 148.522042634
    scale_params: 177.098693138
    scale_params: 165.825486305
    scale_params: 101.925574416
    scale_params: 188.983052333
    scale_params: 148.958626791
    scale_params: 141.453903806
    scale_params: 180.426141431
    scale_params: 267.431815981
    scale_params: 130.165978808
    scale_params: 171.434776252
    scale_params: 181.61103529
    scale_params: 219.805505881
    scale_params: 106.792584937
    scale_params: 164.291787255
    scale_params: 158.227209488
    scale_params: 142.23595637
    scale_params: 158.521588988
    scale_params: 183.398633333
    scale_params: 197.108136433
    scale_params: 174.144206202
    scale_params: 137.810060835
    scale_params: 187.697853792
    scale_params: 333.06922229
    scale_params: 113.906690564
    scale_params: 142.749786047
    scale_params: 129.642085124
    scale_params: 128.097453569
    scale_params: 251.846371223
    scale_params: 206.607766323
    scale_params: 164.510144054
    scale_params: 208.10037387
    scale_params: 171.950392054
    scale_params: 173.624325096
    scale_params: 174.420006889
    scale_params: 169.260371824
    scale_params: 99.0955912617
    scale_params: 116.270664324
    scale_params: 152.473999422
    scale_params: 70.2449897311
    scale_params: 110.458910466
    scale_params: 141.989135502
    scale_params: 173.589202519
    scale_params: 208.112549021
    scale_params: 165.478587685
    scale_params: 209.061081622
    scale_params: 222.034833322
    scale_params: 147.664949401
    scale_params: 220.530575069
    scale_params: 142.733625173
    scale_params: 214.22294844
    scale_params: 111.823077081
    scale_params: 185.650961562
    scale_params: 138.20896793
    scale_params: 140.478503135
    scale_params: 200.937475787
    scale_params: 167.43415395
    scale_params: 397.864016513
    scale_params: 178.400189762
    scale_params: 325.148304613
    scale_params: 114.84777377
    scale_params: 111.707970337
    scale_params: 142.930069794
    scale_params: 152.776782015
  }
}
layer {
  name: "resx2_conv2_bn"
  type: "BatchNorm"
  bottom: "resx2_conv2"
  top: "resx2_conv2"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "resx2_conv2_scale"
  type: "Scale"
  bottom: "resx2_conv2"
  top: "resx2_conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "resx2_conv2_relu"
  type: "ReLU"
  bottom: "resx2_conv2"
  top: "resx2_conv2"
}
layer {
  name: "resx2_conv3"
  type: "Convolution"
  bottom: "resx2_conv2"
  top: "resx2_conv3"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 93.0972699208
    scale_out: 65.3743187345
    scale_params: 419.443445682
    scale_params: 3448.18407926
    scale_params: 1797.14052669
    scale_params: 174.275076678
    scale_params: 513.313554507
    scale_params: 194.410075461
    scale_params: 607.467255077
    scale_params: 5052.26694394
    scale_params: 599.274634907
    scale_params: 3126.1499475
    scale_params: 27314.2622828
    scale_params: 229.977111588
    scale_params: 159.383481093
    scale_params: 360.0225661
    scale_params: 589.46667481
    scale_params: 325.959593646
    scale_params: 349.09377646
    scale_params: 787.080872068
    scale_params: 51461.5707399
    scale_params: 1108.75126505
    scale_params: 402.927542758
    scale_params: 3737.54009008
    scale_params: 344.502135044
    scale_params: 3510.12428927
    scale_params: 372.085423095
    scale_params: 413.960820428
    scale_params: 11360.4683679
    scale_params: 176.854325913
    scale_params: 221.456445853
    scale_params: 289.638863554
    scale_params: 467.516239871
    scale_params: 800.333411276
    scale_params: 318.327680209
    scale_params: 810.625963655
    scale_params: 288.289455974
    scale_params: 1732.08908034
    scale_params: 464.722045931
    scale_params: 329.187298541
    scale_params: 1200.72040865
    scale_params: 6767.12749038
    scale_params: 485.416737794
    scale_params: 223.022999969
    scale_params: 320.489972291
    scale_params: 327.634727515
    scale_params: 567.580843332
    scale_params: 230.456861963
    scale_params: 3850.33563072
    scale_params: 567.123286526
    scale_params: 398.245428681
    scale_params: 372.705232718
    scale_params: 1339.89902963
    scale_params: 448.451714344
    scale_params: 146.956977056
    scale_params: 424.333751917
    scale_params: 342.113381816
    scale_params: 347.522943304
    scale_params: 471.610478853
    scale_params: 297.198443001
    scale_params: 459.023281461
    scale_params: 1023.39750037
    scale_params: 334.177586298
    scale_params: 270.860437505
    scale_params: 417.006916692
    scale_params: 3791.19055204
    scale_params: 321.316816188
    scale_params: 1738.48330253
    scale_params: 337.055123145
    scale_params: 345.621051433
    scale_params: 302.910205528
    scale_params: 1099.33574514
    scale_params: 419.811411913
    scale_params: 566.5619713
    scale_params: 188.62446043
    scale_params: 301.423766698
    scale_params: 796.789975593
    scale_params: 405.573363312
    scale_params: 501.416250597
    scale_params: 275.283041456
    scale_params: 208.132918651
    scale_params: 259.286584007
    scale_params: 167.078769949
    scale_params: 27602.0309363
    scale_params: 386.731069983
    scale_params: 262.053580553
    scale_params: 110.506929599
    scale_params: 168.956116662
    scale_params: 224.855404914
    scale_params: 424.890493765
    scale_params: 322.373850562
    scale_params: 13739.3865782
    scale_params: 1410.40057701
    scale_params: 1414.71999997
    scale_params: 161.576159569
    scale_params: 307.547230124
    scale_params: 673.534684625
    scale_params: 794.899123064
    scale_params: 385.948948819
    scale_params: 370.821374958
    scale_params: 320.580071391
    scale_params: 923.801532202
    scale_params: 478.701784988
    scale_params: 311.493126325
    scale_params: 472.586260705
    scale_params: 178.631626681
    scale_params: 163.571941651
    scale_params: 520.885740706
    scale_params: 366.854609915
    scale_params: 265.398759217
    scale_params: 16160.4506512
    scale_params: 326.38815564
    scale_params: 4707.2630489
    scale_params: 234.516057923
    scale_params: 260.065840997
    scale_params: 301.479487975
    scale_params: 254.090506367
    scale_params: 884.562193271
    scale_params: 225.178847604
    scale_params: 359.761267283
    scale_params: 7242.54094318
    scale_params: 1921.07641264
    scale_params: 823.730826747
    scale_params: 192.202055195
    scale_params: 176.830372407
    scale_params: 419.949633001
    scale_params: 313.488433942
    scale_params: 1016.90275703
    scale_params: 461.055497763
    scale_params: 410.817426651
    scale_params: 480.373158209
    scale_params: 178.718559171
    scale_params: 2259.39807482
    scale_params: 274.622993146
    scale_params: 180.590808416
    scale_params: 437.028227688
    scale_params: 406.726987124
    scale_params: 358.050289891
    scale_params: 308.235726781
    scale_params: 197.116488027
    scale_params: 315.130885633
    scale_params: 951.311853609
    scale_params: 602.893802855
    scale_params: 1717.81032209
    scale_params: 582.194745426
    scale_params: 886.268487755
    scale_params: 232.061715356
    scale_params: 443.217526956
    scale_params: 11759.4313441
    scale_params: 338.916889978
    scale_params: 3653.35291487
    scale_params: 505.142909706
    scale_params: 855.691046945
    scale_params: 192.747814756
    scale_params: 3962.33253706
    scale_params: 239.244627483
    scale_params: 591.022291697
    scale_params: 490.697780869
    scale_params: 225.19717318
    scale_params: 3291.48631643
    scale_params: 429.021176854
    scale_params: 116267.910853
    scale_params: 220.170935706
    scale_params: 171.22940299
    scale_params: 471.597222174
    scale_params: 390.838989203
    scale_params: 457.98409624
    scale_params: 914.242035485
    scale_params: 343.474746211
    scale_params: 154.93065349
    scale_params: 2733.68202247
    scale_params: 426.993266064
    scale_params: 1119.86973453
    scale_params: 9508.89054596
    scale_params: 216.259124479
    scale_params: 638.599704063
    scale_params: 733.707388103
    scale_params: 348.458949487
    scale_params: 472.377292348
    scale_params: 5678.45308659
    scale_params: 1121.54389708
    scale_params: 460.683122664
    scale_params: 158.460626777
    scale_params: 449.829202224
    scale_params: 3350.54533589
    scale_params: 945.437052884
    scale_params: 2629.84775561
    scale_params: 1869.93694631
    scale_params: 940.988526063
    scale_params: 295.307816202
    scale_params: 182.37991521
    scale_params: 405.660501815
    scale_params: 601.176457045
    scale_params: 1093.95585413
    scale_params: 245.032005405
    scale_params: 347.808967966
    scale_params: 177.080133193
    scale_params: 3075.52890147
    scale_params: 320.772469925
    scale_params: 201.536926728
    scale_params: 7284.39016601
    scale_params: 318.671802312
    scale_params: 2019.00474226
    scale_params: 343.197875843
    scale_params: 236.15579297
    scale_params: 615.448508733
    scale_params: 377.110075474
    scale_params: 139.688803891
    scale_params: 280.564798
    scale_params: 236.997060653
    scale_params: 291.855384429
    scale_params: 252.894946069
    scale_params: 317.541681896
    scale_params: 283.356387571
    scale_params: 256.644380578
    scale_params: 209.364411577
    scale_params: 1721.82141197
    scale_params: 2860.15764009
    scale_params: 238.689978535
    scale_params: 342.479943357
    scale_params: 273.729953696
    scale_params: 460.562582403
    scale_params: 320.971941139
    scale_params: 449.776027118
    scale_params: 136.481699324
    scale_params: 385.752777699
    scale_params: 338.340558188
    scale_params: 3251.92787043
    scale_params: 457.141417334
    scale_params: 162.51117424
    scale_params: 314.981368968
    scale_params: 266.903171199
    scale_params: 283.757786619
    scale_params: 241.204384978
    scale_params: 1920.69781327
    scale_params: 192.758503825
    scale_params: 229.496487068
    scale_params: 527.94666781
    scale_params: 1406791.37396
    scale_params: 653.161216098
    scale_params: 441.037960985
    scale_params: 288.149023999
    scale_params: 216.88349848
    scale_params: 415.427534903
    scale_params: 419.953647364
    scale_params: 263.677827678
    scale_params: 246.738993039
    scale_params: 138.04196432
    scale_params: 416.133809261
    scale_params: 8023.74006901
    scale_params: 296.916696842
    scale_params: 465.497925725
    scale_params: 351.637871682
    scale_params: 2405.21513908
    scale_params: 343.303769103
    scale_params: 443.697601849
    scale_params: 177.952515126
    scale_params: 704.273043063
  }
}
layer {
  name: "resx2_conv3_bn"
  type: "BatchNorm"
  bottom: "resx2_conv3"
  top: "resx2_conv3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "resx2_conv3_scale"
  type: "Scale"
  bottom: "resx2_conv3"
  top: "resx2_conv3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "resx2_elewise"
  type: "Eltwise"
  bottom: "resx1_elewise"
  bottom: "resx2_conv3"
  top: "resx2_elewise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "resx2_elewise_relu"
  type: "ReLU"
  bottom: "resx2_elewise"
  top: "resx2_elewise"
}
layer {
  name: "resx3_conv1"
  type: "Convolution"
  bottom: "resx2_elewise"
  top: "resx3_conv1"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
