name: "ResNet-50"
layer {
  name: "data"
  type: "DummyData"
  top: "data"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 0.01 
    }    
    shape {
      dim: 1
      dim: 3
      dim: 224
      dim: 224  
    }    
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
}
layer {
  name: "bn_conv1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  batch_norm_param {
  }
}
layer {
  name: "scale_conv1"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
  relu_param {
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "res2a_branch1"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch1"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 7.36999988556
    scale_out: 6.21999979019
    scale_params: 3828.66992188
    scale_params: 618.320007324
    scale_params: 587.33001709
    scale_params: 1369.47998047
    scale_params: 814.809997559
    scale_params: 1789.85998535
    scale_params: 920.719970703
    scale_params: 199.800003052
    scale_params: 1450.02001953
    scale_params: 575.429992676
    scale_params: 384.109985352
    scale_params: 3843.97998047
    scale_params: 577.200012207
    scale_params: 420.649993896
    scale_params: 234.669998169
    scale_params: 543.030029297
    scale_params: 573.450012207
    scale_params: 329.980010986
    scale_params: 514.510009766
    scale_params: 1706.61999512
    scale_params: 1049.7199707
    scale_params: 489.929992676
    scale_params: 273.529998779
    scale_params: 146.75
    scale_params: 261.730010986
    scale_params: 526.020019531
    scale_params: 537.210021973
    scale_params: 714.5
    scale_params: 238.240005493
    scale_params: 1328.52001953
    scale_params: 186.800003052
    scale_params: 3482.09008789
    scale_params: 563.320007324
    scale_params: 311.209991455
    scale_params: 272.510009766
    scale_params: 376.679992676
    scale_params: 1690.90002441
    scale_params: 371.649993896
    scale_params: 319.970001221
    scale_params: 1471.15002441
    scale_params: 177.699996948
    scale_params: 369.589996338
    scale_params: 305.290008545
    scale_params: 441.890014648
    scale_params: 1084.98999023
    scale_params: 550.770019531
    scale_params: 560.960021973
    scale_params: 521.900024414
    scale_params: 210.169998169
    scale_params: 236.660003662
    scale_params: 2190.14990234
    scale_params: 821.16998291
    scale_params: 775.840026855
    scale_params: 626.159973145
    scale_params: 412.890014648
    scale_params: 322.100006104
    scale_params: 409.799987793
    scale_params: 390.290008545
    scale_params: 1059.69995117
    scale_params: 340.559997559
    scale_params: 255.080001831
    scale_params: 1060.39001465
    scale_params: 716.25
    scale_params: 1808.02001953
    scale_params: 178.320007324
    scale_params: 385.140014648
    scale_params: 169.160003662
    scale_params: 443.100006104
    scale_params: 947.280029297
    scale_params: 295.339996338
    scale_params: 562.840026855
    scale_params: 1002.90002441
    scale_params: 3527.51000977
    scale_params: 399.820007324
    scale_params: 483.519989014
    scale_params: 8887.54980469
    scale_params: 1260.2800293
    scale_params: 117.430000305
    scale_params: 253.13999939
    scale_params: 123.949996948
    scale_params: 432.130004883
    scale_params: 1442.68005371
    scale_params: 1017.52001953
    scale_params: 244.550003052
    scale_params: 403.559997559
    scale_params: 499.989990234
    scale_params: 564.489990234
    scale_params: 246.910003662
    scale_params: 512.770019531
    scale_params: 967.210021973
    scale_params: 158.649993896
    scale_params: 420.730010986
    scale_params: 211.38999939
    scale_params: 416.339996338
    scale_params: 698.520019531
    scale_params: 314.290008545
    scale_params: 553.190002441
    scale_params: 1144.92004395
    scale_params: 544.799987793
    scale_params: 2448.43994141
    scale_params: 654.0
    scale_params: 666.640014648
    scale_params: 1038.19995117
    scale_params: 486.619995117
    scale_params: 1200.7199707
    scale_params: 95.9499969482
    scale_params: 260.670013428
    scale_params: 213.839996338
    scale_params: 365.149993896
    scale_params: 257.640014648
    scale_params: 659.510009766
    scale_params: 439.350006104
    scale_params: 779.770019531
    scale_params: 1673.69995117
    scale_params: 429.209991455
    scale_params: 537.289978027
    scale_params: 203.869995117
    scale_params: 801.679992676
    scale_params: 1464.76000977
    scale_params: 425.609985352
    scale_params: 272.119995117
    scale_params: 195.600006104
    scale_params: 1187.59997559
    scale_params: 109.029998779
    scale_params: 158.490005493
    scale_params: 506.329986572
    scale_params: 142.490005493
    scale_params: 414.019989014
    scale_params: 393.529998779
    scale_params: 318.269989014
    scale_params: 1301.22998047
    scale_params: 245.740005493
    scale_params: 206.509994507
    scale_params: 1103.89001465
    scale_params: 277131.71875
    scale_params: 788.979980469
    scale_params: 322.839996338
    scale_params: 560.179992676
    scale_params: 498.089996338
    scale_params: 772.200012207
    scale_params: 1337.73999023
    scale_params: 984.820007324
    scale_params: 589.08001709
    scale_params: 743.320007324
    scale_params: 1245.67004395
    scale_params: 212.160003662
    scale_params: 500.029998779
    scale_params: 103.529998779
    scale_params: 1093.63000488
    scale_params: 127.440002441
    scale_params: 789.33001709
    scale_params: 1030.48999023
    scale_params: 131.419998169
    scale_params: 1322.55004883
    scale_params: 746.349975586
    scale_params: 326.070007324
    scale_params: 5814.00976562
    scale_params: 5018.58007812
    scale_params: 375.910003662
    scale_params: 1040.5
    scale_params: 1152.59997559
    scale_params: 113.63999939
    scale_params: 342.279998779
    scale_params: 1272.02001953
    scale_params: 268.380004883
    scale_params: 353.730010986
    scale_params: 428.640014648
    scale_params: 427.329986572
    scale_params: 528.020019531
    scale_params: 271.880004883
    scale_params: 618.630004883
    scale_params: 363.260009766
    scale_params: 812.010009766
    scale_params: 333.440002441
    scale_params: 1090.98999023
    scale_params: 342.890014648
    scale_params: 549.109985352
    scale_params: 616.599975586
    scale_params: 425.660003662
    scale_params: 535.809997559
    scale_params: 220.589996338
    scale_params: 734.369995117
    scale_params: 1452.54003906
    scale_params: 2120.29003906
    scale_params: 209.979995728
    scale_params: 736.58001709
    scale_params: 165.240005493
    scale_params: 448.170013428
    scale_params: 120.580001831
    scale_params: 231.179992676
    scale_params: 577.929992676
    scale_params: 339.720001221
    scale_params: 764.039978027
    scale_params: 889.229980469
    scale_params: 1363.81994629
    scale_params: 451.170013428
    scale_params: 1019.57000732
    scale_params: 807.039978027
    scale_params: 6748.10009766
    scale_params: 352.980010986
    scale_params: 474.230010986
    scale_params: 205.059997559
    scale_params: 3108.5
    scale_params: 264.170013428
    scale_params: 248.809997559
    scale_params: 550.530029297
    scale_params: 431.089996338
    scale_params: 270.559997559
    scale_params: 905.739990234
    scale_params: 371.5
    scale_params: 7559.12011719
    scale_params: 795.849975586
    scale_params: 657.83001709
    scale_params: 751.859985352
    scale_params: 341.940002441
    scale_params: 438.730010986
    scale_params: 9547.58984375
    scale_params: 469.320007324
    scale_params: 619.890014648
    scale_params: 357.589996338
    scale_params: 410.890014648
    scale_params: 324.609985352
    scale_params: 398.429992676
    scale_params: 278.899993896
    scale_params: 456.299987793
    scale_params: 316.279998779
    scale_params: 268.130004883
    scale_params: 754.450012207
    scale_params: 255.759994507
    scale_params: 1370.48999023
    scale_params: 993.679992676
    scale_params: 319.820007324
    scale_params: 849.070007324
    scale_params: 3807.34008789
    scale_params: 2119.58007812
    scale_params: 313.339996338
    scale_params: 793.539978027
    scale_params: 527.809997559
    scale_params: 349.459991455
    scale_params: 549.559997559
    scale_params: 478.790008545
    scale_params: 1185.48999023
    scale_params: 586.460021973
    scale_params: 569.400024414
    scale_params: 524.880004883
    scale_params: 75.9199981689
    scale_params: 407.049987793
    scale_params: 347.980010986
    scale_params: 930.729980469
    scale_params: 297.369995117
    scale_params: 6495.52978516
    scale_params: 1748.11999512
    scale_params: 3387.83007812
    scale_params: 204.080001831
    scale_params: 142.479995728
    scale_params: 664.109985352
  }
}
layer {
  name: "bn2a_branch1"
  type: "BatchNorm"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  batch_norm_param {
  }
}
layer {
  name: "scale2a_branch1"
  type: "Scale"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 7.36999988556
    scale_out: 16.3400001526
    scale_params: 695.08001709
    scale_params: 411.190002441
    scale_params: 419.420013428
    scale_params: 593.299987793
    scale_params: 733.219970703
    scale_params: 373.230010986
    scale_params: 391.630004883
    scale_params: 822.530029297
    scale_params: 389.700012207
    scale_params: 649.979980469
    scale_params: 589.479980469
    scale_params: 400.720001221
    scale_params: 907.159973145
    scale_params: 321.359985352
    scale_params: 1182.4699707
    scale_params: 566.08001709
    scale_params: 449.190002441
    scale_params: 451.429992676
    scale_params: 299.029998779
    scale_params: 415.019989014
    scale_params: 535.049987793
    scale_params: 339.690002441
    scale_params: 301.869995117
    scale_params: 480.929992676
    scale_params: 373.450012207
    scale_params: 218.039993286
    scale_params: 365.200012207
    scale_params: 296.920013428
    scale_params: 345.5
    scale_params: 210.929992676
    scale_params: 482.309997559
    scale_params: 537.320007324
    scale_params: 266.429992676
    scale_params: 553.190002441
    scale_params: 329.809997559
    scale_params: 566.150024414
    scale_params: 338.929992676
    scale_params: 556.950012207
    scale_params: 377.309997559
    scale_params: 224.809997559
    scale_params: 166.910003662
    scale_params: 206.880004883
    scale_params: 1631.97998047
    scale_params: 413.790008545
    scale_params: 298.519989014
    scale_params: 157.399993896
    scale_params: 374.279998779
    scale_params: 779.109985352
    scale_params: 510.989990234
    scale_params: 209.779998779
    scale_params: 535.770019531
    scale_params: 306.579986572
    scale_params: 216.149993896
    scale_params: 151.089996338
    scale_params: 508.380004883
    scale_params: 330.5
    scale_params: 601.440002441
    scale_params: 596.140014648
    scale_params: 153.199996948
    scale_params: 355.339996338
    scale_params: 530.739990234
    scale_params: 390.329986572
    scale_params: 296.369995117
    scale_params: 434.640014648
  }
}
layer {
  name: "bn2a_branch2a"
  type: "BatchNorm"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  batch_norm_param {
  }
}
layer {
  name: "scale2a_branch2a"
  type: "Scale"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a_relu"
  type: "ReLU"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  relu_param {
  }
}
layer {
  name: "res2a_branch2b"
  type: "Convolution"
  bottom: "res2a_branch2a"
  top: "res2a_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 16.3400001526
    scale_out: 20.1900005341
    scale_params: 1121.42004395
    scale_params: 708.400024414
    scale_params: 962.020019531
    scale_params: 1040.93994141
    scale_params: 773.380004883
    scale_params: 550.099975586
    scale_params: 937.489990234
    scale_params: 1531.55004883
    scale_params: 1760.11999512
    scale_params: 1492.20996094
    scale_params: 672.25
    scale_params: 1122.72998047
    scale_params: 510.660003662
    scale_params: 1296.97998047
    scale_params: 547.140014648
    scale_params: 1375.06005859
    scale_params: 1437.61999512
    scale_params: 1250.98999023
    scale_params: 424.730010986
    scale_params: 1660.32995605
    scale_params: 774.950012207
    scale_params: 832.549987793
    scale_params: 711.320007324
    scale_params: 939.710021973
    scale_params: 625.58001709
    scale_params: 416.320007324
    scale_params: 819.16998291
    scale_params: 1239.57995605
    scale_params: 1370.93005371
    scale_params: 2002.09997559
    scale_params: 778.049987793
    scale_params: 488.190002441
    scale_params: 970.940002441
    scale_params: 1279.68994141
    scale_params: 649.570007324
    scale_params: 977.590026855
    scale_params: 1375.0
    scale_params: 701.130004883
    scale_params: 1191.04003906
    scale_params: 823.520019531
    scale_params: 650.58001709
    scale_params: 2296.08007812
    scale_params: 750.900024414
    scale_params: 1421.80004883
    scale_params: 873.260009766
    scale_params: 780.390014648
    scale_params: 1610.43005371
    scale_params: 1084.5
    scale_params: 880.400024414
    scale_params: 532.150024414
    scale_params: 1174.31005859
    scale_params: 783.270019531
    scale_params: 1476.43005371
    scale_params: 1455.10998535
    scale_params: 945.989990234
    scale_params: 650.549987793
    scale_params: 2028.64001465
    scale_params: 1127.41003418
    scale_params: 661.010009766
    scale_params: 738.789978027
    scale_params: 885.25
    scale_params: 686.309997559
    scale_params: 1795.2800293
    scale_params: 815.780029297
  }
}
layer {
  name: "bn2a_branch2b"
  type: "BatchNorm"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  batch_norm_param {
  }
}
layer {
  name: "scale2a_branch2b"
  type: "Scale"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2b_relu"
  type: "ReLU"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  relu_param {
  }
}
layer {
  name: "res2a_branch2c"
  type: "Convolution"
  bottom: "res2a_branch2b"
  top: "res2a_branch2c"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 20.1900005341
    scale_out: 12.4799995422
    scale_params: 621.090026855
    scale_params: 612.049987793
    scale_params: 291.470001221
    scale_params: 526.059997559
    scale_params: 602.150024414
    scale_params: 548.630004883
    scale_params: 326.260009766
    scale_params: 248.809997559
    scale_params: 493.049987793
    scale_params: 937.869995117
    scale_params: 398.670013428
    scale_params: 1214.15002441
    scale_params: 366.339996338
    scale_params: 257.5
    scale_params: 771.890014648
    scale_params: 339.220001221
    scale_params: 613.409973145
    scale_params: 217.529998779
    scale_params: 197.410003662
    scale_params: 425.230010986
    scale_params: 311.970001221
    scale_params: 568.340026855
    scale_params: 421.350006104
    scale_params: 196.589996338
    scale_params: 444.839996338
    scale_params: 389.480010986
    scale_params: 232.960006714
    scale_params: 982.780029297
    scale_params: 261.320007324
    scale_params: 773.659973145
    scale_params: 237.970001221
    scale_params: 2193.35009766
    scale_params: 271.209991455
    scale_params: 1386.42004395
    scale_params: 1790.67004395
    scale_params: 136.529998779
    scale_params: 1592.18005371
    scale_params: 500.279998779
    scale_params: 349.869995117
    scale_params: 759.820007324
    scale_params: 519.659973145
    scale_params: 195.850006104
    scale_params: 601.109985352
    scale_params: 630.409973145
    scale_params: 473.519989014
    scale_params: 131.740005493
    scale_params: 382.170013428
    scale_params: 6148.70019531
    scale_params: 167.070007324
    scale_params: 247.88999939
    scale_params: 1551.43005371
    scale_params: 164.559997559
    scale_params: 404.029998779
    scale_params: 244.13999939
    scale_params: 269.899993896
    scale_params: 191.119995117
    scale_params: 130.419998169
    scale_params: 354.559997559
    scale_params: 297.049987793
    scale_params: 336.809997559
    scale_params: 334.869995117
    scale_params: 226.630004883
    scale_params: 171.0
    scale_params: 2042.42004395
    scale_params: 558.260009766
    scale_params: 180.320007324
    scale_params: 181.800003052
    scale_params: 283.470001221
    scale_params: 808.5
    scale_params: 742.460021973
    scale_params: 400.179992676
    scale_params: 810.900024414
    scale_params: 1557.79003906
    scale_params: 285.450012207
    scale_params: 644.140014648
    scale_params: 968.869995117
    scale_params: 443.260009766
    scale_params: 897.239990234
    scale_params: 465.059997559
    scale_params: 791.66998291
    scale_params: 507.790008545
    scale_params: 1005.60998535
    scale_params: 235.570007324
    scale_params: 267.269989014
    scale_params: 247.559997559
    scale_params: 987.590026855
    scale_params: 563.929992676
    scale_params: 382.899993896
    scale_params: 123.959999084
    scale_params: 880.0
    scale_params: 1379.16003418
    scale_params: 152.520004272
    scale_params: 337.450012207
    scale_params: 350.429992676
    scale_params: 540.729980469
    scale_params: 309.519989014
    scale_params: 476.309997559
    scale_params: 673.049987793
    scale_params: 386.690002441
    scale_params: 5247.37988281
    scale_params: 169.710006714
    scale_params: 1722.4699707
    scale_params: 1184.18994141
    scale_params: 245.770004272
    scale_params: 829.659973145
    scale_params: 156.570007324
    scale_params: 282.359985352
    scale_params: 151.229995728
    scale_params: 492.760009766
    scale_params: 788.91998291
    scale_params: 392.910003662
    scale_params: 454.709991455
    scale_params: 586.479980469
    scale_params: 772.260009766
    scale_params: 271.790008545
    scale_params: 573.320007324
    scale_params: 550.650024414
    scale_params: 731.299987793
    scale_params: 633.940002441
    scale_params: 474.619995117
    scale_params: 270.200012207
    scale_params: 263.279998779
    scale_params: 1527.11999512
    scale_params: 398.019989014
    scale_params: 537.200012207
    scale_params: 375.200012207
    scale_params: 250.600006104
    scale_params: 351.660003662
    scale_params: 613.260009766
    scale_params: 134.729995728
    scale_params: 838.719970703
    scale_params: 394.880004883
    scale_params: 330.910003662
    scale_params: 2011.98999023
    scale_params: 1018.09002686
    scale_params: 1681.29003906
    scale_params: 272.019989014
    scale_params: 278.019989014
    scale_params: 475.619995117
    scale_params: 790.320007324
    scale_params: 253.720001221
    scale_params: 661.83001709
    scale_params: 569.590026855
    scale_params: 347.279998779
    scale_params: 271.200012207
    scale_params: 404.130004883
    scale_params: 407.820007324
    scale_params: 971.409973145
    scale_params: 318.720001221
    scale_params: 685.840026855
    scale_params: 486.799987793
    scale_params: 585.729980469
    scale_params: 452.890014648
    scale_params: 1017.39001465
    scale_params: 225.929992676
    scale_params: 364.040008545
    scale_params: 1110.4699707
    scale_params: 917.609985352
    scale_params: 292.809997559
    scale_params: 306.589996338
    scale_params: 230.460006714
    scale_params: 279.880004883
    scale_params: 323.109985352
    scale_params: 438.100006104
    scale_params: 193.25
    scale_params: 237.11000061
    scale_params: 517.039978027
    scale_params: 385.170013428
    scale_params: 203.720001221
    scale_params: 235.509994507
    scale_params: 253.470001221
    scale_params: 176.220001221
    scale_params: 406.019989014
    scale_params: 4184.95019531
    scale_params: 6892.43994141
    scale_params: 580.020019531
    scale_params: 306.799987793
    scale_params: 728.450012207
    scale_params: 384.820007324
    scale_params: 129.380004883
    scale_params: 595.520019531
    scale_params: 350.929992676
    scale_params: 598.400024414
    scale_params: 1809.15002441
    scale_params: 647.940002441
    scale_params: 241.559997559
    scale_params: 325.119995117
    scale_params: 301.220001221
    scale_params: 331.799987793
    scale_params: 273.850006104
    scale_params: 1696.06994629
    scale_params: 198.570007324
    scale_params: 702.320007324
    scale_params: 242.839996338
    scale_params: 1068.01000977
    scale_params: 458.480010986
    scale_params: 349.440002441
    scale_params: 144.759994507
    scale_params: 436.309997559
    scale_params: 437.579986572
    scale_params: 417.559997559
    scale_params: 150.440002441
    scale_params: 760.950012207
    scale_params: 809.729980469
    scale_params: 61196.1992188
    scale_params: 304.920013428
    scale_params: 263.790008545
    scale_params: 414.399993896
    scale_params: 521.950012207
    scale_params: 390.980010986
    scale_params: 8452.55957031
    scale_params: 686.900024414
    scale_params: 72.1699981689
    scale_params: 926.280029297
    scale_params: 231.479995728
    scale_params: 564.799987793
    scale_params: 4142.37011719
    scale_params: 353.029998779
    scale_params: 557.150024414
    scale_params: 312.290008545
    scale_params: 272.160003662
    scale_params: 355.890014648
    scale_params: 343.820007324
    scale_params: 1638.13000488
    scale_params: 478.390014648
    scale_params: 2612.11010742
    scale_params: 198.520004272
    scale_params: 447.510009766
    scale_params: 277.0
    scale_params: 312.609985352
    scale_params: 692.75
    scale_params: 160.580001831
    scale_params: 1311.5
    scale_params: 760.41998291
    scale_params: 133.690002441
    scale_params: 166.380004883
    scale_params: 213.440002441
    scale_params: 293.100006104
    scale_params: 171.740005493
    scale_params: 482.600006104
    scale_params: 281.920013428
    scale_params: 855.380004883
    scale_params: 241.100006104
    scale_params: 989.070007324
    scale_params: 498.119995117
    scale_params: 369.980010986
    scale_params: 313.769989014
    scale_params: 448.130004883
    scale_params: 248.350006104
    scale_params: 627.349975586
    scale_params: 4630.62011719
    scale_params: 1036.16003418
    scale_params: 2267.01000977
    scale_params: 521.400024414
    scale_params: 811.820007324
    scale_params: 1704.73999023
  }
}
layer {
  name: "bn2a_branch2c"
  type: "BatchNorm"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  batch_norm_param {
  }
}
layer {
  name: "scale2a_branch2c"
  type: "Scale"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a"
  type: "Eltwise"
  bottom: "res2a_branch1"
  bottom: "res2a_branch2c"
  top: "res2a"
  eltwise_param {
  }
}
layer {
  name: "res2a_relu"
  type: "ReLU"
  bottom: "res2a"
  top: "res2a"
  relu_param {
  }
}
layer {
  name: "res2b_branch2a"
  type: "Convolution"
  bottom: "res2a"
  top: "res2b_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 12.4799995422
    scale_out: 18.7600002289
    scale_params: 964.260009766
    scale_params: 1277.32995605
    scale_params: 968.989990234
    scale_params: 927.700012207
    scale_params: 502.549987793
    scale_params: 429.399993896
    scale_params: 192.330001831
    scale_params: 557.979980469
    scale_params: 552.41998291
    scale_params: 1092.64001465
    scale_params: 675.280029297
    scale_params: 1192.97998047
    scale_params: 538.359985352
    scale_params: 922.039978027
    scale_params: 479.450012207
    scale_params: 715.590026855
    scale_params: 450.350006104
    scale_params: 1016.09002686
    scale_params: 442.869995117
    scale_params: 738.140014648
    scale_params: 806.91998291
    scale_params: 1318.97998047
    scale_params: 967.869995117
    scale_params: 541.530029297
    scale_params: 576.479980469
    scale_params: 518.299987793
    scale_params: 448.540008545
    scale_params: 505.040008545
    scale_params: 474.380004883
    scale_params: 1037.93005371
    scale_params: 836.880004883
    scale_params: 775.869995117
    scale_params: 880.789978027
    scale_params: 689.929992676
    scale_params: 687.429992676
    scale_params: 721.559997559
    scale_params: 1184.25
    scale_params: 518.570007324
    scale_params: 659.559997559
    scale_params: 653.469970703
    scale_params: 1107.98999023
    scale_params: 485.769989014
    scale_params: 670.41998291
    scale_params: 858.460021973
    scale_params: 854.609985352
    scale_params: 762.590026855
    scale_params: 786.25
    scale_params: 829.16998291
    scale_params: 634.369995117
    scale_params: 963.099975586
    scale_params: 846.440002441
    scale_params: 758.940002441
    scale_params: 908.869995117
    scale_params: 437.290008545
    scale_params: 416.260009766
    scale_params: 679.070007324
    scale_params: 644.729980469
    scale_params: 834.650024414
    scale_params: 960.960021973
    scale_params: 604.070007324
    scale_params: 977.869995117
    scale_params: 823.909973145
    scale_params: 1231.15002441
    scale_params: 751.679992676
  }
}
layer {
  name: "bn2b_branch2a"
  type: "BatchNorm"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  batch_norm_param {
  }
}
layer {
  name: "scale2b_branch2a"
  type: "Scale"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2a_relu"
  type: "ReLU"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  relu_param {
  }
}
layer {
  name: "res2b_branch2b"
  type: "Convolution"
  bottom: "res2b_branch2a"
  top: "res2b_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 18.7600002289
    scale_out: 19.5
    scale_params: 879.380004883
    scale_params: 813.859985352
    scale_params: 786.770019531
    scale_params: 778.869995117
    scale_params: 574.140014648
    scale_params: 1499.5300293
    scale_params: 1155.16003418
    scale_params: 735.630004883
    scale_params: 834.880004883
    scale_params: 710.539978027
    scale_params: 531.450012207
    scale_params: 210.529998779
    scale_params: 370.410003662
    scale_params: 846.130004883
    scale_params: 504.0
    scale_params: 732.820007324
    scale_params: 544.340026855
    scale_params: 515.909973145
    scale_params: 366.799987793
    scale_params: 470.739990234
    scale_params: 427.820007324
    scale_params: 812.909973145
    scale_params: 616.239990234
    scale_params: 821.140014648
    scale_params: 1459.43994141
    scale_params: 309.799987793
    scale_params: 672.820007324
    scale_params: 1026.56994629
    scale_params: 1282.93005371
    scale_params: 900.630004883
    scale_params: 722.119995117
    scale_params: 833.289978027
    scale_params: 684.380004883
    scale_params: 854.780029297
    scale_params: 601.820007324
    scale_params: 507.820007324
    scale_params: 1026.98999023
    scale_params: 989.359985352
    scale_params: 744.58001709
    scale_params: 892.299987793
    scale_params: 1519.04003906
    scale_params: 1362.22998047
    scale_params: 876.059997559
    scale_params: 585.679992676
    scale_params: 992.340026855
    scale_params: 642.559997559
    scale_params: 624.41998291
    scale_params: 807.599975586
    scale_params: 588.690002441
    scale_params: 1028.02001953
    scale_params: 751.130004883
    scale_params: 782.349975586
    scale_params: 909.16998291
    scale_params: 872.609985352
    scale_params: 406.209991455
    scale_params: 698.380004883
    scale_params: 679.380004883
    scale_params: 1015.65997314
    scale_params: 504.5
    scale_params: 468.799987793
    scale_params: 362.440002441
    scale_params: 710.16998291
    scale_params: 1067.13000488
    scale_params: 1151.77001953
  }
}
layer {
  name: "bn2b_branch2b"
  type: "BatchNorm"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  batch_norm_param {
  }
}
layer {
  name: "scale2b_branch2b"
  type: "Scale"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2b_relu"
  type: "ReLU"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  relu_param {
  }
}
layer {
  name: "res2b_branch2c"
  type: "Convolution"
  bottom: "res2b_branch2b"
  top: "res2b_branch2c"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 19.5
    scale_out: 12.4799995422
    scale_params: 123.25
    scale_params: 758.059997559
    scale_params: 894.190002441
    scale_params: 257.049987793
    scale_params: 182.949996948
    scale_params: 275.760009766
    scale_params: 323.269989014
    scale_params: 330.630004883
    scale_params: 113.879997253
    scale_params: 238.029998779
    scale_params: 319.160003662
    scale_params: 260.940002441
    scale_params: 635.780029297
    scale_params: 376.440002441
    scale_params: 179816.046875
    scale_params: 156.160003662
    scale_params: 610.239990234
    scale_params: 1126.51000977
    scale_params: 476.769989014
    scale_params: 166.910003662
    scale_params: 124.790000916
    scale_params: 994.239990234
    scale_params: 783.400024414
    scale_params: 66579.921875
    scale_params: 10198.4199219
    scale_params: 1256125.5
    scale_params: 135712.0
    scale_params: 212.149993896
    scale_params: 3124.11010742
    scale_params: 209.61000061
    scale_params: 13438.3496094
    scale_params: 222.529998779
    scale_params: 353.989990234
    scale_params: 34190.1015625
    scale_params: 11976.0
    scale_params: 230.460006714
    scale_params: 776.200012207
    scale_params: 795.150024414
    scale_params: 880.33001709
    scale_params: 5296.22021484
    scale_params: 293318.625
    scale_params: 204.660003662
    scale_params: 334.209991455
    scale_params: 828.359985352
    scale_params: 183.38999939
    scale_params: 20299.1796875
    scale_params: 212.61000061
    scale_params: 317.820007324
    scale_params: 6849.77001953
    scale_params: 545.549987793
    scale_params: 245.009994507
    scale_params: 233.820007324
    scale_params: 224.910003662
    scale_params: 196.259994507
    scale_params: 511.5
    scale_params: 1496.33996582
    scale_params: 8881.29980469
    scale_params: 220.059997559
    scale_params: 165.539993286
    scale_params: 756.25
    scale_params: 453.160003662
    scale_params: 193.11000061
    scale_params: 332.989990234
    scale_params: 216.759994507
    scale_params: 38268.25
    scale_params: 636.91998291
    scale_params: 20656.5703125
    scale_params: 934.280029297
    scale_params: 119.040000916
    scale_params: 3033.62988281
    scale_params: 332.850006104
    scale_params: 133.050003052
    scale_params: 194.940002441
    scale_params: 516.719970703
    scale_params: 703.020019531
    scale_params: 554.429992676
    scale_params: 183.039993286
    scale_params: 55723.859375
    scale_params: 713.190002441
    scale_params: 106029.9375
    scale_params: 307.929992676
    scale_params: 196.649993896
    scale_params: 239.88999939
    scale_params: 626.090026855
    scale_params: 229.410003662
    scale_params: 278.989990234
    scale_params: 1050.06005859
    scale_params: 1466.41003418
    scale_params: 344.0
    scale_params: 249.080001831
    scale_params: 25339.0390625
    scale_params: 1450.89001465
    scale_params: 55624.2890625
    scale_params: 299.329986572
    scale_params: 176.839996338
    scale_params: 296.529998779
    scale_params: 267.760009766
    scale_params: 133.809997559
    scale_params: 192.850006104
    scale_params: 287.420013428
    scale_params: 815.520019531
    scale_params: 229.369995117
    scale_params: 181.38999939
    scale_params: 268.029998779
    scale_params: 215.800003052
    scale_params: 316.959991455
    scale_params: 191.630004883
    scale_params: 1729.59997559
    scale_params: 746.549987793
    scale_params: 91732.1015625
    scale_params: 559.619995117
    scale_params: 594.380004883
    scale_params: 132.619995117
    scale_params: 185.080001831
    scale_params: 192.580001831
    scale_params: 197.179992676
    scale_params: 29150.890625
    scale_params: 147.220001221
    scale_params: 164.779998779
    scale_params: 8098.87988281
    scale_params: 592.799987793
    scale_params: 322.589996338
    scale_params: 132.600006104
    scale_params: 28230.1601562
    scale_params: 3018.56005859
    scale_params: 264.489990234
    scale_params: 25531.609375
    scale_params: 1138.56005859
    scale_params: 228.039993286
    scale_params: 1057.77001953
    scale_params: 347.070007324
    scale_params: 4566.22998047
    scale_params: 678.83001709
    scale_params: 10211.7900391
    scale_params: 162.559997559
    scale_params: 4298.04003906
    scale_params: 542.020019531
    scale_params: 281.869995117
    scale_params: 452.730010986
    scale_params: 179.169998169
    scale_params: 173.61000061
    scale_params: 211.699996948
    scale_params: 258.089996338
    scale_params: 257.75
    scale_params: 255.949996948
    scale_params: 73848.0
    scale_params: 202.039993286
    scale_params: 1594.93005371
    scale_params: 290.589996338
    scale_params: 547.299987793
    scale_params: 189.88999939
    scale_params: 209.630004883
    scale_params: 558.400024414
    scale_params: 192.550003052
    scale_params: 272.600006104
    scale_params: 1355.16003418
    scale_params: 132.130004883
    scale_params: 160.690002441
    scale_params: 31540.25
    scale_params: 633.880004883
    scale_params: 293.140014648
    scale_params: 19520.4492188
    scale_params: 424.579986572
    scale_params: 233.100006104
    scale_params: 892.200012207
    scale_params: 534.630004883
    scale_params: 164.690002441
    scale_params: 405.980010986
    scale_params: 252.759994507
    scale_params: 1844.56994629
    scale_params: 305.519989014
    scale_params: 301.200012207
    scale_params: 320.910003662
    scale_params: 71589.8828125
    scale_params: 454.880004883
    scale_params: 234.630004883
    scale_params: 862.809997559
    scale_params: 262.450012207
    scale_params: 199.429992676
    scale_params: 5689.91015625
    scale_params: 635.489990234
    scale_params: 145.839996338
    scale_params: 1899.17004395
    scale_params: 285.070007324
    scale_params: 46164.390625
    scale_params: 1662.27001953
    scale_params: 15501.5800781
    scale_params: 19768.5507812
    scale_params: 113.279998779
    scale_params: 2265.10009766
    scale_params: 88.4599990845
    scale_params: 640.390014648
    scale_params: 163.88999939
    scale_params: 296.570007324
    scale_params: 113.88999939
    scale_params: 468.570007324
    scale_params: 147.009994507
    scale_params: 207.089996338
    scale_params: 287.320007324
    scale_params: 217.660003662
    scale_params: 312.540008545
    scale_params: 10175.0097656
    scale_params: 228.929992676
    scale_params: 236.720001221
    scale_params: 13981.6904297
    scale_params: 248.149993896
    scale_params: 760.729980469
    scale_params: 411.230010986
    scale_params: 203.600006104
    scale_params: 261.640014648
    scale_params: 177.630004883
    scale_params: 179.190002441
    scale_params: 2778.44995117
    scale_params: 177.199996948
    scale_params: 1522.91003418
    scale_params: 333.950012207
    scale_params: 162.270004272
    scale_params: 630.940002441
    scale_params: 161.440002441
    scale_params: 211.720001221
    scale_params: 515.929992676
    scale_params: 534.179992676
    scale_params: 394.760009766
    scale_params: 16959.6601562
    scale_params: 630.159973145
    scale_params: 292.690002441
    scale_params: 28850.4296875
    scale_params: 194.380004883
    scale_params: 247.279998779
    scale_params: 336.630004883
    scale_params: 221.800003052
    scale_params: 8659.65039062
    scale_params: 195.899993896
    scale_params: 204.539993286
    scale_params: 226.660003662
    scale_params: 3218.80004883
    scale_params: 1004.20001221
    scale_params: 266.899993896
    scale_params: 470.570007324
    scale_params: 207.419998169
    scale_params: 277.75
    scale_params: 189.029998779
    scale_params: 166.36000061
    scale_params: 230.11000061
    scale_params: 410.489990234
    scale_params: 7752.31982422
    scale_params: 371.670013428
    scale_params: 287.459991455
    scale_params: 120.279998779
    scale_params: 226.369995117
    scale_params: 189.940002441
    scale_params: 343.510009766
    scale_params: 197.690002441
    scale_params: 792.859985352
    scale_params: 18814.0
    scale_params: 271.339996338
  }
}
layer {
  name: "bn2b_branch2c"
  type: "BatchNorm"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  batch_norm_param {
  }
}
layer {
  name: "scale2b_branch2c"
  type: "Scale"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b"
  type: "Eltwise"
  bottom: "res2a"
  bottom: "res2b_branch2c"
  top: "res2b"
  eltwise_param {
  }
}
layer {
  name: "res2b_relu"
  type: "ReLU"
  bottom: "res2b"
  top: "res2b"
  relu_param {
  }
}
layer {
  name: "res2c_branch2a"
  type: "Convolution"
  bottom: "res2b"
  top: "res2c_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 12.4799995422
    scale_out: 18.5499992371
    scale_params: 438.100006104
    scale_params: 495.959991455
    scale_params: 1222.39001465
    scale_params: 1140.31005859
    scale_params: 1216.83996582
    scale_params: 1179.60998535
    scale_params: 1018.73999023
    scale_params: 881.210021973
    scale_params: 1203.82995605
    scale_params: 1162.67004395
    scale_params: 821.489990234
    scale_params: 1243.66003418
    scale_params: 1042.43994141
    scale_params: 863.640014648
    scale_params: 1167.93005371
    scale_params: 995.710021973
    scale_params: 939.210021973
    scale_params: 1017.11999512
    scale_params: 824.5
    scale_params: 1136.39001465
    scale_params: 1190.42004395
    scale_params: 1071.86999512
    scale_params: 5229.68017578
    scale_params: 996.280029297
    scale_params: 655.679992676
    scale_params: 683.409973145
    scale_params: 1147.60998535
    scale_params: 1214.7800293
    scale_params: 1382.98999023
    scale_params: 659.150024414
    scale_params: 1073.57995605
    scale_params: 835.570007324
    scale_params: 360.359985352
    scale_params: 1339.7800293
    scale_params: 743.260009766
    scale_params: 1253.23999023
    scale_params: 582.460021973
    scale_params: 486.369995117
    scale_params: 1079.02001953
    scale_params: 451.609985352
    scale_params: 487.950012207
    scale_params: 732.409973145
    scale_params: 1296.7199707
    scale_params: 715.440002441
    scale_params: 927.780029297
    scale_params: 872.75
    scale_params: 1039.2800293
    scale_params: 1184.31994629
    scale_params: 443.179992676
    scale_params: 863.33001709
    scale_params: 605.91998291
    scale_params: 445.839996338
    scale_params: 842.969970703
    scale_params: 555.049987793
    scale_params: 565.340026855
    scale_params: 925.929992676
    scale_params: 748.75
    scale_params: 1177.86999512
    scale_params: 1162.23999023
    scale_params: 1352.58996582
    scale_params: 620.760009766
    scale_params: 1210.75
    scale_params: 893.119995117
    scale_params: 774.020019531
  }
}
layer {
  name: "bn2c_branch2a"
  type: "BatchNorm"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  batch_norm_param {
  }
}
layer {
  name: "scale2c_branch2a"
  type: "Scale"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2a_relu"
  type: "ReLU"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  relu_param {
  }
}
layer {
  name: "res2c_branch2b"
  type: "Convolution"
  bottom: "res2c_branch2a"
  top: "res2c_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 18.5499992371
    scale_out: 14.4899997711
    scale_params: 454.140014648
    scale_params: 1096.61999512
    scale_params: 414.5
    scale_params: 559.859985352
    scale_params: 431.010009766
    scale_params: 415.820007324
    scale_params: 545.619995117
    scale_params: 397.049987793
    scale_params: 568.200012207
    scale_params: 492.170013428
    scale_params: 465.660003662
    scale_params: 595.900024414
    scale_params: 479.410003662
    scale_params: 650.010009766
    scale_params: 730.619995117
    scale_params: 549.33001709
    scale_params: 671.559997559
    scale_params: 759.950012207
    scale_params: 311.119995117
    scale_params: 489.359985352
    scale_params: 378.980010986
    scale_params: 560.260009766
    scale_params: 513.630004883
    scale_params: 551.5
    scale_params: 582.08001709
    scale_params: 603.609985352
    scale_params: 606.450012207
    scale_params: 649.070007324
    scale_params: 562.489990234
    scale_params: 477.640014648
    scale_params: 700.859985352
    scale_params: 454.5
    scale_params: 410.220001221
    scale_params: 484.010009766
    scale_params: 576.030029297
    scale_params: 524.320007324
    scale_params: 474.660003662
    scale_params: 623.349975586
    scale_params: 655.849975586
    scale_params: 546.809997559
    scale_params: 672.940002441
    scale_params: 520.08001709
    scale_params: 525.960021973
    scale_params: 714.260009766
    scale_params: 602.929992676
    scale_params: 692.960021973
    scale_params: 771.770019531
    scale_params: 308.029998779
    scale_params: 399.390014648
    scale_params: 974.739990234
    scale_params: 712.400024414
    scale_params: 349.019989014
    scale_params: 511.440002441
    scale_params: 438.25
    scale_params: 593.140014648
    scale_params: 705.83001709
    scale_params: 643.489990234
    scale_params: 649.690002441
    scale_params: 462.619995117
    scale_params: 497.820007324
    scale_params: 928.619995117
    scale_params: 624.260009766
    scale_params: 448.839996338
    scale_params: 559.190002441
  }
}
layer {
  name: "bn2c_branch2b"
  type: "BatchNorm"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  batch_norm_param {
  }
}
layer {
  name: "scale2c_branch2b"
  type: "Scale"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2b_relu"
  type: "ReLU"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  relu_param {
  }
}
layer {
  name: "res2c_branch2c"
  type: "Convolution"
  bottom: "res2c_branch2b"
  top: "res2c_branch2c"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.20000000298
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 14.4899997711
    scale_out: 12.8999996185
    scale_params: 223.86000061
    scale_params: 185.729995728
    scale_params: 961.33001709
    scale_params: 319.059997559
    scale_params: 572.58001709
    scale_params: 52988.71875
    scale_params: 987.83001709
    scale_params: 214.770004272
    scale_params: 382.869995117
    scale_params: 305.920013428
    scale_params: 723.549987793
    scale_params: 150.119995117
    scale_params: 479.209991455
    scale_params: 6076.56005859
    scale_params: 106797.773438
    scale_params: 785.690002441
    scale_params: 253.169998169
    scale_params: 736.969970703
    scale_params: 474.450012207
    scale_params: 364.130004883
    scale_params: 278.290008545
    scale_params: 4092.59008789
    scale_params: 225.449996948
    scale_params: 23934.0292969
    scale_params: 70101.9921875
    scale_params: 218193.734375
    scale_params: 120513.460938
    scale_params: 314.720001221
    scale_params: 3708.02001953
    scale_params: 352.609985352
    scale_params: 40917.3984375
    scale_params: 340.25
    scale_params: 527.429992676
    scale_params: 88240.25
    scale_params: 72343.0390625
    scale_params: 5583.79003906
    scale_params: 226623.625
    scale_params: 13381.6298828
    scale_params: 298.049987793
    scale_params: 393298.90625
    scale_params: 726225.9375
    scale_params: 335.910003662
    scale_params: 179.570007324
    scale_params: 991.200012207
    scale_params: 274.760009766
    scale_params: 61464.4101562
    scale_params: 192.309997559
    scale_params: 2324.83007812
    scale_params: 114211.398438
    scale_params: 4279.77978516
    scale_params: 283.519989014
    scale_params: 188.229995728
    scale_params: 416.290008545
    scale_params: 391.940002441
    scale_params: 3265.63989258
    scale_params: 6237.5
    scale_params: 9532.58984375
    scale_params: 265.970001221
    scale_params: 103.910003662
    scale_params: 348.920013428
    scale_params: 1691.43994141
    scale_params: 394.570007324
    scale_params: 947.630004883
    scale_params: 940.349975586
    scale_params: 62855.4414062
    scale_params: 21725.2304688
    scale_params: 85651.6796875
    scale_params: 210.699996948
    scale_params: 323.700012207
    scale_params: 299.470001221
    scale_params: 307.309997559
    scale_params: 299.609985352
    scale_params: 234.800003052
    scale_params: 1023.7800293
    scale_params: 278.149993896
    scale_params: 227.11000061
    scale_params: 506.059997559
    scale_params: 79018.6171875
    scale_params: 489071.40625
    scale_params: 387021.40625
    scale_params: 385.200012207
    scale_params: 259.649993896
    scale_params: 703.390014648
    scale_params: 957.869995117
    scale_params: 404.029998779
    scale_params: 181.240005493
    scale_params: 2115.12988281
    scale_params: 2748.37988281
    scale_params: 2516.88989258
    scale_params: 141.699996948
    scale_params: 220060.4375
    scale_params: 12171.7802734
    scale_params: 32019.4902344
    scale_params: 279.049987793
    scale_params: 440.470001221
    scale_params: 353.929992676
    scale_params: 363.170013428
    scale_params: 1037.14001465
    scale_params: 658.369995117
    scale_params: 171.429992676
    scale_params: 62050.1796875
    scale_params: 913.890014648
    scale_params: 324.029998779
    scale_params: 1089.91003418
    scale_params: 246.130004883
    scale_params: 389.980010986
    scale_params: 260.100006104
    scale_params: 175970.921875
    scale_params: 604.260009766
    scale_params: 237.539993286
    scale_params: 140.800003052
    scale_params: 2284.72998047
    scale_params: 507.679992676
    scale_params: 269.279998779
    scale_params: 264.839996338
    scale_params: 352.920013428
    scale_params: 100644.070312
    scale_params: 179.86000061
    scale_params: 338.570007324
    scale_params: 199.380004883
    scale_params: 606.289978027
    scale_params: 2067.37988281
    scale_params: 691.239990234
    scale_params: 25100.8105469
    scale_params: 6724.81982422
    scale_params: 290.070007324
    scale_params: 792485.8125
    scale_params: 312.25
    scale_params: 395.940002441
    scale_params: 3759.58007812
