name: "MobileNet-SSD"
layer {
  name: "data"
  type: "DummyData"
  top: "data"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 0.01
    }
    shape {
      dim: 32
      dim: 3
      dim: 300
      dim: 300
    }
  }
}
layer {
  name: "data"
  type: "DummyData"
  top: "label"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 1
    }
    shape {
      dim: 1
      dim: 1
      dim: 1
      dim: 8
    }
  }
}
layer {
  name: "conv0"
  type: "Convolution"
  bottom: "data"
  top: "conv0"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv0/bn"
  type: "BatchNorm"
  bottom: "conv0"
  top: "conv0"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "conv0/scale"
  type: "Scale"
  bottom: "conv0"
  top: "conv0"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "conv0/relu"
  type: "ReLU"
  bottom: "conv0"
  top: "conv0"
}
layer {
  name: "conv1/dw"
  type: "Convolution"
  bottom: "conv0"
  top: "conv1/dw"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 32
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 18.1787223816
    scale_out: 11.1095628738
    scale_params: 42.0692214966
    scale_params: 0.0
    scale_params: 0.0
    scale_params: 0.0
    scale_params: 0.0
    scale_params: 35.9848022461
    scale_params: 96.1156158447
    scale_params: 0.0
    scale_params: 0.0
    scale_params: 0.0
    scale_params: 48.4883956909
    scale_params: 35.077381134
    scale_params: 35.6163787842
    scale_params: 0.0
    scale_params: 52.9423866272
    scale_params: 75.9592132568
    scale_params: 37.7726249695
    scale_params: 0.0
    scale_params: 23.2944393158
    scale_params: 41.6536369324
    scale_params: 74.3933258057
    scale_params: 114.592155457
    scale_params: 0.0
    scale_params: 0.0
    scale_params: 58.0522079468
    scale_params: 32.906917572
    scale_params: 0.0
    scale_params: 36.6667823792
    scale_params: 76.1828308105
    scale_params: 0.0
    scale_params: 0.0
    scale_params: 23.9832286835
  }
}
layer {
  name: "conv1/dw/bn"
  type: "BatchNorm"
  bottom: "conv1/dw"
  top: "conv1/dw"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "conv1/dw/scale"
  type: "Scale"
  bottom: "conv1/dw"
  top: "conv1/dw"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "conv1/dw/relu"
  type: "ReLU"
  bottom: "conv1/dw"
  top: "conv1/dw"
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "conv1/dw"
  top: "conv1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 11.1095628738
    scale_out: 3.00517463684
    scale_params: 62.2967948914
    scale_params: 340.009216309
    scale_params: 244.764648438
    scale_params: 114.332649231
    scale_params: 111.084205627
    scale_params: 48.3250808716
    scale_params: 276.6902771
    scale_params: 649.946838379
    scale_params: 136.880599976
    scale_params: 230.259521484
    scale_params: 226.491470337
    scale_params: 199.632385254
    scale_params: 58.7150344849
    scale_params: 312.996856689
    scale_params: 215.028823853
    scale_params: 233.231369019
    scale_params: 37.1700286865
    scale_params: 236.888717651
    scale_params: 602.868347168
    scale_params: 111.41103363
    scale_params: 297.324462891
    scale_params: 157.185012817
    scale_params: 21.9425697327
    scale_params: 251.113037109
    scale_params: 250.054946899
    scale_params: 95.9932327271
    scale_params: 101.70880127
    scale_params: 257.062194824
    scale_params: 371.846466064
    scale_params: 742.45123291
    scale_params: 202.487487793
    scale_params: 32.1840057373
    scale_params: 173.093582153
    scale_params: 148.452148438
    scale_params: 244.760742188
    scale_params: 65.3044586182
    scale_params: 516.906677246
    scale_params: 326.260314941
    scale_params: 81.105796814
    scale_params: 232.79234314
    scale_params: 95.4689483643
    scale_params: 168.81300354
    scale_params: 176.632965088
    scale_params: 138.763305664
    scale_params: 48.4995956421
    scale_params: 5453.74658203
    scale_params: 234.621231079
    scale_params: 105.889183044
    scale_params: 263.1277771
    scale_params: 186.405563354
    scale_params: 159.839416504
    scale_params: 44.4354171753
    scale_params: 0.0
    scale_params: 37.8183860779
    scale_params: 52.843044281
    scale_params: 129.145263672
    scale_params: 115.619125366
    scale_params: 283.588409424
    scale_params: 512.381225586
    scale_params: 323.917602539
    scale_params: 30.7325191498
    scale_params: 231.785415649
    scale_params: 38.860786438
    scale_params: 120.725563049
  }
}
layer {
  name: "conv1/bn"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "conv1/scale"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "conv1/relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "conv2/dw"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2/dw"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 64
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 3.00517463684
    scale_out: 16.3315830231
    scale_params: 439.582366943
    scale_params: 60.190322876
    scale_params: 83.5455932617
    scale_params: 485.688720703
    scale_params: 369.882568359
    scale_params: 995.153137207
    scale_params: 77.8068389893
    scale_params: 19.6928310394
    scale_params: 453.722686768
    scale_params: 76.307472229
    scale_params: 401.455871582
    scale_params: 94.9558563232
    scale_params: 244.565155029
    scale_params: 226.900314331
    scale_params: 375.830871582
    scale_params: 169.798782349
    scale_params: 1268.0333252
    scale_params: 266.880340576
    scale_params: 28.2426528931
    scale_params: 508.968933105
    scale_params: 344.379272461
    scale_params: 101.716270447
    scale_params: 460.506439209
    scale_params: 253.092453003
    scale_params: 323.436859131
    scale_params: 305.576904297
    scale_params: 578.445739746
    scale_params: 285.327636719
    scale_params: 273.306732178
    scale_params: 177.767288208
    scale_params: 227.428817749
    scale_params: 1689.76745605
    scale_params: 384.924804688
    scale_params: 437.611877441
    scale_params: 243.390029907
    scale_params: 815.499389648
    scale_params: 127.469459534
    scale_params: 384.258728027
    scale_params: 568.598693848
    scale_params: 157.37008667
    scale_params: 412.198699951
    scale_params: 290.022369385
    scale_params: 325.13684082
    scale_params: 598.472290039
    scale_params: 1249.16149902
    scale_params: 58.5879821777
    scale_params: 211.27532959
    scale_params: 181.552032471
    scale_params: 236.323394775
    scale_params: 181.688278198
    scale_params: 403.467315674
    scale_params: 643.55291748
    scale_params: 0.0
    scale_params: 743.267028809
    scale_params: 838.123962402
    scale_params: 398.562652588
    scale_params: 359.096374512
    scale_params: 292.135681152
    scale_params: 178.228103638
    scale_params: 243.217910767
    scale_params: 1868.04223633
    scale_params: 364.398712158
    scale_params: 1672.42822266
    scale_params: 152.041137695
  }
}
layer {
  name: "conv2/dw/bn"
  type: "BatchNorm"
  bottom: "conv2/dw"
  top: "conv2/dw"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "conv2/dw/scale"
  type: "Scale"
  bottom: "conv2/dw"
  top: "conv2/dw"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "conv2/dw/relu"
  type: "ReLU"
  bottom: "conv2/dw"
  top: "conv2/dw"
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv2/dw"
  top: "conv2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 16.3315830231
    scale_out: 6.65891981125
    scale_params: 96.467010498
    scale_params: 105.040458679
    scale_params: 145.789031982
    scale_params: 255.595932007
    scale_params: 92.1496353149
    scale_params: 260.557189941
    scale_params: 229.172805786
    scale_params: 48.896697998
    scale_params: 847.933044434
    scale_params: 181.334121704
    scale_params: 260.439666748
    scale_params: 215.586502075
    scale_params: 316.817687988
    scale_params: 383.814086914
    scale_params: 472.053131104
    scale_params: 732.633178711
    scale_params: 416.583282471
    scale_params: 108.331207275
    scale_params: 129.28578186
    scale_params: 0.0
    scale_params: 405.417205811
    scale_params: 123.051834106
    scale_params: 240.845825195
    scale_params: 508.220306396
    scale_params: 166.014099121
    scale_params: 352.961151123
    scale_params: 237.210983276
    scale_params: 102.247360229
    scale_params: 135.148147583
    scale_params: 147.438171387
    scale_params: 194.564834595
    scale_params: 369.398895264
    scale_params: 659.060791016
    scale_params: 319.798797607
    scale_params: 170.266769409
    scale_params: 217.117233276
    scale_params: 128.099609375
    scale_params: 251.627197266
    scale_params: 198.431091309
    scale_params: 195.718688965
    scale_params: 186.835113525
    scale_params: 332.078277588
    scale_params: 326.975769043
    scale_params: 290.719604492
    scale_params: 781.777709961
    scale_params: 221.591598511
    scale_params: 308.1668396
    scale_params: 369.751037598
    scale_params: 174.562042236
    scale_params: 471.774688721
    scale_params: 99.5213623047
    scale_params: 172.084716797
    scale_params: 153.52482605
    scale_params: 604.438903809
    scale_params: 598.424865723
    scale_params: 332.319366455
    scale_params: 266.628173828
    scale_params: 255.894607544
    scale_params: 282.599060059
    scale_params: 557.745178223
    scale_params: 97.0282440186
    scale_params: 354.802642822
    scale_params: 453.802459717
    scale_params: 319.801239014
    scale_params: 125.333251953
    scale_params: 74.9232177734
    scale_params: 0.0
    scale_params: 367.073486328
    scale_params: 233.4949646
    scale_params: 87.6563415527
    scale_params: 99.860206604
    scale_params: 141.500289917
    scale_params: 181.696502686
    scale_params: 62.8193054199
    scale_params: 327.56451416
    scale_params: 273.143035889
    scale_params: 350.88180542
    scale_params: 345.414428711
    scale_params: 105.270736694
    scale_params: 374.064147949
    scale_params: 695.517456055
    scale_params: 239.510406494
    scale_params: 203.173614502
    scale_params: 145.678878784
    scale_params: 159.132492065
    scale_params: 345.056030273
    scale_params: 121.605628967
    scale_params: 173.203948975
    scale_params: 119.779037476
    scale_params: 0.0
    scale_params: 229.053497314
    scale_params: 223.951721191
    scale_params: 210.767715454
    scale_params: 127.838516235
    scale_params: 198.053634644
    scale_params: 501.288726807
    scale_params: 487.923919678
    scale_params: 431.154968262
    scale_params: 50.1808929443
    scale_params: 307.459533691
    scale_params: 312.486877441
    scale_params: 148.760910034
    scale_params: 208.761764526
    scale_params: 406.273620605
    scale_params: 822.074645996
    scale_params: 285.959320068
    scale_params: 259.804779053
    scale_params: 52.2289619446
    scale_params: 163.918518066
    scale_params: 64.7357635498
    scale_params: 79.1611862183
    scale_params: 556.810424805
    scale_params: 119.341995239
    scale_params: 167.207809448
    scale_params: 316.032775879
    scale_params: 193.648635864
    scale_params: 126.400260925
    scale_params: 511.057739258
    scale_params: 78.8373947144
    scale_params: 148.299423218
    scale_params: 537.871459961
    scale_params: 94.2687683105
    scale_params: 308.364257812
    scale_params: 133.071746826
    scale_params: 55.9999351501
    scale_params: 0.0
    scale_params: 183.201919556
    scale_params: 509.395904541
  }
}
layer {
  name: "conv2/bn"
  type: "BatchNorm"
  bottom: "conv2"
  top: "conv2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "conv2/scale"
  type: "Scale"
  bottom: "conv2"
  top: "conv2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "conv2/relu"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "conv3/dw"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3/dw"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 128
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 6.65891981125
    scale_out: 9.45931816101
    scale_params: 90.7487411499
    scale_params: 158.827163696
    scale_params: 184.419021606
    scale_params: 88.538230896
    scale_params: 146.600967407
    scale_params: 61.966255188
    scale_params: 133.294692993
    scale_params: 273.19821167
    scale_params: 50.887878418
    scale_params: 134.834686279
    scale_params: 73.5164260864
    scale_params: 66.0389633179
    scale_params: 35.7180633545
    scale_params: 50.9010276794
    scale_params: 100.852363586
    scale_params: 29.3345546722
    scale_params: 63.9758605957
    scale_params: 60.0805130005
    scale_params: 71.9427719116
    scale_params: 0.0
    scale_params: 39.9079017639
    scale_params: 161.254928589
    scale_params: 46.8225326538
    scale_params: 48.8302650452
    scale_params: 76.5497360229
    scale_params: 58.7551574707
    scale_params: 27.6938800812
    scale_params: 120.540733337
    scale_params: 94.1267929077
    scale_params: 86.3947677612
    scale_params: 174.211349487
    scale_params: 106.035842896
    scale_params: 78.8629760742
    scale_params: 57.7724304199
    scale_params: 146.408279419
    scale_params: 68.2018432617
    scale_params: 180.582260132
    scale_params: 165.416656494
    scale_params: 138.581771851
    scale_params: 114.143241882
    scale_params: 80.5543823242
    scale_params: 844.641967773
    scale_params: 63.9430465698
    scale_params: 51.3494758606
    scale_params: 32.852306366
    scale_params: 118.223457336
    scale_params: 48.2422027588
    scale_params: 45.2621803284
    scale_params: 165.308227539
    scale_params: 34.3885536194
    scale_params: 123.689254761
    scale_params: 114.433387756
    scale_params: 47.3565864563
    scale_params: 46.3519363403
    scale_params: 59.1473503113
    scale_params: 66.4885559082
    scale_params: 45.3753890991
    scale_params: 30.0839309692
    scale_params: 50.0153465271
    scale_params: 46.384437561
    scale_params: 169.616195679
    scale_params: 37.062877655
    scale_params: 21.4390354156
    scale_params: 57.2488670349
    scale_params: 95.3131942749
    scale_params: 147.612091064
    scale_params: 0.0
    scale_params: 44.6650657654
    scale_params: 70.2968063354
    scale_params: 93.0362930298
    scale_params: 67.9547805786
    scale_params: 272.188934326
    scale_params: 103.369758606
    scale_params: 355.344940186
    scale_params: 50.3477058411
    scale_params: 29.6558742523
    scale_params: 64.8689193726
    scale_params: 55.9398994446
    scale_params: 269.855133057
    scale_params: 26.8444900513
    scale_params: 34.8501968384
    scale_params: 64.5462493896
    scale_params: 299.275512695
    scale_params: 121.3543396
    scale_params: 55.9980049133
    scale_params: 26.4303398132
    scale_params: 107.300209045
    scale_params: 161.128890991
    scale_params: 141.035842896
    scale_params: 0.0
    scale_params: 87.3951950073
    scale_params: 141.262741089
    scale_params: 62.2690887451
    scale_params: 130.152191162
    scale_params: 103.399223328
    scale_params: 27.818277359
    scale_params: 51.5523834229
    scale_params: 44.1466255188
    scale_params: 435.174316406
    scale_params: 73.4645767212
    scale_params: 55.2262840271
    scale_params: 35.2203865051
    scale_params: 100.928527832
    scale_params: 63.924659729
    scale_params: 48.5495491028
    scale_params: 66.2052230835
    scale_params: 58.7548408508
    scale_params: 609.566345215
    scale_params: 142.469009399
    scale_params: 247.755584717
    scale_params: 127.705055237
    scale_params: 47.1802444458
    scale_params: 215.255218506
    scale_params: 267.435119629
    scale_params: 98.9023742676
    scale_params: 74.9387588501
    scale_params: 118.474746704
    scale_params: 73.44165802
    scale_params: 586.954956055
    scale_params: 186.197418213
    scale_params: 23.0140628815
    scale_params: 165.289260864
    scale_params: 86.5059890747
    scale_params: 110.259162903
    scale_params: 120.133659363
    scale_params: 0.0
    scale_params: 186.124786377
    scale_params: 90.5023193359
  }
}
layer {
  name: "conv3/dw/bn"
  type: "BatchNorm"
  bottom: "conv3/dw"
  top: "conv3/dw"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "conv3/dw/scale"
  type: "Scale"
  bottom: "conv3/dw"
  top: "conv3/dw"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "conv3/dw/relu"
  type: "ReLU"
  bottom: "conv3/dw"
  top: "conv3/dw"
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv3/dw"
  top: "conv3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 9.45931816101
    scale_out: 6.92348241806
    scale_params: 452.390869141
    scale_params: 405.671905518
    scale_params: 362.732849121
    scale_params: 417.934295654
    scale_params: 236.346496582
    scale_params: 240.000091553
    scale_params: 283.884918213
    scale_params: 569.502929688
    scale_params: 265.192108154
    scale_params: 737.544555664
    scale_params: 229.484130859
    scale_params: 141.145675659
    scale_params: 251.816818237
    scale_params: 215.719726562
    scale_params: 309.099945068
    scale_params: 295.188842773
    scale_params: 672.67376709
    scale_params: 248.015991211
    scale_params: 498.675201416
    scale_params: 647.861450195
    scale_params: 353.693389893
    scale_params: 398.0909729
    scale_params: 223.138214111
    scale_params: 535.982727051
    scale_params: 271.684265137
    scale_params: 329.778381348
    scale_params: 468.308837891
    scale_params: 269.008331299
    scale_params: 297.428741455
    scale_params: 333.012908936
    scale_params: 428.819122314
    scale_params: 342.255645752
    scale_params: 0.0
    scale_params: 505.894256592
    scale_params: 438.395935059
    scale_params: 83.0800628662
    scale_params: 361.434753418
    scale_params: 584.280456543
    scale_params: 165.741760254
    scale_params: 285.980316162
    scale_params: 300.9453125
    scale_params: 708.828369141
    scale_params: 242.170318604
    scale_params: 270.702453613
    scale_params: 232.414321899
    scale_params: 418.937652588
    scale_params: 306.574249268
    scale_params: 297.834899902
    scale_params: 430.633270264
    scale_params: 140.001480103
    scale_params: 398.301422119
    scale_params: 383.392059326
    scale_params: 257.170928955
    scale_params: 236.884811401
    scale_params: 202.945724487
    scale_params: 160.554290771
    scale_params: 383.959472656
    scale_params: 387.010162354
    scale_params: 224.976821899
    scale_params: 167.85748291
    scale_params: 797.409912109
    scale_params: 117.777114868
    scale_params: 146.144210815
    scale_params: 489.112182617
    scale_params: 335.308135986
    scale_params: 368.19317627
    scale_params: 265.288818359
    scale_params: 545.713867188
    scale_params: 224.785049438
    scale_params: 282.289428711
    scale_params: 366.737701416
    scale_params: 237.200683594
    scale_params: 329.963989258
    scale_params: 271.085998535
    scale_params: 540.627441406
    scale_params: 226.952850342
    scale_params: 244.654769897
    scale_params: 359.114685059
    scale_params: 273.559356689
    scale_params: 621.430053711
    scale_params: 630.468383789
    scale_params: 81.0973129272
    scale_params: 481.14642334
    scale_params: 258.989135742
    scale_params: 299.980194092
    scale_params: 53.3864822388
    scale_params: 496.587432861
    scale_params: 459.044830322
    scale_params: 212.28817749
    scale_params: 278.291625977
    scale_params: 384.63067627
    scale_params: 48.8479232788
    scale_params: 214.844161987
    scale_params: 107.479919434
    scale_params: 226.995162964
    scale_params: 315.890167236
    scale_params: 323.47265625
    scale_params: 232.913085938
    scale_params: 294.675506592
    scale_params: 396.98348999
    scale_params: 432.889068604
    scale_params: 1756.64587402
    scale_params: 357.437408447
    scale_params: 554.590576172
    scale_params: 276.589630127
    scale_params: 337.536499023
    scale_params: 72.5550308228
    scale_params: 271.360321045
    scale_params: 195.509262085
    scale_params: 203.792877197
    scale_params: 227.635635376
    scale_params: 176.980758667
    scale_params: 319.173492432
    scale_params: 304.170837402
    scale_params: 303.077270508
    scale_params: 58.6093063354
    scale_params: 425.71472168
    scale_params: 363.540924072
    scale_params: 574.898498535
    scale_params: 638.650390625
    scale_params: 464.222412109
    scale_params: 239.394973755
    scale_params: 220.116912842
    scale_params: 366.4425354
    scale_params: 230.351898193
    scale_params: 227.697784424
    scale_params: 208.611862183
    scale_params: 266.353820801
  }
}
layer {
  name: "conv3/bn"
  type: "BatchNorm"
  bottom: "conv3"
  top: "conv3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "conv3/scale"
  type: "Scale"
  bottom: "conv3"
  top: "conv3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "conv3/relu"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4/dw"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4/dw"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 128
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 6.92348241806
    scale_out: 31.2922954559
    scale_params: 124.40423584
    scale_params: 153.723403931
    scale_params: 361.835845947
    scale_params: 179.101882935
    scale_params: 194.303314209
    scale_params: 434.322753906
    scale_params: 200.878768921
    scale_params: 130.181747437
    scale_params: 179.557723999
    scale_params: 203.983657837
    scale_params: 456.707977295
    scale_params: 221.216720581
    scale_params: 624.08996582
    scale_params: 227.533569336
    scale_params: 257.13949585
    scale_params: 363.191436768
    scale_params: 135.770996094
    scale_params: 217.946426392
    scale_params: 184.475372314
    scale_params: 181.88269043
    scale_params: 243.254547119
    scale_params: 182.079833984
    scale_params: 684.475891113
    scale_params: 250.027359009
    scale_params: 330.007781982
    scale_params: 197.707748413
    scale_params: 373.215576172
    scale_params: 251.284011841
    scale_params: 937.051818848
    scale_params: 309.254455566
    scale_params: 162.714080811
    scale_params: 146.562561035
    scale_params: 0.0
    scale_params: 197.340927124
    scale_params: 265.39263916
    scale_params: 1187.31054688
    scale_params: 322.13760376
    scale_params: 183.701507568
    scale_params: 312.898010254
    scale_params: 338.754486084
    scale_params: 380.420013428
    scale_params: 278.549499512
    scale_params: 485.75769043
    scale_params: 390.986633301
    scale_params: 213.662979126
    scale_params: 251.102737427
    scale_params: 386.700439453
    scale_params: 139.411453247
    scale_params: 183.66015625
    scale_params: 483.971679688
    scale_params: 304.780181885
    scale_params: 175.626647949
    scale_params: 247.287612915
    scale_params: 498.610412598
    scale_params: 516.4296875
    scale_params: 713.422058105
    scale_params: 503.875946045
    scale_params: 349.502502441
    scale_params: 167.925521851
    scale_params: 675.036682129
    scale_params: 151.738830566
    scale_params: 326.869018555
    scale_params: 256.467224121
    scale_params: 258.453094482
    scale_params: 138.937149048
    scale_params: 302.694671631
    scale_params: 132.668182373
    scale_params: 130.556549072
    scale_params: 307.551879883
    scale_params: 171.586578369
    scale_params: 244.244781494
    scale_params: 183.083786011
    scale_params: 253.093658447
    scale_params: 360.724975586
    scale_params: 280.97845459
    scale_params: 475.680206299
    scale_params: 323.010955811
    scale_params: 315.280273438
    scale_params: 512.451965332
    scale_params: 208.911117554
    scale_params: 158.846588135
    scale_params: 739.04864502
    scale_params: 259.058654785
    scale_params: 344.232086182
    scale_params: 142.470046997
    scale_params: 981.12286377
    scale_params: 203.150039673
    scale_params: 414.250640869
    scale_params: 306.579467773
    scale_params: 287.823394775
    scale_params: 282.49621582
    scale_params: 1962.52783203
    scale_params: 347.420928955
    scale_params: 437.515991211
    scale_params: 262.152069092
    scale_params: 448.16986084
    scale_params: 787.225952148
    scale_params: 269.397155762
    scale_params: 422.743499756
    scale_params: 428.623474121
    scale_params: 227.842834473
    scale_params: 90.5430297852
    scale_params: 236.984481812
    scale_params: 228.907241821
    scale_params: 235.588867188
    scale_params: 252.819778442
    scale_params: 349.415374756
    scale_params: 403.012817383
    scale_params: 311.87991333
    scale_params: 452.534454346
    scale_params: 356.430969238
    scale_params: 139.257125854
    scale_params: 189.569366455
    scale_params: 187.502075195
    scale_params: 127.359733582
    scale_params: 2092.69555664
    scale_params: 143.445373535
    scale_params: 356.600769043
    scale_params: 242.849456787
    scale_params: 193.134399414
    scale_params: 228.664169312
    scale_params: 237.52130127
    scale_params: 228.885971069
    scale_params: 267.597564697
    scale_params: 535.241882324
    scale_params: 415.476409912
    scale_params: 205.409835815
    scale_params: 290.891998291
  }
}
layer {
  name: "conv4/dw/bn"
  type: "BatchNorm"
  bottom: "conv4/dw"
  top: "conv4/dw"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "conv4/dw/scale"
  type: "Scale"
  bottom: "conv4/dw"
  top: "conv4/dw"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "conv4/dw/relu"
  type: "ReLU"
  bottom: "conv4/dw"
  top: "conv4/dw"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv4/dw"
  top: "conv4"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 31.2922954559
    scale_out: 20.1978340149
    scale_params: 380.739715576
    scale_params: 473.192108154
    scale_params: 514.319152832
    scale_params: 354.910064697
    scale_params: 595.191223145
    scale_params: 293.071929932
    scale_params: 221.101150513
    scale_params: 382.380432129
    scale_params: 224.188720703
    scale_params: 618.490905762
    scale_params: 658.592834473
    scale_params: 278.504730225
    scale_params: 381.689361572
    scale_params: 247.769958496
    scale_params: 160.039916992
    scale_params: 271.392578125
    scale_params: 143.729660034
    scale_params: 224.382904053
    scale_params: 432.406890869
    scale_params: 156.61050415
    scale_params: 448.305145264
    scale_params: 635.650756836
    scale_params: 444.642272949
    scale_params: 785.139831543
    scale_params: 275.706115723
    scale_params: 794.007202148
    scale_params: 307.245727539
    scale_params: 124.073173523
    scale_params: 289.504699707
    scale_params: 321.583770752
    scale_params: 390.895874023
    scale_params: 323.064361572
    scale_params: 270.667938232
    scale_params: 152.35194397
    scale_params: 174.022384644
    scale_params: 264.030487061
    scale_params: 455.142669678
    scale_params: 514.607421875
    scale_params: 615.254821777
    scale_params: 226.528213501
    scale_params: 1027.82275391
    scale_params: 594.13885498
    scale_params: 129.37109375
    scale_params: 160.424057007
    scale_params: 271.374389648
    scale_params: 882.119262695
    scale_params: 224.822875977
    scale_params: 97.0685195923
    scale_params: 709.802734375
    scale_params: 1129.77539062
    scale_params: 779.738647461
    scale_params: 380.24609375
    scale_params: 212.723419189
    scale_params: 366.7293396
    scale_params: 244.025695801
    scale_params: 286.127288818
    scale_params: 233.353622437
    scale_params: 598.376098633
    scale_params: 202.731048584
    scale_params: 484.040588379
    scale_params: 507.093780518
    scale_params: 569.779968262
    scale_params: 743.128662109
    scale_params: 150.326278687
    scale_params: 319.816619873
    scale_params: 535.990722656
    scale_params: 717.069641113
    scale_params: 413.046508789
    scale_params: 401.938140869
    scale_params: 207.538330078
    scale_params: 279.484741211
    scale_params: 213.724624634
    scale_params: 315.712493896
    scale_params: 72.4383468628
    scale_params: 190.356918335
    scale_params: 691.25390625
    scale_params: 519.53527832
    scale_params: 308.974517822
    scale_params: 1134.22290039
    scale_params: 257.330566406
    scale_params: 340.978973389
    scale_params: 2279.73828125
    scale_params: 441.676422119
    scale_params: 207.136428833
    scale_params: 171.942428589
    scale_params: 447.603057861
    scale_params: 130.158950806
    scale_params: 329.272705078
    scale_params: 494.042266846
    scale_params: 253.568161011
    scale_params: 423.889190674
    scale_params: 268.376739502
    scale_params: 784.654174805
    scale_params: 242.133026123
    scale_params: 1036.9675293
    scale_params: 243.377319336
    scale_params: 693.629211426
    scale_params: 391.844177246
    scale_params: 1001.8125
    scale_params: 309.813171387
    scale_params: 296.631835938
    scale_params: 403.936462402
    scale_params: 441.381622314
    scale_params: 202.640777588
    scale_params: 428.764648438
    scale_params: 200.579086304
    scale_params: 181.800811768
    scale_params: 207.854187012
    scale_params: 686.346679688
    scale_params: 293.539428711
    scale_params: 357.04876709
    scale_params: 568.093994141
    scale_params: 168.832244873
    scale_params: 404.63470459
    scale_params: 318.762969971
    scale_params: 574.475891113
    scale_params: 243.7474823
    scale_params: 291.525054932
    scale_params: 421.141082764
    scale_params: 211.127548218
    scale_params: 537.164428711
    scale_params: 275.665802002
    scale_params: 620.067382812
    scale_params: 260.27444458
    scale_params: 436.414916992
    scale_params: 409.970916748
    scale_params: 866.659423828
    scale_params: 838.451416016
    scale_params: 230.023880005
    scale_params: 392.139160156
    scale_params: 484.790466309
    scale_params: 127.274536133
    scale_params: 448.804840088
    scale_params: 349.669586182
    scale_params: 348.675201416
    scale_params: 289.579711914
    scale_params: 103.687522888
    scale_params: 196.052108765
    scale_params: 397.451721191
    scale_params: 302.077026367
    scale_params: 550.317932129
    scale_params: 524.351928711
    scale_params: 593.093261719
    scale_params: 779.356201172
    scale_params: 389.128326416
    scale_params: 378.429534912
    scale_params: 380.455871582
    scale_params: 623.122375488
    scale_params: 168.683044434
    scale_params: 460.242828369
    scale_params: 895.342346191
    scale_params: 236.986068726
    scale_params: 478.912200928
    scale_params: 276.187774658
    scale_params: 372.576416016
    scale_params: 295.155853271
    scale_params: 201.953430176
    scale_params: 524.758666992
    scale_params: 317.635253906
    scale_params: 310.816741943
    scale_params: 277.236480713
    scale_params: 527.690795898
    scale_params: 160.45690918
    scale_params: 358.42855835
    scale_params: 241.624710083
    scale_params: 736.219116211
    scale_params: 154.906768799
    scale_params: 282.152496338
    scale_params: 351.291931152
    scale_params: 174.211837769
    scale_params: 375.372406006
    scale_params: 374.545196533
    scale_params: 366.210571289
    scale_params: 449.326446533
    scale_params: 203.95753479
    scale_params: 436.673828125
    scale_params: 138.097366333
    scale_params: 555.329956055
    scale_params: 862.949645996
    scale_params: 434.347412109
    scale_params: 217.871276855
    scale_params: 284.517791748
    scale_params: 281.986968994
    scale_params: 326.029815674
    scale_params: 200.287628174
    scale_params: 1402.14770508
    scale_params: 583.402038574
    scale_params: 477.175506592
    scale_params: 785.439331055
    scale_params: 369.013397217
    scale_params: 500.761810303
    scale_params: 300.787506104
    scale_params: 466.923187256
    scale_params: 287.451660156
    scale_params: 602.733032227
    scale_params: 611.544372559
    scale_params: 329.368377686
    scale_params: 204.140151978
    scale_params: 586.268127441
    scale_params: 331.738739014
    scale_params: 802.937866211
    scale_params: 278.487426758
    scale_params: 170.023040771
    scale_params: 367.965820312
    scale_params: 492.776428223
    scale_params: 800.690856934
    scale_params: 1107.72241211
    scale_params: 347.037017822
    scale_params: 221.230285645
    scale_params: 379.308685303
    scale_params: 218.308807373
    scale_params: 349.637390137
    scale_params: 470.900299072
    scale_params: 318.450164795
    scale_params: 462.909088135
    scale_params: 275.095336914
    scale_params: 614.226257324
    scale_params: 832.337219238
    scale_params: 385.647216797
    scale_params: 333.531768799
    scale_params: 364.765106201
    scale_params: 493.089996338
    scale_params: 266.258026123
    scale_params: 181.013824463
    scale_params: 326.33581543
    scale_params: 279.289764404
    scale_params: 549.386413574
    scale_params: 802.087402344
    scale_params: 550.108703613
    scale_params: 545.242980957
    scale_params: 1001.90374756
    scale_params: 263.738220215
    scale_params: 492.132843018
    scale_params: 429.916290283
    scale_params: 465.937713623
    scale_params: 292.681793213
    scale_params: 412.581298828
    scale_params: 569.348815918
    scale_params: 646.310668945
    scale_params: 445.97088623
    scale_params: 292.733734131
    scale_params: 399.773834229
    scale_params: 457.094787598
    scale_params: 285.803588867
    scale_params: 277.161895752
    scale_params: 263.793579102
    scale_params: 242.040542603
    scale_params: 354.69708252
    scale_params: 186.043899536
    scale_params: 372.300231934
    scale_params: 365.961303711
    scale_params: 508.691650391
    scale_params: 90.8894119263
    scale_params: 667.851928711
    scale_params: 209.346954346
    scale_params: 436.836181641
  }
}
layer {
  name: "conv4/bn"
  type: "BatchNorm"
  bottom: "conv4"
  top: "conv4"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "conv4/scale"
  type: "Scale"
  bottom: "conv4"
  top: "conv4"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "conv4/relu"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5/dw"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5/dw"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 20.1978340149
    scale_out: 19.2210826874
    scale_params: 150.73550415
    scale_params: 99.0492858887
    scale_params: 122.309768677
    scale_params: 96.8177947998
    scale_params: 83.8853378296
    scale_params: 176.809799194
    scale_params: 183.809616089
    scale_params: 98.0307540894
    scale_params: 496.667297363
    scale_params: 70.2906570435
    scale_params: 64.3895492554
    scale_params: 131.093566895
    scale_params: 67.374671936
    scale_params: 279.062194824
    scale_params: 196.639160156
    scale_params: 219.525756836
    scale_params: 339.586517334
    scale_params: 104.717170715
    scale_params: 109.887413025
    scale_params: 287.293212891
    scale_params: 70.3194274902
    scale_params: 110.16191864
    scale_params: 126.254615784
    scale_params: 101.372169495
    scale_params: 185.238952637
    scale_params: 67.0542602539
    scale_params: 200.157440186
    scale_params: 131.03453064
    scale_params: 125.991706848
    scale_params: 111.702468872
    scale_params: 121.600769043
    scale_params: 178.356185913
    scale_params: 184.113189697
    scale_params: 199.736343384
    scale_params: 379.672332764
    scale_params: 79.85987854
    scale_params: 67.0570755005
    scale_params: 198.403442383
    scale_params: 92.6676635742
    scale_params: 191.460845947
    scale_params: 45.1201438904
    scale_params: 54.3573646545
    scale_params: 488.917510986
    scale_params: 431.20501709
    scale_params: 167.575775146
    scale_params: 53.9828910828
    scale_params: 123.124290466
    scale_params: 329.254516602
    scale_params: 180.881759644
    scale_params: 51.6050338745
    scale_params: 188.794555664
    scale_params: 188.377075195
    scale_params: 331.126800537
    scale_params: 291.458740234
    scale_params: 82.0075912476
    scale_params: 131.748916626
    scale_params: 645.867248535
    scale_params: 114.618110657
    scale_params: 225.243591309
    scale_params: 139.826705933
    scale_params: 54.7090568542
    scale_params: 107.636238098
    scale_params: 63.587059021
    scale_params: 200.645004272
    scale_params: 110.040618896
    scale_params: 75.4406051636
    scale_params: 40.7863082886
    scale_params: 150.160354614
    scale_params: 91.7823562622
    scale_params: 181.060653687
    scale_params: 153.788452148
    scale_params: 159.881561279
    scale_params: 164.577987671
    scale_params: 158.518051147
    scale_params: 609.109741211
    scale_params: 41.8941383362
    scale_params: 88.3430862427
    scale_params: 151.21043396
    scale_params: 51.889919281
    scale_params: 417.257049561
    scale_params: 222.880813599
    scale_params: 21.3218917847
    scale_params: 81.3881835938
    scale_params: 252.758300781
    scale_params: 582.073669434
    scale_params: 179.299865723
    scale_params: 187.970977783
    scale_params: 109.679336548
    scale_params: 67.912902832
    scale_params: 548.498901367
    scale_params: 247.158096313
    scale_params: 149.407485962
    scale_params: 157.74256897
    scale_params: 135.813995361
    scale_params: 92.7315826416
    scale_params: 194.112060547
    scale_params: 49.9655036926
    scale_params: 93.2136001587
    scale_params: 61.4415054321
    scale_params: 123.617935181
    scale_params: 204.363937378
    scale_params: 152.577407837
    scale_params: 78.7569503784
    scale_params: 495.571960449
    scale_params: 67.5440979004
    scale_params: 291.292785645
    scale_params: 52.8017425537
    scale_params: 340.045532227
    scale_params: 59.2730636597
    scale_params: 80.600769043
    scale_params: 143.769805908
    scale_params: 154.933929443
    scale_params: 210.471221924
    scale_params: 52.2675209045
    scale_params: 219.382705688
    scale_params: 116.690383911
    scale_params: 143.440048218
    scale_params: 212.190185547
    scale_params: 62.7447471619
    scale_params: 294.965881348
    scale_params: 106.945617676
    scale_params: 134.937332153
    scale_params: 71.9728317261
    scale_params: 195.156936646
    scale_params: 137.887359619
    scale_params: 77.7713775635
    scale_params: 77.2288284302
    scale_params: 69.5118255615
    scale_params: 295.140289307
    scale_params: 73.3169326782
    scale_params: 117.448013306
    scale_params: 650.728027344
    scale_params: 151.27482605
    scale_params: 136.490661621
    scale_params: 77.037399292
    scale_params: 135.079193115
    scale_params: 459.773590088
    scale_params: 605.854736328
    scale_params: 72.3203735352
    scale_params: 154.657485962
    scale_params: 79.1142654419
    scale_params: 75.7865371704
    scale_params: 81.5115280151
    scale_params: 71.3257141113
    scale_params: 150.390853882
    scale_params: 90.1280212402
    scale_params: 127.431777954
    scale_params: 107.324081421
    scale_params: 224.73324585
    scale_params: 69.4777755737
    scale_params: 51.1124725342
    scale_params: 269.158111572
    scale_params: 80.8133926392
    scale_params: 203.99508667
    scale_params: 76.6974716187
    scale_params: 150.200393677
    scale_params: 195.095565796
    scale_params: 108.931083679
    scale_params: 171.180221558
    scale_params: 165.760223389
    scale_params: 292.129974365
    scale_params: 58.2452392578
    scale_params: 474.058776855
    scale_params: 104.827041626
    scale_params: 201.340545654
    scale_params: 88.2639694214
    scale_params: 726.266723633
    scale_params: 74.7992935181
    scale_params: 316.046875
    scale_params: 142.670913696
    scale_params: 287.461578369
    scale_params: 150.644180298
    scale_params: 140.589279175
    scale_params: 112.575111389
    scale_params: 732.098815918
    scale_params: 96.3388748169
    scale_params: 177.989547729
    scale_params: 153.115325928
    scale_params: 71.1708679199
    scale_params: 72.6368942261
    scale_params: 267.056365967
    scale_params: 102.414962769
    scale_params: 292.281555176
    scale_params: 112.679450989
    scale_params: 242.417648315
    scale_params: 51.4400177002
    scale_params: 108.706672668
    scale_params: 67.3247756958
    scale_params: 87.7705764771
    scale_params: 142.938522339
    scale_params: 155.780548096
    scale_params: 129.803085327
    scale_params: 155.57623291
    scale_params: 413.029296875
    scale_params: 226.416244507
    scale_params: 105.540725708
    scale_params: 72.275718689
    scale_params: 194.026351929
    scale_params: 134.872329712
    scale_params: 172.131164551
    scale_params: 61.756313324
    scale_params: 244.365905762
    scale_params: 243.727157593
    scale_params: 107.698936462
    scale_params: 155.482040405
    scale_params: 66.505897522
    scale_params: 70.8705368042
    scale_params: 171.936340332
    scale_params: 124.876960754
    scale_params: 151.033370972
    scale_params: 158.796920776
    scale_params: 110.666870117
    scale_params: 71.8973922729
    scale_params: 150.087005615
    scale_params: 86.1379394531
    scale_params: 189.534347534
    scale_params: 118.888717651
    scale_params: 37.5441818237
    scale_params: 155.954498291
    scale_params: 177.233917236
    scale_params: 151.78503418
    scale_params: 101.804664612
    scale_params: 143.245880127
    scale_params: 138.323501587
    scale_params: 143.416351318
    scale_params: 151.943557739
    scale_params: 45.7707672119
    scale_params: 63.0256576538
    scale_params: 150.10383606
    scale_params: 51.3406219482
    scale_params: 60.0458984375
    scale_params: 153.973098755
    scale_params: 80.3742752075
    scale_params: 206.983764648
    scale_params: 121.108268738
    scale_params: 98.7863769531
    scale_params: 108.741348267
    scale_params: 172.387573242
    scale_params: 67.0975036621
    scale_params: 85.7590866089
    scale_params: 113.259590149
    scale_params: 106.167694092
    scale_params: 469.302154541
    scale_params: 138.238632202
    scale_params: 125.42665863
    scale_params: 242.235397339
    scale_params: 201.440933228
    scale_params: 112.174186707
    scale_params: 156.586593628
    scale_params: 60.7458305359
    scale_params: 96.2169113159
    scale_params: 212.932830811
    scale_params: 431.017089844
    scale_params: 131.667861938
    scale_params: 259.584411621
    scale_params: 82.6767044067
  }
}
layer {
  name: "conv5/dw/bn"
  type: "BatchNorm"
  bottom: "conv5/dw"
  top: "conv5/dw"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "conv5/dw/scale"
  type: "Scale"
  bottom: "conv5/dw"
  top: "conv5/dw"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "conv5/dw/relu"
  type: "ReLU"
  bottom: "conv5/dw"
  top: "conv5/dw"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv5/dw"
  top: "conv5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 19.2210826874
    scale_out: 24.0942649841
    scale_params: 117.769233704
    scale_params: 248.940597534
    scale_params: 498.781951904
    scale_params: 421.174957275
    scale_params: 758.645324707
    scale_params: 457.183197021
    scale_params: 1131.28356934
    scale_params: 374.912658691
    scale_params: 338.124847412
    scale_params: 277.18762207
    scale_params: 400.75604248
    scale_params: 344.66583252
    scale_params: 429.172821045
    scale_params: 871.343994141
    scale_params: 597.41192627
    scale_params: 205.326095581
    scale_params: 479.578399658
    scale_params: 575.856201172
    scale_params: 370.917755127
    scale_params: 447.67010498
    scale_params: 367.565795898
    scale_params: 295.881835938
    scale_params: 0.0
    scale_params: 886.662902832
    scale_params: 194.298355103
    scale_params: 255.442153931
    scale_params: 507.342529297
    scale_params: 417.347717285
    scale_params: 374.381378174
    scale_params: 339.146484375
    scale_params: 425.8175354
    scale_params: 183.013717651
    scale_params: 594.070678711
    scale_params: 492.958557129
    scale_params: 309.033111572
    scale_params: 376.153442383
    scale_params: 348.468261719
    scale_params: 217.933258057
    scale_params: 256.51385498
