name: "yolov2"
layer {
  name: "data"
  type: "DummyData"
  top: "data"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 0.01
    }
    shape {
      dim: 32
      dim: 3
      dim: 544
      dim: 544
    }
  }
}
layer {
  name: "data"
  type: "DummyData"
  top: "label"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 1
    }
    shape {
      dim: 1
      dim: 1
      dim: 1
      dim: 8
    }
  }
}
layer {
  name: "layer1-conv"
  type: "Convolution"
  bottom: "data"
  top: "layer1-conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "layer1-bn"
  type: "BatchNorm"
  bottom: "layer1-conv"
  top: "layer1-conv"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "layer1-scale"
  type: "Scale"
  bottom: "layer1-conv"
  top: "layer1-conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "layer1-act"
  type: "ReLU"
  bottom: "layer1-conv"
  top: "layer1-conv"
  relu_param {
    negative_slope: 0.0
  }
}
layer {
  name: "layer2-maxpool"
  type: "Pooling"
  bottom: "layer1-conv"
  top: "layer2-maxpool"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "layer3-conv"
  type: "Convolution"
  bottom: "layer2-maxpool"
  top: "layer3-conv"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 14.1342363358
    scale_out: 5.11548805237
    scale_params: 1435.140625
    scale_params: 878.553771973
    scale_params: 141.516220093
    scale_params: 525.462585449
    scale_params: 434.804199219
    scale_params: 477.665710449
    scale_params: 796.670227051
    scale_params: 301.627716064
    scale_params: 927.535888672
    scale_params: 348.136993408
    scale_params: 122.350845337
    scale_params: 307.39553833
    scale_params: 344.012573242
    scale_params: 2157.28857422
    scale_params: 541.550231934
    scale_params: 289.741668701
    scale_params: 283.050323486
    scale_params: 692.754516602
    scale_params: 177.813339233
    scale_params: 318.43347168
    scale_params: 250.770645142
    scale_params: 844.971435547
    scale_params: 548.127380371
    scale_params: 564.895446777
    scale_params: 159.45425415
    scale_params: 603.991699219
    scale_params: 413.319549561
    scale_params: 1194.97192383
    scale_params: 393.322174072
    scale_params: 769.42767334
    scale_params: 262.636322021
    scale_params: 281.862426758
    scale_params: 400.98828125
    scale_params: 448.167755127
    scale_params: 386.605072021
    scale_params: 338.557861328
    scale_params: 911.648681641
    scale_params: 592.714416504
    scale_params: 301.906677246
    scale_params: 259.63470459
    scale_params: 166.571685791
    scale_params: 412.487579346
    scale_params: 1144.91503906
    scale_params: 430.785064697
    scale_params: 415.301177979
    scale_params: 335.6690979
    scale_params: 272.224395752
    scale_params: 347.492584229
    scale_params: 899.627929688
    scale_params: 230.990249634
    scale_params: 282.881774902
    scale_params: 234.923873901
    scale_params: 353.132965088
    scale_params: 244.554656982
    scale_params: 2167.5300293
    scale_params: 315.781860352
    scale_params: 340.040405273
    scale_params: 449.546142578
    scale_params: 452.753540039
    scale_params: 345.152648926
    scale_params: 458.159057617
    scale_params: 989.380310059
    scale_params: 227.357711792
    scale_params: 1088.25415039
  }
}
layer {
  name: "layer3-bn"
  type: "BatchNorm"
  bottom: "layer3-conv"
  top: "layer3-conv"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "layer3-scale"
  type: "Scale"
  bottom: "layer3-conv"
  top: "layer3-conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "layer3-act"
  type: "ReLU"
  bottom: "layer3-conv"
  top: "layer3-conv"
  relu_param {
    negative_slope: 0.0
  }
}
layer {
  name: "layer4-maxpool"
  type: "Pooling"
  bottom: "layer3-conv"
  top: "layer4-maxpool"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "layer5-conv"
  type: "Convolution"
  bottom: "layer4-maxpool"
  top: "layer5-conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 10.2712554932
    scale_out: 7.44446659088
    scale_params: 825.272827148
    scale_params: 859.756286621
    scale_params: 1023.37591553
    scale_params: 724.442199707
    scale_params: 860.23840332
    scale_params: 942.718078613
    scale_params: 1128.45361328
    scale_params: 1026.15893555
    scale_params: 904.205383301
    scale_params: 1053.23254395
    scale_params: 573.594726562
    scale_params: 1474.11108398
    scale_params: 875.39630127
    scale_params: 744.164672852
    scale_params: 484.120697021
    scale_params: 730.869445801
    scale_params: 702.858093262
    scale_params: 722.519775391
    scale_params: 951.230957031
    scale_params: 977.20513916
    scale_params: 917.968261719
    scale_params: 548.06060791
    scale_params: 630.63848877
    scale_params: 2609.9453125
    scale_params: 1081.72509766
    scale_params: 472.380218506
    scale_params: 661.667785645
    scale_params: 698.43737793
    scale_params: 921.055114746
    scale_params: 747.941162109
    scale_params: 1564.6953125
    scale_params: 1442.82507324
    scale_params: 849.329650879
    scale_params: 808.410461426
    scale_params: 732.877441406
    scale_params: 587.994262695
    scale_params: 828.057983398
    scale_params: 845.292114258
    scale_params: 871.41003418
    scale_params: 334.09197998
    scale_params: 789.592468262
    scale_params: 662.066162109
    scale_params: 1993.74633789
    scale_params: 606.396850586
    scale_params: 804.434387207
    scale_params: 2144.44555664
    scale_params: 1215.69384766
    scale_params: 688.208557129
    scale_params: 902.465698242
    scale_params: 307.030700684
    scale_params: 1334.80053711
    scale_params: 3048.578125
    scale_params: 1923.5456543
    scale_params: 2933.17504883
    scale_params: 1128.42382812
    scale_params: 712.229248047
    scale_params: 911.222473145
    scale_params: 901.013366699
    scale_params: 593.434387207
    scale_params: 1051.61938477
    scale_params: 766.010620117
    scale_params: 543.88494873
    scale_params: 1059.00720215
    scale_params: 618.092834473
    scale_params: 788.669128418
    scale_params: 792.440246582
    scale_params: 913.512207031
    scale_params: 894.307434082
    scale_params: 832.326782227
    scale_params: 882.24987793
    scale_params: 604.414550781
    scale_params: 688.979736328
    scale_params: 473.75958252
    scale_params: 825.428405762
    scale_params: 1426.81079102
    scale_params: 715.971008301
    scale_params: 742.084655762
    scale_params: 645.348754883
    scale_params: 742.085449219
    scale_params: 810.360107422
    scale_params: 2498.81469727
    scale_params: 898.75592041
    scale_params: 862.692077637
    scale_params: 909.484008789
    scale_params: 1074.93664551
    scale_params: 764.69342041
    scale_params: 932.426574707
    scale_params: 1566.5657959
    scale_params: 782.802307129
    scale_params: 569.285949707
    scale_params: 1006.88299561
    scale_params: 641.874816895
    scale_params: 1316.32849121
    scale_params: 1298.01928711
    scale_params: 697.627441406
    scale_params: 797.689575195
    scale_params: 833.107910156
    scale_params: 993.75213623
    scale_params: 1959.37768555
    scale_params: 1660.8013916
    scale_params: 768.142944336
    scale_params: 453.359588623
    scale_params: 873.410339355
    scale_params: 975.812866211
    scale_params: 1032.96435547
    scale_params: 885.417541504
    scale_params: 730.074035645
    scale_params: 557.954467773
    scale_params: 2210.49755859
    scale_params: 946.967468262
    scale_params: 1436.7890625
    scale_params: 595.969848633
    scale_params: 719.116638184
    scale_params: 554.831176758
    scale_params: 1352.84851074
    scale_params: 942.950866699
    scale_params: 1676.65039062
    scale_params: 883.142456055
    scale_params: 2411.20703125
    scale_params: 633.757202148
    scale_params: 885.989501953
    scale_params: 1160.64562988
    scale_params: 1154.04711914
    scale_params: 660.570617676
    scale_params: 837.486022949
    scale_params: 657.278076172
    scale_params: 601.504943848
    scale_params: 596.053894043
  }
}
layer {
  name: "layer5-bn"
  type: "BatchNorm"
  bottom: "layer5-conv"
  top: "layer5-conv"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "layer5-scale"
  type: "Scale"
  bottom: "layer5-conv"
  top: "layer5-conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "layer5-act"
  type: "ReLU"
  bottom: "layer5-conv"
  top: "layer5-conv"
  relu_param {
    negative_slope: 0.0
  }
}
layer {
  name: "layer6-conv"
  type: "Convolution"
  bottom: "layer5-conv"
  top: "layer6-conv"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 14.9475517273
    scale_out: 3.78566479683
    scale_params: 188.082839966
    scale_params: 209.889663696
    scale_params: 263.357391357
    scale_params: 320.32611084
    scale_params: 169.795608521
    scale_params: 195.705200195
    scale_params: 433.304229736
    scale_params: 203.00088501
    scale_params: 93.1647338867
    scale_params: 312.498046875
    scale_params: 226.024902344
    scale_params: 161.324691772
    scale_params: 160.242218018
    scale_params: 494.105834961
    scale_params: 286.650543213
    scale_params: 192.719451904
    scale_params: 261.261047363
    scale_params: 108.429115295
    scale_params: 300.620147705
    scale_params: 160.941085815
    scale_params: 164.223449707
    scale_params: 208.92590332
    scale_params: 162.719436646
    scale_params: 796.732177734
    scale_params: 176.979324341
    scale_params: 220.491912842
    scale_params: 292.151428223
    scale_params: 108.656776428
    scale_params: 153.298919678
    scale_params: 107.133407593
    scale_params: 207.59664917
    scale_params: 238.146728516
    scale_params: 97.8419418335
    scale_params: 367.858337402
    scale_params: 101.39655304
    scale_params: 394.04196167
    scale_params: 131.041931152
    scale_params: 94.2975463867
    scale_params: 180.980514526
    scale_params: 186.02104187
    scale_params: 108.988624573
    scale_params: 133.15788269
    scale_params: 205.529769897
    scale_params: 124.780021667
    scale_params: 207.253234863
    scale_params: 145.385543823
    scale_params: 85.4334793091
    scale_params: 192.354141235
    scale_params: 142.963943481
    scale_params: 396.891204834
    scale_params: 282.946960449
    scale_params: 191.525268555
    scale_params: 118.58001709
    scale_params: 210.008529663
    scale_params: 144.989318848
    scale_params: 188.5105896
    scale_params: 178.697479248
    scale_params: 187.66809082
    scale_params: 186.583465576
    scale_params: 173.080505371
    scale_params: 222.887176514
    scale_params: 179.228622437
    scale_params: 169.479797363
    scale_params: 196.486221313
  }
}
layer {
  name: "layer6-bn"
  type: "BatchNorm"
  bottom: "layer6-conv"
  top: "layer6-conv"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "layer6-scale"
  type: "Scale"
  bottom: "layer6-conv"
  top: "layer6-conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "layer6-act"
  type: "ReLU"
  bottom: "layer6-conv"
  top: "layer6-conv"
  relu_param {
    negative_slope: 0.0
  }
}
layer {
  name: "layer7-conv"
  type: "Convolution"
  bottom: "layer6-conv"
  top: "layer7-conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 7.60113811493
    scale_out: 6.80301141739
    scale_params: 423.533935547
    scale_params: 912.635009766
    scale_params: 650.321350098
    scale_params: 884.632263184
    scale_params: 394.874420166
    scale_params: 641.434143066
    scale_params: 1263.67224121
    scale_params: 409.069519043
    scale_params: 1309.57727051
    scale_params: 829.002685547
    scale_params: 805.071594238
    scale_params: 596.026428223
    scale_params: 780.343505859
    scale_params: 324.40335083
    scale_params: 858.135559082
    scale_params: 1101.63781738
    scale_params: 491.404876709
    scale_params: 1078.59204102
    scale_params: 2138.91113281
    scale_params: 1035.22033691
    scale_params: 702.738647461
    scale_params: 1080.36694336
    scale_params: 1044.90893555
    scale_params: 1075.50158691
    scale_params: 608.519287109
    scale_params: 1197.84399414
    scale_params: 964.718261719
    scale_params: 471.889251709
    scale_params: 953.52935791
    scale_params: 1229.77697754
    scale_params: 1268.83508301
    scale_params: 621.992980957
    scale_params: 607.018005371
    scale_params: 445.069000244
    scale_params: 2595.07055664
    scale_params: 691.156860352
    scale_params: 378.092956543
    scale_params: 1023.98406982
    scale_params: 533.167053223
    scale_params: 847.921691895
    scale_params: 268.895080566
    scale_params: 774.840148926
    scale_params: 1431.09228516
    scale_params: 682.284912109
    scale_params: 876.36920166
    scale_params: 916.71673584
    scale_params: 894.8984375
    scale_params: 678.099731445
    scale_params: 1102.98327637
    scale_params: 1329.57287598
    scale_params: 663.047180176
    scale_params: 847.471069336
    scale_params: 783.672729492
    scale_params: 980.936828613
    scale_params: 774.338928223
    scale_params: 449.509216309
    scale_params: 714.394165039
    scale_params: 1093.4276123
    scale_params: 341.594818115
    scale_params: 921.637329102
    scale_params: 535.431152344
    scale_params: 713.444152832
    scale_params: 484.346466064
    scale_params: 648.917602539
    scale_params: 378.060638428
    scale_params: 1077.67993164
    scale_params: 1451.50134277
    scale_params: 1232.18591309
    scale_params: 931.905395508
    scale_params: 459.274261475
    scale_params: 1151.00524902
    scale_params: 1132.17932129
    scale_params: 1090.00720215
    scale_params: 1962.7800293
    scale_params: 776.866943359
    scale_params: 1609.80419922
    scale_params: 1090.96203613
    scale_params: 574.75378418
    scale_params: 1125.78210449
    scale_params: 1208.50549316
    scale_params: 659.123962402
    scale_params: 943.569396973
    scale_params: 1151.39025879
    scale_params: 496.98135376
    scale_params: 915.185241699
    scale_params: 563.373962402
    scale_params: 1193.31164551
    scale_params: 929.823608398
    scale_params: 1820.26245117
    scale_params: 1272.33496094
    scale_params: 727.467346191
    scale_params: 1916.41162109
    scale_params: 792.230224609
    scale_params: 1142.76464844
    scale_params: 513.393493652
    scale_params: 916.648925781
    scale_params: 1054.93212891
    scale_params: 1170.78259277
    scale_params: 541.02746582
    scale_params: 838.793823242
    scale_params: 1169.75183105
    scale_params: 1054.17700195
    scale_params: 1128.83544922
    scale_params: 841.808288574
    scale_params: 806.117797852
    scale_params: 614.284790039
    scale_params: 2230.52197266
    scale_params: 763.244445801
    scale_params: 857.251281738
    scale_params: 1069.9810791
    scale_params: 1303.17150879
    scale_params: 671.004211426
    scale_params: 905.991088867
    scale_params: 785.364074707
    scale_params: 1378.59204102
    scale_params: 934.839355469
    scale_params: 1135.0604248
    scale_params: 927.882019043
    scale_params: 913.780822754
    scale_params: 689.268859863
    scale_params: 1065.12451172
    scale_params: 544.324645996
    scale_params: 1346.70556641
    scale_params: 862.455749512
    scale_params: 1150.76269531
    scale_params: 631.458557129
    scale_params: 711.252319336
    scale_params: 834.213439941
  }
}
layer {
  name: "layer7-bn"
  type: "BatchNorm"
  bottom: "layer7-conv"
  top: "layer7-conv"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "layer7-scale"
  type: "Scale"
  bottom: "layer7-conv"
  top: "layer7-conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "layer7-act"
  type: "ReLU"
  bottom: "layer7-conv"
  top: "layer7-conv"
  relu_param {
    negative_slope: 0.0
  }
}
layer {
  name: "layer8-maxpool"
  type: "Pooling"
  bottom: "layer7-conv"
  top: "layer8-maxpool"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "layer9-conv"
  type: "Convolution"
  bottom: "layer8-maxpool"
  top: "layer9-conv"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 13.6595897675
    scale_out: 8.71234798431
    scale_params: 1235.87451172
    scale_params: 1439.37207031
    scale_params: 238.327041626
    scale_params: 1322.47705078
    scale_params: 908.477539062
    scale_params: 1197.52868652
    scale_params: 731.357971191
    scale_params: 808.25769043
    scale_params: 851.436828613
    scale_params: 647.262329102
    scale_params: 1636.94445801
    scale_params: 1958.86999512
    scale_params: 1117.97692871
    scale_params: 1024.12768555
    scale_params: 1140.16162109
    scale_params: 1398.70458984
    scale_params: 620.070800781
    scale_params: 1162.89318848
    scale_params: 1050.70788574
    scale_params: 1621.74658203
    scale_params: 1051.32202148
    scale_params: 1487.78015137
    scale_params: 1107.48474121
    scale_params: 924.055847168
    scale_params: 1085.00769043
    scale_params: 1027.63110352
    scale_params: 797.509521484
    scale_params: 949.595703125
    scale_params: 552.212158203
    scale_params: 942.523742676
    scale_params: 1332.73864746
    scale_params: 1068.61425781
    scale_params: 1329.29418945
    scale_params: 981.797363281
    scale_params: 928.675415039
    scale_params: 1681.55529785
    scale_params: 1146.67590332
    scale_params: 812.720336914
    scale_params: 1550.24987793
    scale_params: 1145.36022949
    scale_params: 1149.69348145
    scale_params: 1413.92028809
    scale_params: 1098.89074707
    scale_params: 1289.21386719
    scale_params: 834.918945312
    scale_params: 2212.67480469
    scale_params: 1117.49206543
    scale_params: 1489.28393555
    scale_params: 1264.98852539
    scale_params: 967.33605957
    scale_params: 1432.34033203
    scale_params: 1031.0612793
    scale_params: 765.57824707
    scale_params: 998.788452148
    scale_params: 870.812316895
    scale_params: 1956.76025391
    scale_params: 500.891876221
    scale_params: 1650.57421875
    scale_params: 506.81930542
    scale_params: 1278.46496582
    scale_params: 554.729492188
    scale_params: 763.75378418
    scale_params: 1853.98547363
    scale_params: 2073.87597656
    scale_params: 1331.15454102
    scale_params: 1353.73022461
    scale_params: 1175.57849121
    scale_params: 1058.53308105
    scale_params: 1339.44189453
    scale_params: 1106.44030762
    scale_params: 1011.64068604
    scale_params: 911.299133301
    scale_params: 1625.44018555
    scale_params: 1257.63806152
    scale_params: 1274.42480469
    scale_params: 1264.40234375
    scale_params: 2199.64916992
    scale_params: 1014.10479736
    scale_params: 1631.03393555
    scale_params: 1229.6361084
    scale_params: 494.12109375
    scale_params: 2023.25683594
    scale_params: 1659.31481934
    scale_params: 1361.72729492
    scale_params: 1550.61962891
    scale_params: 1432.32629395
    scale_params: 1437.20861816
    scale_params: 968.74432373
    scale_params: 747.780273438
    scale_params: 642.613647461
    scale_params: 655.257141113
    scale_params: 837.348327637
    scale_params: 1335.34362793
    scale_params: 1312.05859375
    scale_params: 1600.36083984
    scale_params: 909.256896973
    scale_params: 959.881469727
    scale_params: 1230.58288574
    scale_params: 2346.04199219
    scale_params: 1790.01586914
    scale_params: 1243.71130371
    scale_params: 661.953430176
    scale_params: 2570.34326172
    scale_params: 802.975341797
    scale_params: 894.674194336
    scale_params: 1162.40246582
    scale_params: 1096.33557129
    scale_params: 527.526550293
    scale_params: 1945.56140137
    scale_params: 1723.54968262
    scale_params: 1269.00244141
    scale_params: 1724.04455566
    scale_params: 991.878234863
    scale_params: 1139.99560547
    scale_params: 1185.92224121
    scale_params: 1666.32287598
    scale_params: 1747.7019043
    scale_params: 832.697143555
    scale_params: 905.114868164
    scale_params: 953.177368164
    scale_params: 968.905212402
    scale_params: 407.525177002
    scale_params: 1798.93078613
    scale_params: 1938.5970459
    scale_params: 598.773986816
    scale_params: 650.242004395
    scale_params: 1040.13012695
    scale_params: 688.118408203
    scale_params: 1529.39453125
    scale_params: 1672.70910645
    scale_params: 1631.29040527
    scale_params: 1331.01977539
    scale_params: 1085.3951416
    scale_params: 1071.76965332
    scale_params: 1113.31958008
    scale_params: 1028.49731445
    scale_params: 932.538024902
    scale_params: 937.089233398
    scale_params: 1591.50476074
    scale_params: 1462.11230469
    scale_params: 1849.66625977
    scale_params: 1757.43261719
    scale_params: 673.841796875
    scale_params: 1442.41711426
    scale_params: 1221.69555664
    scale_params: 848.81262207
    scale_params: 1269.27307129
    scale_params: 2393.42944336
    scale_params: 1126.0760498
    scale_params: 1586.6394043
    scale_params: 849.045410156
    scale_params: 901.822692871
    scale_params: 1089.66491699
    scale_params: 2058.48046875
    scale_params: 1514.06811523
    scale_params: 1356.65515137
    scale_params: 909.156494141
    scale_params: 1504.90332031
    scale_params: 884.702575684
    scale_params: 623.216552734
    scale_params: 976.125793457
    scale_params: 713.073059082
    scale_params: 1008.11273193
    scale_params: 1048.0925293
    scale_params: 1354.88818359
    scale_params: 793.061523438
    scale_params: 1053.74621582
    scale_params: 767.028137207
    scale_params: 691.790222168
    scale_params: 1252.88574219
    scale_params: 874.745483398
    scale_params: 1305.21777344
    scale_params: 663.281494141
    scale_params: 1396.74377441
    scale_params: 1554.67407227
    scale_params: 2255.20727539
    scale_params: 1099.17797852
    scale_params: 310.460540771
    scale_params: 1180.39746094
    scale_params: 823.633789062
    scale_params: 1427.39929199
    scale_params: 800.62512207
    scale_params: 836.354797363
    scale_params: 990.078430176
    scale_params: 1411.4987793
    scale_params: 924.977966309
    scale_params: 1235.92773438
    scale_params: 969.659362793
    scale_params: 709.954650879
    scale_params: 1980.3482666
    scale_params: 929.393127441
    scale_params: 1653.81201172
    scale_params: 640.361572266
    scale_params: 1355.22558594
    scale_params: 863.301391602
    scale_params: 986.434082031
    scale_params: 480.497528076
    scale_params: 2132.92114258
    scale_params: 1074.88354492
    scale_params: 984.949584961
    scale_params: 483.486999512
    scale_params: 1039.35095215
    scale_params: 1044.6151123
    scale_params: 1611.97741699
    scale_params: 1350.19177246
    scale_params: 1603.38134766
    scale_params: 2698.53466797
    scale_params: 1207.74890137
    scale_params: 987.49810791
    scale_params: 863.273010254
    scale_params: 781.043945312
    scale_params: 672.133605957
    scale_params: 1095.78430176
    scale_params: 1178.45300293
    scale_params: 1215.5859375
    scale_params: 1547.40368652
    scale_params: 1257.70849609
    scale_params: 896.588684082
    scale_params: 943.04699707
    scale_params: 716.048095703
    scale_params: 937.992980957
    scale_params: 605.566772461
    scale_params: 2856.06958008
    scale_params: 2126.85791016
    scale_params: 1057.04370117
    scale_params: 2574.86547852
    scale_params: 1028.37805176
    scale_params: 1766.09924316
    scale_params: 1646.94470215
    scale_params: 1222.02148438
    scale_params: 942.325439453
    scale_params: 1661.66052246
    scale_params: 1277.38647461
    scale_params: 1073.7565918
    scale_params: 1133.67858887
    scale_params: 751.031066895
    scale_params: 1596.40905762
    scale_params: 710.101928711
    scale_params: 741.720947266
    scale_params: 2183.16186523
    scale_params: 1563.03808594
    scale_params: 1537.12121582
    scale_params: 1549.53991699
    scale_params: 947.742492676
    scale_params: 1561.45556641
    scale_params: 1247.10351562
    scale_params: 1699.55078125
    scale_params: 859.399108887
    scale_params: 1280.95129395
    scale_params: 1435.53625488
    scale_params: 1210.88232422
    scale_params: 1911.96459961
    scale_params: 684.431152344
    scale_params: 2044.21594238
    scale_params: 987.865905762
    scale_params: 2137.38623047
  }
}
layer {
  name: "layer9-bn"
  type: "BatchNorm"
  bottom: "layer9-conv"
  top: "layer9-conv"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "layer9-scale"
  type: "Scale"
  bottom: "layer9-conv"
  top: "layer9-conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "layer9-act"
  type: "ReLU"
  bottom: "layer9-conv"
  top: "layer9-conv"
  relu_param {
    negative_slope: 0.0
  }
}
layer {
  name: "layer10-conv"
  type: "Convolution"
  bottom: "layer9-conv"
  top: "layer10-conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 17.4932975769
    scale_out: 6.91309547424
    scale_params: 185.808074951
    scale_params: 241.304718018
    scale_params: 283.791442871
    scale_params: 237.679534912
    scale_params: 172.357727051
    scale_params: 120.756996155
    scale_params: 125.786430359
    scale_params: 362.931915283
    scale_params: 231.937911987
    scale_params: 139.433074951
    scale_params: 285.374298096
    scale_params: 197.587417603
    scale_params: 102.677940369
    scale_params: 265.925506592
    scale_params: 228.519271851
    scale_params: 214.056610107
    scale_params: 286.529815674
    scale_params: 93.7988510132
    scale_params: 205.673492432
    scale_params: 155.570220947
    scale_params: 246.491882324
    scale_params: 305.461212158
    scale_params: 111.281188965
    scale_params: 213.42048645
    scale_params: 246.395080566
    scale_params: 311.43447876
    scale_params: 300.975708008
    scale_params: 279.439300537
    scale_params: 195.663772583
    scale_params: 356.597137451
    scale_params: 261.411468506
    scale_params: 218.334625244
    scale_params: 149.852981567
    scale_params: 267.01449585
    scale_params: 149.921401978
    scale_params: 203.652603149
    scale_params: 393.388336182
    scale_params: 186.192520142
    scale_params: 203.353515625
    scale_params: 257.882232666
    scale_params: 168.799102783
    scale_params: 227.987182617
    scale_params: 98.1870651245
    scale_params: 216.492462158
    scale_params: 229.010314941
    scale_params: 85.2558059692
    scale_params: 211.675994873
    scale_params: 146.197021484
    scale_params: 370.002593994
    scale_params: 121.106460571
    scale_params: 185.774429321
    scale_params: 186.20375061
    scale_params: 192.669158936
    scale_params: 111.345046997
    scale_params: 94.8359680176
    scale_params: 234.16696167
    scale_params: 194.981277466
    scale_params: 433.257720947
    scale_params: 251.132873535
    scale_params: 301.503265381
    scale_params: 123.742866516
    scale_params: 386.997772217
    scale_params: 230.68649292
    scale_params: 229.28302002
    scale_params: 218.647415161
    scale_params: 457.677215576
    scale_params: 222.044967651
    scale_params: 332.87802124
    scale_params: 239.865158081
    scale_params: 178.839080811
    scale_params: 156.677398682
    scale_params: 479.83291626
    scale_params: 182.484985352
    scale_params: 166.063827515
    scale_params: 299.613433838
    scale_params: 266.854553223
    scale_params: 294.477996826
    scale_params: 151.135406494
    scale_params: 169.821243286
    scale_params: 165.994003296
    scale_params: 178.170761108
    scale_params: 220.502593994
    scale_params: 232.67616272
    scale_params: 147.852371216
    scale_params: 190.819824219
    scale_params: 177.170440674
    scale_params: 162.7603302
    scale_params: 259.877655029
    scale_params: 267.627227783
    scale_params: 149.261810303
    scale_params: 148.750076294
    scale_params: 260.88684082
    scale_params: 337.612365723
    scale_params: 153.162353516
    scale_params: 330.799316406
    scale_params: 179.792617798
    scale_params: 195.314559937
    scale_params: 114.655982971
    scale_params: 451.012176514
    scale_params: 207.888870239
    scale_params: 303.045928955
    scale_params: 193.343460083
    scale_params: 248.333999634
    scale_params: 131.145004272
    scale_params: 240.730422974
    scale_params: 431.871002197
    scale_params: 335.453826904
    scale_params: 365.009277344
    scale_params: 175.892456055
    scale_params: 215.43460083
    scale_params: 151.149139404
    scale_params: 297.916473389
    scale_params: 171.483078003
    scale_params: 258.721984863
    scale_params: 254.251998901
    scale_params: 301.469329834
    scale_params: 266.934539795
    scale_params: 266.45690918
    scale_params: 257.608306885
    scale_params: 303.304534912
    scale_params: 237.609390259
    scale_params: 241.880905151
    scale_params: 224.265289307
    scale_params: 147.86227417
    scale_params: 196.408721924
    scale_params: 148.822875977
    scale_params: 185.345046997
    scale_params: 194.089599609
  }
}
layer {
  name: "layer10-bn"
  type: "BatchNorm"
  bottom: "layer10-conv"
  top: "layer10-conv"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "layer10-scale"
  type: "Scale"
  bottom: "layer10-conv"
  top: "layer10-conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "layer10-act"
  type: "ReLU"
  bottom: "layer10-conv"
  top: "layer10-conv"
  relu_param {
    negative_slope: 0.0
  }
}
layer {
  name: "layer11-conv"
  type: "Convolution"
  bottom: "layer10-conv"
  top: "layer11-conv"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 13.8806247711
    scale_out: 8.20085430145
    scale_params: 681.020263672
    scale_params: 1617.5682373
    scale_params: 1009.91375732
    scale_params: 1244.89758301
    scale_params: 899.588500977
    scale_params: 769.997497559
    scale_params: 956.121276855
    scale_params: 1310.36206055
    scale_params: 1045.17260742
    scale_params: 672.188781738
    scale_params: 1673.82019043
    scale_params: 1096.58898926
    scale_params: 857.832519531
    scale_params: 1127.65905762
    scale_params: 2052.75610352
    scale_params: 1585.36828613
    scale_params: 747.991577148
    scale_params: 652.09954834
    scale_params: 1739.15148926
    scale_params: 1095.51916504
    scale_params: 1323.9206543
    scale_params: 1143.80432129
    scale_params: 1400.18017578
    scale_params: 1000.19281006
    scale_params: 1360.16113281
    scale_params: 883.442443848
    scale_params: 1070.23291016
    scale_params: 1107.60314941
    scale_params: 1930.65710449
    scale_params: 920.277160645
    scale_params: 1802.97607422
    scale_params: 874.089172363
    scale_params: 1480.78491211
    scale_params: 926.240234375
    scale_params: 706.830383301
    scale_params: 728.334411621
    scale_params: 742.268432617
    scale_params: 833.876342773
    scale_params: 463.75982666
    scale_params: 1917.40515137
    scale_params: 1447.31359863
    scale_params: 1816.02819824
    scale_params: 701.596374512
    scale_params: 795.067749023
    scale_params: 1538.5970459
    scale_params: 740.543395996
    scale_params: 767.698059082
    scale_params: 1387.68603516
    scale_params: 1722.38769531
    scale_params: 967.585571289
    scale_params: 1317.13049316
    scale_params: 1517.80432129
    scale_params: 568.827758789
    scale_params: 640.130187988
    scale_params: 792.702575684
    scale_params: 1012.05352783
    scale_params: 1202.13635254
    scale_params: 924.50769043
    scale_params: 794.08605957
    scale_params: 869.622680664
    scale_params: 1248.81420898
    scale_params: 549.054199219
    scale_params: 1075.8717041
    scale_params: 748.230957031
    scale_params: 751.777709961
    scale_params: 1126.92529297
    scale_params: 1110.51403809
    scale_params: 1186.89916992
    scale_params: 1593.06140137
    scale_params: 804.138183594
    scale_params: 798.401855469
    scale_params: 1344.81237793
    scale_params: 811.496826172
    scale_params: 974.525024414
    scale_params: 1069.32885742
    scale_params: 813.581420898
    scale_params: 1067.96582031
    scale_params: 1065.31274414
    scale_params: 1511.59094238
    scale_params: 601.047973633
    scale_params: 704.997802734
    scale_params: 2935.06298828
    scale_params: 1523.12280273
    scale_params: 1241.86901855
    scale_params: 900.46484375
    scale_params: 1620.53271484
    scale_params: 655.552368164
    scale_params: 791.713256836
    scale_params: 1750.43981934
    scale_params: 1373.71765137
    scale_params: 807.405578613
    scale_params: 826.200744629
    scale_params: 520.302062988
    scale_params: 2494.10913086
    scale_params: 593.907226562
    scale_params: 1104.37402344
    scale_params: 596.380493164
    scale_params: 917.646606445
    scale_params: 1099.64221191
    scale_params: 1270.51245117
    scale_params: 806.769165039
    scale_params: 2311.86010742
    scale_params: 940.440734863
    scale_params: 1654.24804688
    scale_params: 1006.00805664
    scale_params: 690.504272461
    scale_params: 1164.98779297
    scale_params: 1169.82727051
    scale_params: 854.042419434
    scale_params: 1005.75872803
    scale_params: 1080.34130859
    scale_params: 584.82208252
    scale_params: 1490.20861816
    scale_params: 1101.19580078
    scale_params: 782.913085938
    scale_params: 838.209777832
    scale_params: 1947.10241699
    scale_params: 828.984436035
    scale_params: 830.792602539
    scale_params: 1101.51525879
    scale_params: 1643.85351562
    scale_params: 1089.55310059
    scale_params: 602.771362305
    scale_params: 617.087097168
    scale_params: 598.442993164
    scale_params: 592.325866699
    scale_params: 727.753601074
    scale_params: 1389.06018066
    scale_params: 1083.12329102
    scale_params: 856.168579102
    scale_params: 1159.81286621
    scale_params: 1046.82983398
    scale_params: 776.921447754
    scale_params: 1542.37121582
    scale_params: 1153.18469238
    scale_params: 485.164276123
    scale_params: 1001.67321777
    scale_params: 1078.94946289
    scale_params: 597.872131348
    scale_params: 1259.91052246
    scale_params: 817.463867188
    scale_params: 1385.66235352
    scale_params: 1037.95715332
    scale_params: 931.442321777
    scale_params: 1193.39953613
    scale_params: 915.969299316
    scale_params: 1758.71618652
    scale_params: 783.403625488
    scale_params: 1126.51342773
    scale_params: 861.71270752
    scale_params: 1538.30725098
    scale_params: 1881.1361084
    scale_params: 900.224853516
    scale_params: 629.088256836
    scale_params: 1676.02624512
    scale_params: 768.115478516
    scale_params: 660.329284668
    scale_params: 845.957519531
    scale_params: 783.72869873
    scale_params: 1101.81677246
    scale_params: 1317.1192627
    scale_params: 861.332519531
    scale_params: 549.274047852
    scale_params: 1301.97302246
    scale_params: 3652.90771484
    scale_params: 3683.42382812
    scale_params: 810.261047363
    scale_params: 1254.43823242
    scale_params: 1008.61798096
    scale_params: 893.074768066
    scale_params: 984.341430664
    scale_params: 1539.93566895
    scale_params: 1199.19299316
    scale_params: 1022.26043701
    scale_params: 896.720092773
    scale_params: 1550.53051758
    scale_params: 925.792236328
    scale_params: 1177.90454102
    scale_params: 1645.55493164
    scale_params: 676.09576416
    scale_params: 1710.75805664
    scale_params: 593.571533203
    scale_params: 966.663391113
    scale_params: 791.213378906
    scale_params: 1668.57104492
    scale_params: 839.779174805
    scale_params: 785.735290527
    scale_params: 1027.45739746
    scale_params: 1045.21655273
    scale_params: 984.774658203
    scale_params: 1170.05383301
    scale_params: 688.176086426
    scale_params: 1183.84631348
    scale_params: 1070.39855957
    scale_params: 1117.27526855
    scale_params: 678.751098633
    scale_params: 1180.20129395
    scale_params: 1763.55297852
    scale_params: 1001.63024902
    scale_params: 1473.56518555
    scale_params: 1001.80310059
    scale_params: 1048.58850098
    scale_params: 1132.95227051
    scale_params: 1033.1394043
    scale_params: 1011.29205322
    scale_params: 942.601623535
    scale_params: 1117.30639648
    scale_params: 912.100585938
    scale_params: 1346.53991699
    scale_params: 662.330871582
    scale_params: 631.455688477
    scale_params: 677.379272461
    scale_params: 727.06829834
    scale_params: 854.866821289
    scale_params: 418.505371094
    scale_params: 1693.91040039
    scale_params: 1959.3137207
    scale_params: 849.853088379
    scale_params: 1032.6953125
    scale_params: 411.589630127
    scale_params: 1040.35131836
    scale_params: 1299.25024414
    scale_params: 1086.14489746
    scale_params: 1353.42895508
    scale_params: 926.645996094
    scale_params: 1141.10778809
    scale_params: 827.626586914
    scale_params: 1281.89367676
    scale_params: 581.230041504
    scale_params: 763.983764648
    scale_params: 833.805603027
    scale_params: 3188.21020508
    scale_params: 1265.63293457
    scale_params: 1141.06896973
    scale_params: 944.945251465
    scale_params: 865.261291504
    scale_params: 1072.2947998
    scale_params: 1111.82910156
    scale_params: 845.727111816
    scale_params: 733.906555176
    scale_params: 1153.29211426
    scale_params: 892.432128906
    scale_params: 990.716247559
    scale_params: 633.625671387
    scale_params: 1030.5345459
    scale_params: 1702.28881836
    scale_params: 1388.09326172
    scale_params: 1053.55078125
    scale_params: 402.407562256
    scale_params: 1424.47705078
    scale_params: 866.804321289
    scale_params: 978.658935547
    scale_params: 1210.53637695
    scale_params: 1125.35595703
    scale_params: 941.033691406
    scale_params: 798.890014648
  }
}
layer {
  name: "layer11-bn"
  type: "BatchNorm"
  bottom: "layer11-conv"
  top: "layer11-conv"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "layer11-scale"
  type: "Scale"
  bottom: "layer11-conv"
  top: "layer11-conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "layer11-act"
  type: "ReLU"
  bottom: "layer11-conv"
  top: "layer11-conv"
  relu_param {
    negative_slope: 0.0
  }
}
layer {
  name: "layer12-maxpool"
  type: "Pooling"
  bottom: "layer11-conv"
  top: "layer12-maxpool"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "layer13-conv"
  type: "Convolution"
  bottom: "layer12-maxpool"
  top: "layer13-conv"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 16.4662837982
    scale_out: 8.43891048431
    scale_params: 1131.48742676
    scale_params: 2337.87304688
    scale_params: 3442.97045898
    scale_params: 1269.00708008
    scale_params: 937.722595215
    scale_params: 2075.59179688
    scale_params: 719.666625977
    scale_params: 972.572814941
    scale_params: 1003.11425781
    scale_params: 1432.87561035
    scale_params: 2859.48999023
    scale_params: 867.127563477
    scale_params: 1725.59118652
    scale_params: 2861.68579102
    scale_params: 4547.58349609
    scale_params: 1276.546875
    scale_params: 812.637817383
    scale_params: 2599.40136719
    scale_params: 1057.6027832
    scale_params: 1602.70324707
    scale_params: 2094.3671875
    scale_params: 744.974975586
    scale_params: 515.776184082
    scale_params: 1115.62658691
    scale_params: 2076.06030273
    scale_params: 1915.79772949
    scale_params: 1823.38244629
    scale_params: 4040.42431641
    scale_params: 680.405578613
    scale_params: 527.326293945
    scale_params: 1132.38574219
    scale_params: 1521.52490234
    scale_params: 1786.55834961
    scale_params: 893.828735352
    scale_params: 1806.61901855
    scale_params: 2297.37524414
    scale_params: 1321.05297852
    scale_params: 1596.23754883
    scale_params: 1296.76025391
    scale_params: 1720.63330078
    scale_params: 1971.3984375
    scale_params: 1968.11254883
    scale_params: 1880.70544434
    scale_params: 982.74420166
    scale_params: 1334.89831543
    scale_params: 1082.88256836
    scale_params: 2081.94921875
    scale_params: 895.121032715
    scale_params: 2481.81079102
    scale_params: 1436.46411133
    scale_params: 826.954833984
    scale_params: 1558.19348145
    scale_params: 1209.58996582
    scale_params: 882.322937012
    scale_params: 2044.51159668
    scale_params: 836.314880371
    scale_params: 973.988037109
    scale_params: 1757.58203125
    scale_params: 392.399047852
    scale_params: 1456.56481934
    scale_params: 738.32244873
    scale_params: 1414.29394531
    scale_params: 1526.94384766
    scale_params: 1501.96411133
    scale_params: 1368.39331055
    scale_params: 1087.87097168
    scale_params: 1909.61413574
    scale_params: 1665.61584473
    scale_params: 868.730957031
    scale_params: 1182.62158203
    scale_params: 675.151306152
    scale_params: 961.317749023
    scale_params: 3955.83349609
    scale_params: 2629.00268555
    scale_params: 1960.06018066
    scale_params: 1857.38464355
    scale_params: 563.104736328
    scale_params: 770.830749512
    scale_params: 767.154418945
    scale_params: 844.57019043
    scale_params: 1855.73596191
    scale_params: 909.389892578
    scale_params: 643.985534668
    scale_params: 2096.74267578
    scale_params: 828.827270508
    scale_params: 1427.68151855
    scale_params: 544.26361084
    scale_params: 3616.37353516
    scale_params: 1268.80395508
    scale_params: 1861.51867676
    scale_params: 1715.53344727
    scale_params: 1337.40893555
    scale_params: 1481.24487305
    scale_params: 1114.97094727
    scale_params: 1762.62915039
    scale_params: 1342.16845703
    scale_params: 784.97857666
    scale_params: 2082.97973633
    scale_params: 1375.54284668
    scale_params: 418.461547852
    scale_params: 3285.21630859
    scale_params: 792.080871582
    scale_params: 1846.98205566
    scale_params: 734.053100586
    scale_params: 1788.75524902
    scale_params: 894.508300781
    scale_params: 1296.39233398
    scale_params: 1581.80737305
    scale_params: 586.008850098
    scale_params: 947.1015625
    scale_params: 947.749023438
    scale_params: 2621.00195312
    scale_params: 1607.71386719
    scale_params: 887.152832031
    scale_params: 1145.4375
    scale_params: 1990.57885742
    scale_params: 1265.55212402
    scale_params: 1526.53283691
    scale_params: 781.121704102
    scale_params: 1185.05407715
    scale_params: 1206.78979492
    scale_params: 746.436828613
    scale_params: 917.610656738
    scale_params: 757.839172363
    scale_params: 1003.97296143
    scale_params: 947.203857422
    scale_params: 1227.33996582
    scale_params: 1556.67321777
    scale_params: 1299.68371582
    scale_params: 1406.32324219
    scale_params: 2625.42089844
    scale_params: 1091.71008301
    scale_params: 554.693481445
    scale_params: 1395.3034668
    scale_params: 816.644897461
    scale_params: 1178.82519531
    scale_params: 390.344329834
    scale_params: 2072.18432617
    scale_params: 1238.88317871
    scale_params: 914.543701172
    scale_params: 908.800537109
    scale_params: 867.433532715
    scale_params: 731.0
    scale_params: 1427.38647461
    scale_params: 690.590942383
    scale_params: 1125.98986816
    scale_params: 1073.44702148
    scale_params: 1247.69433594
    scale_params: 900.046020508
    scale_params: 1324.3885498
    scale_params: 820.588439941
    scale_params: 1283.5736084
    scale_params: 1429.23266602
    scale_params: 810.858154297
    scale_params: 1002.54693604
    scale_params: 2473.79711914
    scale_params: 841.589355469
    scale_params: 1018.67657471
    scale_params: 2061.48608398
    scale_params: 2220.09838867
    scale_params: 929.036804199
    scale_params: 1605.56591797
    scale_params: 807.985046387
    scale_params: 949.081604004
    scale_params: 2877.60693359
    scale_params: 1266.81066895
    scale_params: 2374.68725586
    scale_params: 965.707336426
    scale_params: 1533.86352539
    scale_params: 1594.63659668
    scale_params: 1715.76086426
    scale_params: 2216.6496582
    scale_params: 810.484802246
    scale_params: 993.917419434
    scale_params: 2798.00463867
    scale_params: 806.571044922
    scale_params: 1674.25817871
    scale_params: 865.576721191
    scale_params: 3731.48803711
    scale_params: 1243.7824707
    scale_params: 1373.57885742
    scale_params: 783.773254395
    scale_params: 2164.55371094
    scale_params: 854.679321289
    scale_params: 960.773742676
    scale_params: 2659.47265625
    scale_params: 1814.47131348
    scale_params: 684.666687012
    scale_params: 2477.15551758
    scale_params: 570.939453125
    scale_params: 736.620117188
    scale_params: 2219.95947266
    scale_params: 2434.17529297
    scale_params: 739.692749023
    scale_params: 1800.40710449
    scale_params: 252.050888062
    scale_params: 1785.64086914
    scale_params: 1052.03674316
    scale_params: 1717.48754883
    scale_params: 1020.49908447
    scale_params: 1038.11901855
    scale_params: 1236.94262695
    scale_params: 2264.10620117
    scale_params: 1653.90515137
    scale_params: 1197.08129883
    scale_params: 623.677124023
    scale_params: 1071.44848633
    scale_params: 1828.13244629
    scale_params: 1694.2635498
    scale_params: 1471.19689941
    scale_params: 1145.70080566
    scale_params: 574.4140625
    scale_params: 568.249938965
    scale_params: 2130.39160156
    scale_params: 908.40838623
    scale_params: 1453.4798584
    scale_params: 2235.42895508
    scale_params: 661.065917969
    scale_params: 858.59161377
    scale_params: 1662.42370605
    scale_params: 1594.74389648
    scale_params: 2115.1027832
    scale_params: 860.541809082
    scale_params: 1675.47473145
    scale_params: 972.492370605
    scale_params: 826.026000977
    scale_params: 1709.56872559
    scale_params: 1524.70031738
    scale_params: 1436.41894531
    scale_params: 887.16027832
    scale_params: 1000.95782471
    scale_params: 1483.15332031
    scale_params: 1749.08117676
    scale_params: 1775.96923828
    scale_params: 2060.38916016
    scale_params: 2206.13110352
    scale_params: 1321.05566406
    scale_params: 932.12322998
    scale_params: 1164.42724609
    scale_params: 1527.41906738
    scale_params: 480.839996338
    scale_params: 1824.95324707
    scale_params: 482.214385986
    scale_params: 810.652160645
    scale_params: 849.419494629
    scale_params: 1522.35327148
    scale_params: 1979.87573242
    scale_params: 1116.38586426
    scale_params: 1228.10925293
    scale_params: 2211.35107422
    scale_params: 412.023864746
    scale_params: 1003.42895508
    scale_params: 1315.67663574
    scale_params: 847.215881348
    scale_params: 1524.58728027
    scale_params: 3726.25927734
    scale_params: 2392.85131836
    scale_params: 1259.6574707
    scale_params: 3432.87695312
    scale_params: 2128.23364258
    scale_params: 2568.00732422
    scale_params: 1977.00976562
    scale_params: 1821.81201172
    scale_params: 626.262329102
    scale_params: 1163.94091797
    scale_params: 669.04510498
    scale_params: 2074.1027832
    scale_params: 1312.34069824
    scale_params: 858.616088867
    scale_params: 2096.12182617
    scale_params: 725.893981934
    scale_params: 1022.90820312
    scale_params: 1359.20947266
    scale_params: 926.888793945
    scale_params: 2044.73339844
    scale_params: 1177.80895996
    scale_params: 956.505432129
    scale_params: 1595.06188965
    scale_params: 504.728820801
    scale_params: 629.414489746
    scale_params: 1114.4206543
    scale_params: 1107.21777344
    scale_params: 2129.73901367
    scale_params: 1999.61120605
    scale_params: 983.384765625
    scale_params: 2324.8515625
    scale_params: 1038.25170898
    scale_params: 1490.09436035
    scale_params: 1063.69360352
    scale_params: 2254.56298828
    scale_params: 1065.2532959
    scale_params: 1806.20251465
    scale_params: 1299.48791504
    scale_params: 1454.25427246
    scale_params: 1182.23388672
    scale_params: 1156.61437988
    scale_params: 3018.04589844
    scale_params: 1858.18212891
    scale_params: 1309.82885742
    scale_params: 527.507873535
    scale_params: 1004.39996338
    scale_params: 669.289794922
    scale_params: 1114.84631348
    scale_params: 1404.61853027
    scale_params: 1024.0526123
    scale_params: 1577.1619873
    scale_params: 749.439025879
    scale_params: 1164.69702148
    scale_params: 831.643493652
