name: "ResNet-101"
input: "data"
input: "im_info"
input_shape {
  dim: 1
  dim: 3
  dim: 600
  dim: 800
}
input_shape {
  dim: 1
  dim: 3
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 3
    kernel_size: 7
    stride: 2
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 0.835416956077
    scale_out: 15.4717560634
    scale_params: 16117.8381751
    scale_params: 21808.7629858
    scale_params: 111051.178742
    scale_params: 94617.8109852
    scale_params: 9243.75859309
    scale_params: 61139.5991321
    scale_params: 43132.8244422
    scale_params: 152056.236856
    scale_params: 7828.69812326
    scale_params: 338679.779943
    scale_params: 68434.8008968
    scale_params: 53350.2807954
    scale_params: 67111.5928855
    scale_params: 6213.66421888
    scale_params: 25896.1959718
    scale_params: 10367.5552966
    scale_params: 9549.17191955
    scale_params: 391511.273152
    scale_params: 4249388.57788
    scale_params: 36859.3701989
    scale_params: 64427.8779526
    scale_params: 7318.70090876
    scale_params: 52814.2729602
    scale_params: 244281.082058
    scale_params: 7098.77358994
    scale_params: 76958.47945
    scale_params: 47997.0587783
    scale_params: 11718.8427121
    scale_params: 79248.8279583
    scale_params: 127982.291562
    scale_params: 40199.845276
    scale_params: 11402.1272439
    scale_params: 7563.8949779
    scale_params: 100961.189268
    scale_params: 11990.1690393
    scale_params: 6147832.26898
    scale_params: 43535.8818957
    scale_params: 14992.2805952
    scale_params: 71860.2139587
    scale_params: 89330.0561769
    scale_params: 2974847.82822
    scale_params: 8908.16918628
    scale_params: 11359.4103568
    scale_params: 25649.7033822
    scale_params: 19238.0075863
    scale_params: 8974.50056229
    scale_params: 36298.0109985
    scale_params: 23927.6966977
    scale_params: 3856942.39603
    scale_params: 13345.2869673
    scale_params: 43483.1495756
    scale_params: 10285.0206728
    scale_params: 65856.0554451
    scale_params: 92694.9987488
    scale_params: 13545.4779439
    scale_params: 18442.265803
    scale_params: 20125113.1337
    scale_params: 20472.9914494
    scale_params: 21690.4308228
    scale_params: 165258.401904
    scale_params: 8870.24841067
    scale_params: 25890.5761787
    scale_params: 30258.9232837
    scale_params: 22926.6012214
    is_negative_input: true
  }
}
layer {
  name: "bn_conv1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale_conv1"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "res2a_branch1"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch1"
  param {
    lr_mult: 0.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 15.4717560634
    scale_out: 7.56713421022
    scale_params: 2349.61507567
    scale_params: 305.8539456
    scale_params: 615.947425937
    scale_params: 1657.17443124
    scale_params: 208.186402822
    scale_params: 145.215197341
    scale_params: 506.483196395
    scale_params: 452.713148859
    scale_params: 1837.15105094
    scale_params: 587.150525518
    scale_params: 816.141149439
    scale_params: 555.704335775
    scale_params: 369.827183422
    scale_params: 492.996092045
    scale_params: 385.143597736
    scale_params: 402.914856577
    scale_params: 182.003780836
    scale_params: 737.877027156
    scale_params: 372.07593665
    scale_params: 254.914090071
    scale_params: 567.695659881
    scale_params: 761.242805246
    scale_params: 262.367018421
    scale_params: 4545.81768581
    scale_params: 415.749867901
    scale_params: 604.097893785
    scale_params: 415.099272171
    scale_params: 352.823445409
    scale_params: 2008.15973903
    scale_params: 475.960128212
    scale_params: 671.113846402
    scale_params: 216.850830243
    scale_params: 876.933254269
    scale_params: 596.145499409
    scale_params: 908.775511973
    scale_params: 1720.89662668
    scale_params: 205.719702224
    scale_params: 274.174414394
    scale_params: 393.083331958
    scale_params: 439.78509111
    scale_params: 703.19787302
    scale_params: 563.589305272
    scale_params: 335.192948053
    scale_params: 644.643486106
    scale_params: 411.086398112
    scale_params: 810.421236343
    scale_params: 715.254717711
    scale_params: 757.918195275
    scale_params: 390.007625873
    scale_params: 885.604228957
    scale_params: 399.377595879
    scale_params: 291.216173677
    scale_params: 3670.84699883
    scale_params: 401.473887647
    scale_params: 41.8530625066
    scale_params: 608.507261684
    scale_params: 337.760159624
    scale_params: 216.546628018
    scale_params: 769.114110785
    scale_params: 306.857802867
    scale_params: 542.115068519
    scale_params: 123.482304768
    scale_params: 474.894581499
    scale_params: 148.79730505
    scale_params: 418.022208258
    scale_params: 419.629558833
    scale_params: 250.069031614
    scale_params: 572.9787131
    scale_params: 506.757422754
    scale_params: 617.991133752
    scale_params: 236.623955063
    scale_params: 420.804475718
    scale_params: 45156.6341175
    scale_params: 92.5820736065
    scale_params: 207.540316389
    scale_params: 2030.49103914
    scale_params: 1299.42298951
    scale_params: 404.438048723
    scale_params: 215.311040703
    scale_params: 110.487446513
    scale_params: 1312.70569347
    scale_params: 476.801652722
    scale_params: 334.39274511
    scale_params: 383.732270333
    scale_params: 306.744578719
    scale_params: 1795.67405584
    scale_params: 519.185697448
    scale_params: 2784.95889765
    scale_params: 507.476226668
    scale_params: 228.68947086
    scale_params: 119.970736396
    scale_params: 231.223340215
    scale_params: 312.653343882
    scale_params: 584.095082178
    scale_params: 296.707317921
    scale_params: 391.188873503
    scale_params: 222.184843217
    scale_params: 715.483128717
    scale_params: 493.990484215
    scale_params: 247.268063674
    scale_params: 133.967649428
    scale_params: 156.16818736
    scale_params: 526.798426532
    scale_params: 339.090971259
    scale_params: 434.84865233
    scale_params: 377.56033394
    scale_params: 532.49549297
    scale_params: 707.757617914
    scale_params: 1082.90136184
    scale_params: 925.743162553
    scale_params: 250.033758856
    scale_params: 548.792234974
    scale_params: 1067.6243867
    scale_params: 282.80373862
    scale_params: 308.499348131
    scale_params: 246.602148385
    scale_params: 438.632306313
    scale_params: 511.058911852
    scale_params: 333.619205836
    scale_params: 402.343778467
    scale_params: 519.255286789
    scale_params: 1098.13544154
    scale_params: 535.384112379
    scale_params: 272.548439433
    scale_params: 304.059833977
    scale_params: 350.293986139
    scale_params: 555.55850011
    scale_params: 439.427735527
    scale_params: 303.35865899
    scale_params: 1167.03292934
    scale_params: 136.681595645
    scale_params: 2149.02377042
    scale_params: 735.160734454
    scale_params: 353.843459907
    scale_params: 489.801074976
    scale_params: 235.888281823
    scale_params: 301.08570156
    scale_params: 296.912042146
    scale_params: 384.833038649
    scale_params: 407.261654262
    scale_params: 1353.60565531
    scale_params: 192.354644307
    scale_params: 385.740661111
    scale_params: 480.037496297
    scale_params: 473.998233663
    scale_params: 629.263943117
    scale_params: 398.007155589
    scale_params: 1479.6666208
    scale_params: 434.633281851
    scale_params: 1433.51365924
    scale_params: 291.600213714
    scale_params: 790.293895381
    scale_params: 3316.52947181
    scale_params: 2929.76254378
    scale_params: 7497.8936567
    scale_params: 1734.67370361
    scale_params: 441.207919148
    scale_params: 105.298017248
    scale_params: 2249.95250874
    scale_params: 360.743625695
    scale_params: 581.60742218
    scale_params: 1815.52243307
    scale_params: 194.01338722
    scale_params: 1115.62954975
    scale_params: 513.826187791
    scale_params: 231.032896417
    scale_params: 439.104847069
    scale_params: 1755.32402599
    scale_params: 275.079647499
    scale_params: 173.660721588
    scale_params: 906.95316544
    scale_params: 396.928019267
    scale_params: 248.274097878
    scale_params: 2401.86819398
    scale_params: 1499.93461573
    scale_params: 1256.46194105
    scale_params: 406.575840515
    scale_params: 180.748646128
    scale_params: 663.310359791
    scale_params: 389.215693015
    scale_params: 1234.59773831
    scale_params: 222.278902377
    scale_params: 286.939444204
    scale_params: 421.862796108
    scale_params: 2612.71814861
    scale_params: 358.639941533
    scale_params: 696.473395201
    scale_params: 738.372259852
    scale_params: 103.919998182
    scale_params: 302.986941682
    scale_params: 141.878619335
    scale_params: 1378.5420246
    scale_params: 997.808677895
    scale_params: 382.800808538
    scale_params: 234.524188983
    scale_params: 1023.51868107
    scale_params: 808.74515239
    scale_params: 397.50013003
    scale_params: 267.252457735
    scale_params: 1229.09803486
    scale_params: 187.754601326
    scale_params: 239.485377409
    scale_params: 2465.93557825
    scale_params: 571.952554146
    scale_params: 667.312335257
    scale_params: 596.94104206
    scale_params: 2214.39506468
    scale_params: 572.702961128
    scale_params: 427.052017532
    scale_params: 1342.10129804
    scale_params: 277.853961432
    scale_params: 354.395451204
    scale_params: 439.281016229
    scale_params: 773.020246144
    scale_params: 672.645204559
    scale_params: 398.191507727
    scale_params: 902.024344464
    scale_params: 180.401012112
    scale_params: 260.143093775
    scale_params: 846.069545696
    scale_params: 1057.74525106
    scale_params: 1528.38431214
    scale_params: 330.706988161
    scale_params: 474.285061892
    scale_params: 1122.16972101
    scale_params: 552.132551318
    scale_params: 327.573401618
    scale_params: 398.478025379
    scale_params: 1363.45337952
    scale_params: 1136.60393298
    scale_params: 387.613828496
    scale_params: 887.212667864
    scale_params: 484.013800042
    scale_params: 462.849058376
    scale_params: 2003.29675818
    scale_params: 199.758328684
    scale_params: 377.077607282
    scale_params: 335.768756297
    scale_params: 649.074190019
    scale_params: 223.530155656
    scale_params: 380.435736961
    scale_params: 381.711516395
    scale_params: 662.746436645
    scale_params: 388.78162698
    scale_params: 784.945837169
    scale_params: 216.714039634
    scale_params: 708.976453316
    scale_params: 897.554787505
    scale_params: 397.380365829
    scale_params: 1257.34871442
    scale_params: 158.156247687
    scale_params: 490.198234859
    scale_params: 297.604087194
    scale_params: 1832.7506591
    scale_params: 561.584152237
    scale_params: 866.274376649
  }
}
layer {
  name: "bn2a_branch1"
  type: "BatchNorm"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2a_branch1"
  type: "Scale"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch2a"
  param {
    lr_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 15.4717560634
    scale_out: 28.8694091792
    scale_params: 466.536181734
    scale_params: 2041.23599642
    scale_params: 836.624804923
    scale_params: 290.436926803
    scale_params: 1053.23027226
    scale_params: 566.756603551
    scale_params: 282.540088594
    scale_params: 409.151593789
    scale_params: 283.889147265
    scale_params: 513.219000197
    scale_params: 241.218748415
    scale_params: 333.384956759
    scale_params: 944.796581682
    scale_params: 244.473145382
    scale_params: 824.569852013
    scale_params: 303.197017986
    scale_params: 11607794.8858
    scale_params: 321.463048797
    scale_params: 321.863013086
    scale_params: 623.810074458
    scale_params: 885997.638199
    scale_params: 749.441840214
    scale_params: 615.280694656
    scale_params: 270.955039174
    scale_params: 467.144728047
    scale_params: 410.927556566
    scale_params: 190.357015663
    scale_params: 1053.26320267
    scale_params: 1004.02155528
    scale_params: 656.981792452
    scale_params: 463.608049049
    scale_params: 1113.38295624
    scale_params: 536.639658337
    scale_params: 317.03787086
    scale_params: 587.365270587
    scale_params: 542.079726212
    scale_params: 397.969540022
    scale_params: 248.730573433
    scale_params: 1905.67205113
    scale_params: 25868479.869
    scale_params: 261.528725358
    scale_params: 1653.36554025
    scale_params: 252.94994783
    scale_params: 309.230956963
    scale_params: 707.918754219
    scale_params: 771.712262699
    scale_params: 510.2141128
    scale_params: 801.373630067
    scale_params: 8958.69831645
    scale_params: 611.48454508
    scale_params: 681.579926096
    scale_params: 236.145873361
    scale_params: 1023.5161613
    scale_params: 365.960822369
    scale_params: 1338.58407765
    scale_params: 400.955205007
    scale_params: 517.068507305
    scale_params: 410.846973703
    scale_params: 463.475639596
    scale_params: 629.106528522
    scale_params: 403.097873958
    scale_params: 531.071378375
    scale_params: 532.164300081
    scale_params: 355.105960985
  }
}
layer {
  name: "bn2a_branch2a"
  type: "BatchNorm"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2a_branch2a"
  type: "Scale"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a_relu"
  type: "ReLU"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
}
layer {
  name: "res2a_branch2b"
  type: "Convolution"
  bottom: "res2a_branch2a"
  top: "res2a_branch2b"
  param {
    lr_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 28.8694091792
    scale_out: 25.1996591377
    scale_params: 598633.370723
    scale_params: 1007.98155201
    scale_params: 1377.41602879
    scale_params: 1230.8962175
    scale_params: 1660.78389278
    scale_params: 810.257821649
    scale_params: 660.864186415
    scale_params: 16198173.7614
    scale_params: 2417.19083187
    scale_params: 2847.80012398
    scale_params: 2092.75137744
    scale_params: 1214.15349391
    scale_params: 1314.06001706
    scale_params: 496.602704702
    scale_params: 460254.602426
    scale_params: 1381.81312051
    scale_params: 1079.41208618
    scale_params: 2704.01187467
    scale_params: 1269.53650067
    scale_params: 1783.3719975
    scale_params: 1750.39378052
    scale_params: 1702.9121288
    scale_params: 959.789237101
    scale_params: 1792.91969005
    scale_params: 2838.03505193
    scale_params: 936.173038805
    scale_params: 1593.77469459
    scale_params: 1104.49528639
    scale_params: 721.412867957
    scale_params: 679.677787064
    scale_params: 3495.40850802
    scale_params: 1158.01166405
    scale_params: 2080615.71036
    scale_params: 1216.664364
    scale_params: 451.108853209
    scale_params: 1611.65805488
    scale_params: 1686.9633698
    scale_params: 606.9957659
    scale_params: 8285025.66874
    scale_params: 662.569303034
    scale_params: 369.350762643
    scale_params: 786.393855835
    scale_params: 1388.32340077
    scale_params: 691.001003729
    scale_params: 1283.35602098
    scale_params: 408.772501916
    scale_params: 1517.91421677
    scale_params: 714.415283016
    scale_params: 1813.21421033
    scale_params: 878.851483541
    scale_params: 1424.24365743
    scale_params: 2432.71751649
    scale_params: 1032.73837008
    scale_params: 1061.02007632
    scale_params: 1465.15261511
    scale_params: 505.903258968
    scale_params: 558.279003984
    scale_params: 1030.87121805
    scale_params: 1821.32987538
    scale_params: 675.239181059
    scale_params: 3249.30602585
    scale_params: 675.355504169
    scale_params: 2434.52130042
    scale_params: 2345.75756899
  }
}
layer {
  name: "bn2a_branch2b"
  type: "BatchNorm"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2a_branch2b"
  type: "Scale"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2b_relu"
  type: "ReLU"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
}
layer {
  name: "res2a_branch2c"
  type: "Convolution"
  bottom: "res2a_branch2b"
  top: "res2a_branch2c"
  param {
    lr_mult: 0.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 25.1996591377
    scale_out: 15.1938521544
    scale_params: 1143.34990234
    scale_params: 166.814212963
    scale_params: 479.10430274
    scale_params: 1561.15895718
    scale_params: 509.2663044
    scale_params: 990.778437624
    scale_params: 278.20376409
    scale_params: 145.175778673
    scale_params: 1943.66931997
    scale_params: 432.250893429
    scale_params: 178.092359838
    scale_params: 229.397604806
    scale_params: 335.484883702
    scale_params: 325.078928626
    scale_params: 519.844220916
    scale_params: 297.672834973
    scale_params: 300.863606274
    scale_params: 347.092186361
    scale_params: 553.037944253
    scale_params: 292.986728801
    scale_params: 215.047293407
    scale_params: 538.915804683
    scale_params: 951.724135282
    scale_params: 1643.09720768
    scale_params: 501.862619557
    scale_params: 244.631536213
    scale_params: 472.856952603
    scale_params: 214.356870164
    scale_params: 170.295483151
    scale_params: 406.528482379
    scale_params: 105.820714316
    scale_params: 439.53710263
    scale_params: 1643.76839885
    scale_params: 329.501597979
    scale_params: 303.853370478
    scale_params: 1009.46853326
    scale_params: 366.360802143
    scale_params: 402.835976375
    scale_params: 2326.54781085
    scale_params: 508.783802638
    scale_params: 736.85140992
    scale_params: 190.530639867
    scale_params: 384.09013788
    scale_params: 391.943293388
    scale_params: 337.461339555
    scale_params: 625.648802044
    scale_params: 569.098598163
    scale_params: 130.055318787
    scale_params: 435.314094404
    scale_params: 808.237814732
    scale_params: 1378.89039975
    scale_params: 289.014567609
    scale_params: 2077.46768695
    scale_params: 270.453147215
    scale_params: 1720.78908929
    scale_params: 427.269191611
    scale_params: 556.873746829
    scale_params: 845.414342143
    scale_params: 394.793607984
    scale_params: 617.519548519
    scale_params: 113.929981209
    scale_params: 235.501579935
    scale_params: 568.996926499
    scale_params: 437.58819988
    scale_params: 252.195167483
    scale_params: 99.9359792545
    scale_params: 521.366570403
    scale_params: 447.798524688
    scale_params: 1056.95825896
    scale_params: 277.260604272
    scale_params: 550.888962675
    scale_params: 12587.157533
    scale_params: 61794.4850657
    scale_params: 501.792827566
    scale_params: 432.116156496
    scale_params: 2110.56504594
    scale_params: 231.784254949
    scale_params: 320.807774886
    scale_params: 109.859732021
    scale_params: 1043.45762723
    scale_params: 995.801230129
    scale_params: 214.543311398
    scale_params: 440.436352932
    scale_params: 230.543488051
    scale_params: 247.877185817
    scale_params: 872.918631114
    scale_params: 159.351618939
    scale_params: 488.96895652
    scale_params: 262.561277966
    scale_params: 414.554811074
    scale_params: 319.727933013
    scale_params: 936.661437392
    scale_params: 392.17038921
    scale_params: 662.651366256
    scale_params: 1823.79189302
    scale_params: 394.931654436
    scale_params: 437.799717765
    scale_params: 56186.4190707
    scale_params: 273.470307057
    scale_params: 706.238461904
    scale_params: 178.014854383
    scale_params: 870.721671492
    scale_params: 389.345027598
    scale_params: 346.239522536
    scale_params: 264.967988925
    scale_params: 338.580695683
    scale_params: 184.526849195
    scale_params: 265.653929667
    scale_params: 337.504877863
    scale_params: 459.066747074
    scale_params: 329.143210231
    scale_params: 154.716982634
    scale_params: 767.523633194
    scale_params: 279.133431587
    scale_params: 530.833719213
    scale_params: 549.443246405
    scale_params: 552.852582928
    scale_params: 205.952811073
    scale_params: 1342.20296152
    scale_params: 229.734058535
    scale_params: 658.074669337
    scale_params: 944.483736273
    scale_params: 451.879531108
    scale_params: 191.824523449
    scale_params: 473.306517525
    scale_params: 323.807964083
    scale_params: 457.336825828
    scale_params: 206.618004251
    scale_params: 786.358738417
    scale_params: 1040.45353715
    scale_params: 569.416080897
    scale_params: 331.330809575
    scale_params: 1041.29309769
    scale_params: 556.495811275
    scale_params: 281.897849614
    scale_params: 547.215086828
    scale_params: 266.583127279
    scale_params: 131.06876682
    scale_params: 537.066387249
    scale_params: 250.785408046
    scale_params: 1780.83696828
    scale_params: 492.139393725
    scale_params: 379.096070593
    scale_params: 689.222853036
    scale_params: 424.183805394
    scale_params: 731.427240681
    scale_params: 313.524344966
    scale_params: 553.348138149
    scale_params: 371.610785313
    scale_params: 842.118039637
    scale_params: 270.097435705
    scale_params: 340.906592804
    scale_params: 907.343052737
    scale_params: 1271.98105257
    scale_params: 12316.0074655
    scale_params: 378.207058998
    scale_params: 142.398211483
    scale_params: 312.776390658
    scale_params: 1556.84172735
    scale_params: 284.619332577
    scale_params: 991.970926731
    scale_params: 1351.59781031
    scale_params: 735.806596061
    scale_params: 857.905111319
    scale_params: 196.389043613
    scale_params: 34371.7657796
    scale_params: 199.584704703
    scale_params: 519.388760717
    scale_params: 170.4241885
    scale_params: 10213.7901906
    scale_params: 192.617008988
    scale_params: 538.923097206
    scale_params: 280.252858421
    scale_params: 1641.26737164
    scale_params: 1101.08187776
    scale_params: 5750.22039624
    scale_params: 371.787772935
    scale_params: 189.011618853
    scale_params: 224.05255687
    scale_params: 473.288066455
    scale_params: 1132.23790581
    scale_params: 570.951444287
    scale_params: 347.403669144
    scale_params: 2873.8884055
    scale_params: 851.469844834
    scale_params: 475.599708618
    scale_params: 326.992287306
    scale_params: 954.872872933
    scale_params: 401.0014244
    scale_params: 369.818806689
    scale_params: 390.39110394
    scale_params: 1436.79025788
    scale_params: 1768.08409722
    scale_params: 628.445680995
    scale_params: 1301.58305669
    scale_params: 157.556389777
    scale_params: 633.630782939
    scale_params: 237.889725879
    scale_params: 126.98239511
    scale_params: 518.751091587
    scale_params: 322.453275592
    scale_params: 502.542287885
    scale_params: 1316.07099115
    scale_params: 109.366076569
    scale_params: 681.700570799
    scale_params: 664.428813648
    scale_params: 1220.21103768
    scale_params: 816.822275753
    scale_params: 386.766977093
    scale_params: 414.05638822
    scale_params: 580.35162333
    scale_params: 321.187830927
    scale_params: 2925.37706764
    scale_params: 743.605129315
    scale_params: 242.668536303
    scale_params: 309.314139955
    scale_params: 1241.43484253
    scale_params: 401.20495416
    scale_params: 678.711154123
    scale_params: 487.323761244
    scale_params: 355.28386348
    scale_params: 811.560109621
    scale_params: 323.187512656
    scale_params: 867.813837039
    scale_params: 320.579878456
    scale_params: 248.288997406
    scale_params: 585.047540837
    scale_params: 491.995981749
    scale_params: 1471.3743774
    scale_params: 995.173343056
    scale_params: 482.532276084
    scale_params: 445.200776857
    scale_params: 471.58720187
    scale_params: 297.122020953
    scale_params: 581.224987089
    scale_params: 1463.96687447
    scale_params: 409.923010431
    scale_params: 396.888056838
    scale_params: 353.569868709
    scale_params: 361.978036916
    scale_params: 388.873657233
    scale_params: 406.519523973
    scale_params: 596.881176267
    scale_params: 485.332540052
    scale_params: 589.745384212
    scale_params: 899.799927195
    scale_params: 406.875954098
    scale_params: 268.909210507
    scale_params: 421.746936371
    scale_params: 967.378456108
    scale_params: 4600.97270104
    scale_params: 384.745759156
    scale_params: 196.093008565
    scale_params: 1923.01048291
    scale_params: 12420.0821709
    scale_params: 591.62444026
  }
}
layer {
  name: "bn2a_branch2c"
  type: "BatchNorm"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2a_branch2c"
  type: "Scale"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a"
  type: "Eltwise"
  bottom: "res2a_branch1"
  bottom: "res2a_branch2c"
  top: "res2a"
}
layer {
  name: "res2a_relu"
  type: "ReLU"
  bottom: "res2a"
  top: "res2a"
}
layer {
  name: "res2b_branch2a"
  type: "Convolution"
  bottom: "res2a"
  top: "res2b_branch2a"
  param {
    lr_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 15.1938521544
    scale_out: 32.6683475279
    scale_params: 903.269421858
    scale_params: 876.353190614
    scale_params: 648.451356327
    scale_params: 646.786085716
    scale_params: 800.704924854
    scale_params: 1250.11818324
    scale_params: 622.245458256
    scale_params: 703.142063011
    scale_params: 709.687893981
    scale_params: 881.917286616
    scale_params: 767.086425757
    scale_params: 871.299289706
    scale_params: 1304.65509139
    scale_params: 668.040691196
    scale_params: 872.974602505
    scale_params: 807.702560744
    scale_params: 670.119288705
    scale_params: 1140.3573712
    scale_params: 1104.91662013
    scale_params: 733.69412413
    scale_params: 3381.8552901
    scale_params: 665.61487484
    scale_params: 18352958.0645
    scale_params: 507.750077716
    scale_params: 975.253673896
    scale_params: 830.44769461
    scale_params: 515.156209704
    scale_params: 1076.12067773
    scale_params: 718.469739271
    scale_params: 789.157398965
    scale_params: 624.042608271
    scale_params: 832.69972359
    scale_params: 1339.40934313
    scale_params: 509.912001019
    scale_params: 1034.10733958
    scale_params: 1065004.47644
    scale_params: 1666.09354614
    scale_params: 714.575511248
    scale_params: 729.488315323
    scale_params: 684.733876511
    scale_params: 814.085517501
    scale_params: 531.824359463
    scale_params: 1206.20203017
    scale_params: 43678.1663071
    scale_params: 701.276898709
    scale_params: 11464229.8554
    scale_params: 766.498029573
    scale_params: 710.228966901
    scale_params: 653.107510299
    scale_params: 902.507474777
    scale_params: 883.844757474
    scale_params: 680.369631793
    scale_params: 745018.211955
    scale_params: 1025.11495529
    scale_params: 2141.49622689
    scale_params: 499.539118587
    scale_params: 1332.06262432
    scale_params: 818.21991413
    scale_params: 365.769400831
    scale_params: 1019.15370462
    scale_params: 972.251394694
    scale_params: 268297.890614
    scale_params: 936.563346406
    scale_params: 1082.43828661
  }
}
layer {
  name: "bn2b_branch2a"
  type: "BatchNorm"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2b_branch2a"
  type: "Scale"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2a_relu"
  type: "ReLU"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
}
layer {
  name: "res2b_branch2b"
  type: "Convolution"
  bottom: "res2b_branch2a"
  top: "res2b_branch2b"
  param {
    lr_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 32.6683475279
    scale_out: 28.3747596145
    scale_params: 686.626013517
    scale_params: 493.440158663
    scale_params: 675.126801989
    scale_params: 875.667896953
    scale_params: 921.667150563
    scale_params: 493.65102613
    scale_params: 884.368982925
    scale_params: 872.773550214
    scale_params: 312.672659627
    scale_params: 910.853845205
    scale_params: 651.409756427
    scale_params: 788.137408923
    scale_params: 849.827506119
    scale_params: 817.890600216
    scale_params: 1120.63579046
    scale_params: 905.470065543
    scale_params: 941.55029741
    scale_params: 411.271636984
    scale_params: 301.795545927
    scale_params: 1561.27506701
    scale_params: 547.858908309
    scale_params: 297.720085
    scale_params: 391.914456334
    scale_params: 732.576307555
    scale_params: 619.399552277
    scale_params: 601.678785769
    scale_params: 564.060623825
    scale_params: 517.030176179
    scale_params: 630.168942263
    scale_params: 1182.70997909
    scale_params: 562.086372209
    scale_params: 1036.14903174
    scale_params: 627.370453449
    scale_params: 610.856899169
    scale_params: 734.831892926
    scale_params: 826.805952929
    scale_params: 774.449049335
    scale_params: 504.337923141
    scale_params: 280.751895765
    scale_params: 368.252507737
    scale_params: 662.746900468
    scale_params: 378.420763119
    scale_params: 586.382663138
    scale_params: 281.191321697
    scale_params: 450.426432914
    scale_params: 589.332451564
    scale_params: 257.708172712
    scale_params: 1461.77662025
    scale_params: 732.207561849
    scale_params: 605.486211391
    scale_params: 889.904718629
    scale_params: 507.010168846
    scale_params: 515.738404968
    scale_params: 227.322805625
    scale_params: 1123.16401205
    scale_params: 837.439049393
    scale_params: 560.554821055
    scale_params: 412.273638037
    scale_params: 677.470465127
    scale_params: 764.825125616
    scale_params: 1276.83165013
    scale_params: 353.58427314
    scale_params: 495.608730103
    scale_params: 662.959658358
  }
}
layer {
  name: "bn2b_branch2b"
  type: "BatchNorm"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2b_branch2b"
  type: "Scale"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2b_relu"
  type: "ReLU"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
}
layer {
  name: "res2b_branch2c"
  type: "Convolution"
  bottom: "res2b_branch2b"
  top: "res2b_branch2c"
  param {
    lr_mult: 0.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 28.3747596145
    scale_out: 15.1938521544
    scale_params: 4532.90798828
    scale_params: 530.474310744
    scale_params: 221.431244855
    scale_params: 259.57785826
    scale_params: 794.044639206
    scale_params: 43220.765855
    scale_params: 772.682029177
    scale_params: 2366.96866376
    scale_params: 155.67911655
    scale_params: 215.088039962
    scale_params: 531.678846184
    scale_params: 298.542848798
    scale_params: 524.786217625
    scale_params: 1380.84216536
    scale_params: 12257.8589323
    scale_params: 583.679228595
    scale_params: 311.615945
    scale_params: 123.145892215
    scale_params: 118.29659371
    scale_params: 1008.90486282
    scale_params: 337.350366359
    scale_params: 188.289636961
    scale_params: 284.05141279
    scale_params: 152.221053422
    scale_params: 233.492402397
    scale_params: 308.784675329
    scale_params: 406.469348685
    scale_params: 183.028461368
    scale_params: 116.934223641
    scale_params: 520.434015794
    scale_params: 273.108125279
    scale_params: 115.053590285
    scale_params: 327.02091887
    scale_params: 141.185945908
    scale_params: 132.465363524
    scale_params: 156.953503319
    scale_params: 823.382823744
    scale_params: 13249.2444253
    scale_params: 53589.0538236
    scale_params: 150.338684863
    scale_params: 1452.50906823
    scale_params: 410.584763473
    scale_params: 163.70430146
    scale_params: 516.96369049
    scale_params: 672.238591449
    scale_params: 167.799034271
    scale_params: 201.229532817
    scale_params: 284.52486674
    scale_params: 2572.91434636
    scale_params: 11612.2731865
    scale_params: 166734.887658
    scale_params: 11531.7594258
    scale_params: 503.203595982
    scale_params: 202.637911387
    scale_params: 32158.5992367
    scale_params: 264.882641444
    scale_params: 525.099326267
    scale_params: 256242.138529
    scale_params: 157.244283759
    scale_params: 230.336879994
    scale_params: 205.143686028
    scale_params: 131.9431854
    scale_params: 208.036899173
    scale_params: 20273.1058298
    scale_params: 155.932545601
    scale_params: 525.675821681
    scale_params: 788.263806575
    scale_params: 1586.07517886
    scale_params: 291.641024613
    scale_params: 250.353778536
    scale_params: 548.960880632
    scale_params: 66559.7095459
    scale_params: 177.677380146
    scale_params: 408.887658326
    scale_params: 1444.51918976
    scale_params: 197.921034882
    scale_params: 628.238333567
    scale_params: 376.386525732
    scale_params: 824.612933208
    scale_params: 432.592451105
    scale_params: 207.000418041
    scale_params: 1487.87867823
    scale_params: 284.104248224
    scale_params: 1532.15827017
    scale_params: 774.118229519
    scale_params: 171.477574347
    scale_params: 1506.85026724
    scale_params: 448.018382429
    scale_params: 231.016839881
    scale_params: 32176.0477988
    scale_params: 17200.7191644
    scale_params: 243621.519239
    scale_params: 692.339932456
    scale_params: 248.897176585
    scale_params: 22243.2206561
    scale_params: 2033.52527583
    scale_params: 65.6962194033
    scale_params: 377.413036377
    scale_params: 426.598899039
    scale_params: 130097.798969
    scale_params: 1095.5347886
    scale_params: 43571.8132672
    scale_params: 507.559880427
    scale_params: 560.493294693
    scale_params: 383.117119001
    scale_params: 196.080448785
    scale_params: 186.01643194
    scale_params: 252.35744897
    scale_params: 180.73639591
    scale_params: 169.450008621
    scale_params: 1441.53770684
    scale_params: 1179.03634226
    scale_params: 451.893523373
    scale_params: 221.389462966
    scale_params: 2642.02720386
    scale_params: 15672.7228899
    scale_params: 804.10107747
    scale_params: 103.353371031
    scale_params: 1436.4324726
    scale_params: 213.951975573
    scale_params: 364.427276394
    scale_params: 403.034130591
    scale_params: 497.663899786
    scale_params: 721.376536798
    scale_params: 90953.8671704
    scale_params: 1321.46452025
    scale_params: 692.375085035
    scale_params: 406.416976417
    scale_params: 129680.875748
    scale_params: 161.125979763
    scale_params: 1439.97262391
    scale_params: 120.812262382
    scale_params: 179.804325687
    scale_params: 301.835070375
    scale_params: 180.696253204
    scale_params: 306.291085479
    scale_params: 435.158332761
    scale_params: 434.975508485
    scale_params: 163.761599739
    scale_params: 188.056164432
    scale_params: 234.156506893
    scale_params: 674.026386661
    scale_params: 327.367152515
    scale_params: 5165.85416224
    scale_params: 313.670426372
    scale_params: 157.502454302
    scale_params: 443.81594577
    scale_params: 147.790233805
    scale_params: 1485.62631559
    scale_params: 170.72425116
    scale_params: 199.978810401
    scale_params: 193.699369704
    scale_params: 246.30502335
    scale_params: 271.898873883
    scale_params: 3158.82529102
    scale_params: 174.208164024
    scale_params: 571.368198256
    scale_params: 5268.6760453
    scale_params: 144.911099108
    scale_params: 700.633355581
    scale_params: 268.475943018
    scale_params: 244.124444314
    scale_params: 28917.419842
    scale_params: 151.260396468
    scale_params: 161.725547405
    scale_params: 343865.165293
    scale_params: 419.918182913
    scale_params: 3352.19262896
    scale_params: 268.002903534
    scale_params: 591417.056849
    scale_params: 59.9638409027
    scale_params: 855.391750738
    scale_params: 810.967200021
    scale_params: 173.046972361
    scale_params: 3854.4961179
    scale_params: 170.160462581
    scale_params: 3293.90488679
    scale_params: 6435.38053837
    scale_params: 191.907695802
    scale_params: 375.913160741
    scale_params: 345.631002911
    scale_params: 363.15456094
    scale_params: 675.397837749
    scale_params: 181.521174027
    scale_params: 6538.93681833
    scale_params: 439.986018453
    scale_params: 182.299741212
    scale_params: 226.215193733
    scale_params: 10676.1514217
    scale_params: 481.748177848
    scale_params: 2098.66338363
    scale_params: 3662.32750034
    scale_params: 293.598159075
    scale_params: 303.203597677
    scale_params: 20107012.8943
    scale_params: 176.223666667
    scale_params: 240.781649436
    scale_params: 255.679489502
    scale_params: 454.122256282
    scale_params: 172.180857639
    scale_params: 431.170851263
    scale_params: 138396.509111
    scale_params: 288.872958511
    scale_params: 322.279133242
    scale_params: 121.23844076
    scale_params: 126.958500837
    scale_params: 234.763442637
    scale_params: 846.208740327
    scale_params: 263.397503795
    scale_params: 106.390354103
    scale_params: 525.622232023
    scale_params: 371.437948285
    scale_params: 186495.905503
    scale_params: 202.814400112
    scale_params: 317.926747255
    scale_params: 802.663821732
    scale_params: 208.094296991
    scale_params: 3089.8443184
    scale_params: 727.366535196
    scale_params: 267.637752196
    scale_params: 200.646851026
    scale_params: 282.441175708
    scale_params: 203.744347562
    scale_params: 568.377537911
    scale_params: 212.178454019
    scale_params: 245.934785637
    scale_params: 2879.24498524
    scale_params: 5282.94160302
    scale_params: 208.218506521
    scale_params: 160.299405614
    scale_params: 218.093042446
    scale_params: 152.805203178
    scale_params: 208.29538811
    scale_params: 1526.95220307
    scale_params: 148.294309621
    scale_params: 17399.2820771
    scale_params: 315.112243628
    scale_params: 207.901991782
    scale_params: 426.854859668
    scale_params: 1310.75386544
    scale_params: 574.362743065
    scale_params: 812.090430781
    scale_params: 203.195484872
    scale_params: 156.90641544
    scale_params: 165.269921337
    scale_params: 182346.351421
    scale_params: 1907.84786152
    scale_params: 524.066329226
    scale_params: 1097.15564378
    scale_params: 216.688562108
    scale_params: 249873.752745
    scale_params: 159.242921066
    scale_params: 419.193860787
    scale_params: 187.531992604
    scale_params: 287.981519068
    scale_params: 192.229227271
  }
}
layer {
  name: "bn2b_branch2c"
  type: "BatchNorm"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2b_branch2c"
  type: "Scale"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b"
  type: "Eltwise"
  bottom: "res2a"
  bottom: "res2b_branch2c"
  top: "res2b"
}
layer {
  name: "res2b_relu"
  type: "ReLU"
  bottom: "res2b"
  top: "res2b"
}
layer {
  name: "res2c_branch2a"
  type: "Convolution"
  bottom: "res2b"
  top: "res2c_branch2a"
  param {
    lr_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 15.1938521544
    scale_out: 23.108737476
    scale_params: 698.899559447
    scale_params: 1266.20121883
    scale_params: 785.817427541
    scale_params: 1076.39861309
    scale_params: 475.963689979
    scale_params: 907.939538919
    scale_params: 1071.82914068
    scale_params: 1073.99748614
    scale_params: 648.172920222
    scale_params: 833.775100147
    scale_params: 681.071975349
    scale_params: 1120.272179
    scale_params: 1050.28018556
    scale_params: 750.126385898
    scale_params: 1007.25107112
    scale_params: 923.721333275
    scale_params: 656.072382974
    scale_params: 301.265202857
    scale_params: 474.941793113
    scale_params: 785.636914759
    scale_params: 883.598358962
    scale_params: 952.622277264
    scale_params: 1065.39170328
    scale_params: 348.391375414
    scale_params: 978.818446537
    scale_params: 559.349870818
    scale_params: 1362.47243335
    scale_params: 824.051714727
    scale_params: 1157.81643663
    scale_params: 1035.82640176
    scale_params: 397518.77033
    scale_params: 364.70573076
    scale_params: 111568.054104
    scale_params: 389.455796617
    scale_params: 1015.99127967
    scale_params: 822.288291696
    scale_params: 883.14303469
    scale_params: 1040.12212843
    scale_params: 1234.80612336
    scale_params: 1095.38539744
    scale_params: 1351.52193679
    scale_params: 1123.19509585
    scale_params: 921.346922372
    scale_params: 858.56027971
    scale_params: 901.674689266
    scale_params: 1066.5964675
    scale_params: 904.996347555
    scale_params: 406.461400877
    scale_params: 936.460131176
    scale_params: 1424.47943981
    scale_params: 665.935869448
    scale_params: 707.292727002
    scale_params: 1244.856824
    scale_params: 527.538057607
    scale_params: 911.467434609
    scale_params: 558.680972547
    scale_params: 2196713.07446
    scale_params: 649.134601112
    scale_params: 836.452869535
    scale_params: 818.266890843
    scale_params: 1083.08053668
    scale_params: 872.37100897
    scale_params: 485.994414514
    scale_params: 1341.74010515
  }
}
layer {
  name: "bn2c_branch2a"
  type: "BatchNorm"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2c_branch2a"
  type: "Scale"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2a_relu"
  type: "ReLU"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
}
layer {
  name: "res2c_branch2b"
  type: "Convolution"
  bottom: "res2c_branch2a"
  top: "res2c_branch2b"
  param {
    lr_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 23.108737476
    scale_out: 19.9596174881
    scale_params: 641.012871287
    scale_params: 590.206058214
    scale_params: 530.017905681
    scale_params: 517.264957231
    scale_params: 685.027988664
    scale_params: 902.425006078
    scale_params: 595.863292196
    scale_params: 592.652154053
    scale_params: 598.715866105
    scale_params: 553.221885784
    scale_params: 371.268571236
    scale_params: 551.378755072
    scale_params: 788.957089782
    scale_params: 464.820537208
    scale_params: 446.862150248
    scale_params: 550.520277685
    scale_params: 461.003625251
    scale_params: 895.508687602
    scale_params: 710.12363286
    scale_params: 690.748484039
    scale_params: 522.308458654
    scale_params: 574.179562819
    scale_params: 449.088543335
    scale_params: 876.822195589
    scale_params: 479.175792238
    scale_params: 607.637634947
    scale_params: 594.087797838
    scale_params: 883.565107059
    scale_params: 660.321039578
    scale_params: 685.864648767
    scale_params: 560.172831476
    scale_params: 453.133979087
    scale_params: 666.146514742
    scale_params: 562.488424169
    scale_params: 471.819866198
    scale_params: 743.430452419
    scale_params: 554.854597063
    scale_params: 731.032624465
    scale_params: 1164.74800627
    scale_params: 624.537301533
    scale_params: 575.16365998
    scale_params: 620.061169851
    scale_params: 613.499402757
    scale_params: 501.648813694
    scale_params: 1024.437687
    scale_params: 602.732125246
    scale_params: 508.513417051
    scale_params: 563.654681799
    scale_params: 574.76581021
    scale_params: 612.819538609
    scale_params: 626.534167357
    scale_params: 682.057084614
    scale_params: 559.69118757
    scale_params: 529.503919795
    scale_params: 532.949978029
    scale_params: 649.762166631
    scale_params: 828.545006916
    scale_params: 663.146752716
    scale_params: 551.722660444
    scale_params: 425.236977444
    scale_params: 520.268211164
    scale_params: 363.099915399
    scale_params: 614.808756014
    scale_params: 698.280622131
  }
}
layer {
  name: "bn2c_branch2b"
  type: "BatchNorm"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2c_branch2b"
  type: "Scale"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2b_relu"
  type: "ReLU"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
}
layer {
  name: "res2c_branch2c"
  type: "Convolution"
  bottom: "res2c_branch2b"
  top: "res2c_branch2c"
  param {
    lr_mult: 0.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 19.9596174881
    scale_out: 16.4823365284
    scale_params: 170.447814903
    scale_params: 43029.6878505
    scale_params: 207.946143214
