name: "InceptionV3"
bn_stats_batch_size: 32
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  data_param {

source: "examples/imagenet/ilsvrc12_train_lmdb"

    shuffle: true
    backend: LMDB
    batch_size: 64
  }
  transform_param {
    crop_size: 299
    #scale: 0.0078125
    mean_value: 104
    mean_value: 117
    mean_value: 123
    mirror: true

    random_aspect_ratio_param {
        min_area_ratio: 0.05
        max_area_ratio: 1
        aspect_ratio_change: 0.75
        resize_param {
        interp_mode: CUBIC
        }
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  data_param {
source: "examples/imagenet/ilsvrc12_val_lmdb"
    shuffle: false
    backend: LMDB
    batch_size: 50
  }
  transform_param {
    crop_size: 299
    #scale: 0.0078125
    mean_value: 104
    mean_value: 117
    mean_value: 123

    mirror: false

    random_resize_param {
        min_size: 320
        max_size: 320
        resize_param {
        interp_mode: CUBIC
        }
    }
  }
  include: { phase: TEST }
}
layer {
  name: "conv_conv2d"
  type: "Convolution"
  bottom: "data"
  top: "conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
      variance_norm: FAN_OUT
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv_batchnorm"
  type: "BatchNorm"
  bottom: "conv_conv2d"
  top: "conv_conv2d_bn"

  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001
  }
}
layer {
  bottom: "conv_conv2d_bn"
  top: "conv_conv2d_bn"
  name: "conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv_relu"
  type: "ReLU"
  bottom: "conv_conv2d_bn"
  top: "conv_conv2d_relu"
}
layer {
  name: "conv_1_1_conv2d"
  type: "Convolution"
  bottom: "conv_conv2d_relu"
  top: "conv_1_1_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv_1_1_batchnorm"
  type: "BatchNorm"
  bottom: "conv_1_1_conv2d"
  top: "conv_1_1_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "conv_1_1_conv2d_bn"
  top: "conv_1_1_conv2d_bn"
  name: "conv_1_1_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv_1_1_relu"
  type: "ReLU"
  bottom: "conv_1_1_conv2d_bn"
  top: "conv_1_1_conv2d_relu"
}
layer {
  name: "conv_2_2_conv2d"
  type: "Convolution"
  bottom: "conv_1_1_conv2d_relu"
  top: "conv_2_2_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv_2_2_batchnorm"
  type: "BatchNorm"
  bottom: "conv_2_2_conv2d"
  top: "conv_2_2_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "conv_2_2_conv2d_bn"
  top: "conv_2_2_conv2d_bn"
  name: "conv_2_2_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv_2_2_relu"
  type: "ReLU"
  bottom: "conv_2_2_conv2d_bn"
  top: "conv_2_2_conv2d_relu"
}
layer {
  name: "pool"
  type: "Pooling"
  bottom: "conv_2_2_conv2d_relu"
  top: "pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "conv_3_3_conv2d"
  type: "Convolution"
  bottom: "pool"
  top: "conv_3_3_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 80
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }

  }
}
layer {
  name: "conv_3_3_batchnorm"
  type: "BatchNorm"
  bottom: "conv_3_3_conv2d"
  top: "conv_3_3_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "conv_3_3_conv2d_bn"
  top: "conv_3_3_conv2d_bn"
  name: "conv_3_3_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv_3_3_relu"
  type: "ReLU"
  bottom: "conv_3_3_conv2d_bn"
  top: "conv_3_3_conv2d_relu"
}
layer {
  name: "conv_4_4_conv2d"
  type: "Convolution"
  bottom: "conv_3_3_conv2d_relu"
  top: "conv_4_4_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }

  }
}
layer {
  name: "conv_4_4_batchnorm"
  type: "BatchNorm"
  bottom: "conv_4_4_conv2d"
  top: "conv_4_4_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "conv_4_4_conv2d_bn"
  top: "conv_4_4_conv2d_bn"
  name: "conv_4_4_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv_4_4_relu"
  type: "ReLU"
  bottom: "conv_4_4_conv2d_bn"
  top: "conv_4_4_conv2d_relu"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv_4_4_conv2d_relu"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "mixed_conv_conv2d"
  type: "Convolution"
  bottom: "pool1"
  top: "mixed_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_conv_conv2d"
  top: "mixed_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_conv_conv2d_bn"
  top: "mixed_conv_conv2d_bn"
  name: "mixed_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_conv_relu"
  type: "ReLU"
  bottom: "mixed_conv_conv2d_bn"
  top: "mixed_conv_conv2d_relu"
}
layer {
  name: "mixed_tower_conv_conv2d"
  type: "Convolution"
  bottom: "pool1"
  top: "mixed_tower_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }

  }
}
layer {
  name: "mixed_tower_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_tower_conv_conv2d"
  top: "mixed_tower_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_tower_conv_conv2d_bn"
  top: "mixed_tower_conv_conv2d_bn"
  name: "mixed_tower_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_tower_conv_relu"
  type: "ReLU"
  bottom: "mixed_tower_conv_conv2d_bn"
  top: "mixed_tower_conv_conv2d_relu"
}
layer {
  name: "mixed_tower_conv_1_conv2d"
  type: "Convolution"
  bottom: "mixed_tower_conv_conv2d_relu"
  top: "mixed_tower_conv_1_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }

  }
}
layer {
  name: "mixed_tower_conv_1_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_tower_conv_1_conv2d"
  top: "mixed_tower_conv_1_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_tower_conv_1_conv2d_bn"
  top: "mixed_tower_conv_1_conv2d_bn"
  name: "mixed_tower_conv_1_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_tower_conv_1_relu"
  type: "ReLU"
  bottom: "mixed_tower_conv_1_conv2d_bn"
  top: "mixed_tower_conv_1_conv2d_relu"
}
layer {
  name: "mixed_tower_1_conv_conv2d"
  type: "Convolution"
  bottom: "pool1"
  top: "mixed_tower_1_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }


  }
}
layer {
  name: "mixed_tower_1_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_tower_1_conv_conv2d"
  top: "mixed_tower_1_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_tower_1_conv_conv2d_bn"
  top: "mixed_tower_1_conv_conv2d_bn"
  name: "mixed_tower_1_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_tower_1_conv_relu"
  type: "ReLU"
  bottom: "mixed_tower_1_conv_conv2d_bn"
  top: "mixed_tower_1_conv_conv2d_relu"
}
layer {
  name: "mixed_tower_1_conv_1_conv2d"
  type: "Convolution"
  bottom: "mixed_tower_1_conv_conv2d_relu"
  top: "mixed_tower_1_conv_1_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }


  }
}
layer {
  name: "mixed_tower_1_conv_1_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_tower_1_conv_1_conv2d"
  top: "mixed_tower_1_conv_1_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_tower_1_conv_1_conv2d_bn"
  top: "mixed_tower_1_conv_1_conv2d_bn"
  name: "mixed_tower_1_conv_1_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_tower_1_conv_1_relu"
  type: "ReLU"
  bottom: "mixed_tower_1_conv_1_conv2d_bn"
  top: "mixed_tower_1_conv_1_conv2d_relu"
}
layer {
  name: "mixed_tower_1_conv_2_conv2d"
  type: "Convolution"
  bottom: "mixed_tower_1_conv_1_conv2d_relu"
  top: "mixed_tower_1_conv_2_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }


  }
}
layer {
  name: "mixed_tower_1_conv_2_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_tower_1_conv_2_conv2d"
  top: "mixed_tower_1_conv_2_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_tower_1_conv_2_conv2d_bn"
  top: "mixed_tower_1_conv_2_conv2d_bn"
  name: "mixed_tower_1_conv_2_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_tower_1_conv_2_relu"
  type: "ReLU"
  bottom: "mixed_tower_1_conv_2_conv2d_bn"
  top: "mixed_tower_1_conv_2_conv2d_relu"
}
layer {
  name: "AVE_pool_mixed_pool"
  type: "Pooling"
  bottom: "pool1"
  top: "AVE_pool_mixed_pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "mixed_tower_2_conv_conv2d"
  type: "Convolution"
  bottom: "AVE_pool_mixed_pool"
  top: "mixed_tower_2_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }


  }
}
layer {
  name: "mixed_tower_2_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_tower_2_conv_conv2d"
  top: "mixed_tower_2_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_tower_2_conv_conv2d_bn"
  top: "mixed_tower_2_conv_conv2d_bn"
  name: "mixed_tower_2_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_tower_2_conv_relu"
  type: "ReLU"
  bottom: "mixed_tower_2_conv_conv2d_bn"
  top: "mixed_tower_2_conv_conv2d_relu"
}
layer {
  name: "ch_concat_mixed_chconcat"
  type: "Concat"
  bottom: "mixed_conv_conv2d_relu"
  bottom: "mixed_tower_conv_1_conv2d_relu"
  bottom: "mixed_tower_1_conv_2_conv2d_relu"
  bottom: "mixed_tower_2_conv_conv2d_relu"
  top: "ch_concat_mixed_chconcat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "mixed_1_conv_conv2d"
  type: "Convolution"
  bottom: "ch_concat_mixed_chconcat"
  top: "mixed_1_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_1_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_1_conv_conv2d"
  top: "mixed_1_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_1_conv_conv2d_bn"
  top: "mixed_1_conv_conv2d_bn"
  name: "mixed_1_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_1_conv_relu"
  type: "ReLU"
  bottom: "mixed_1_conv_conv2d_bn"
  top: "mixed_1_conv_conv2d_relu"
}
layer {
  name: "mixed_1_tower_conv_conv2d"
  type: "Convolution"
  bottom: "ch_concat_mixed_chconcat"
  top: "mixed_1_tower_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }

  }
}
layer {
  name: "mixed_1_tower_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_1_tower_conv_conv2d"
  top: "mixed_1_tower_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_1_tower_conv_conv2d_bn"
  top: "mixed_1_tower_conv_conv2d_bn"
  name: "mixed_1_tower_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_1_tower_conv_relu"
  type: "ReLU"
  bottom: "mixed_1_tower_conv_conv2d_bn"
  top: "mixed_1_tower_conv_conv2d_relu"
}
layer {
  name: "mixed_1_tower_conv_1_conv2d"
  type: "Convolution"
  bottom: "mixed_1_tower_conv_conv2d_relu"
  top: "mixed_1_tower_conv_1_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }

  }
}
layer {
  name: "mixed_1_tower_conv_1_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_1_tower_conv_1_conv2d"
  top: "mixed_1_tower_conv_1_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_1_tower_conv_1_conv2d_bn"
  top: "mixed_1_tower_conv_1_conv2d_bn"
  name: "mixed_1_tower_conv_1_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_1_tower_conv_1_relu"
  type: "ReLU"
  bottom: "mixed_1_tower_conv_1_conv2d_bn"
  top: "mixed_1_tower_conv_1_conv2d_relu"
}
layer {
  name: "mixed_1_tower_1_conv_conv2d"
  type: "Convolution"
  bottom: "ch_concat_mixed_chconcat"
  top: "mixed_1_tower_1_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_1_tower_1_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_1_tower_1_conv_conv2d"
  top: "mixed_1_tower_1_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_1_tower_1_conv_conv2d_bn"
  top: "mixed_1_tower_1_conv_conv2d_bn"
  name: "mixed_1_tower_1_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_1_tower_1_conv_relu"
  type: "ReLU"
  bottom: "mixed_1_tower_1_conv_conv2d_bn"
  top: "mixed_1_tower_1_conv_conv2d_relu"
}
layer {
  name: "mixed_1_tower_1_conv_1_conv2d"
  type: "Convolution"
  bottom: "mixed_1_tower_1_conv_conv2d_relu"
  top: "mixed_1_tower_1_conv_1_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_1_tower_1_conv_1_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_1_tower_1_conv_1_conv2d"
  top: "mixed_1_tower_1_conv_1_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_1_tower_1_conv_1_conv2d_bn"
  top: "mixed_1_tower_1_conv_1_conv2d_bn"
  name: "mixed_1_tower_1_conv_1_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_1_tower_1_conv_1_relu"
  type: "ReLU"
  bottom: "mixed_1_tower_1_conv_1_conv2d_bn"
  top: "mixed_1_tower_1_conv_1_conv2d_relu"
}
layer {
  name: "mixed_1_tower_1_conv_2_conv2d"
  type: "Convolution"
  bottom: "mixed_1_tower_1_conv_1_conv2d_relu"
  top: "mixed_1_tower_1_conv_2_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_1_tower_1_conv_2_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_1_tower_1_conv_2_conv2d"
  top: "mixed_1_tower_1_conv_2_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_1_tower_1_conv_2_conv2d_bn"
  top: "mixed_1_tower_1_conv_2_conv2d_bn"
  name: "mixed_1_tower_1_conv_2_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_1_tower_1_conv_2_relu"
  type: "ReLU"
  bottom: "mixed_1_tower_1_conv_2_conv2d_bn"
  top: "mixed_1_tower_1_conv_2_conv2d_relu"
}
layer {
  name: "AVE_pool_mixed_1_pool"
  type: "Pooling"
  bottom: "ch_concat_mixed_chconcat"
  top: "AVE_pool_mixed_1_pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "mixed_1_tower_2_conv_conv2d"
  type: "Convolution"
  bottom: "AVE_pool_mixed_1_pool"
  top: "mixed_1_tower_2_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_1_tower_2_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_1_tower_2_conv_conv2d"
  top: "mixed_1_tower_2_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_1_tower_2_conv_conv2d_bn"
  top: "mixed_1_tower_2_conv_conv2d_bn"
  name: "mixed_1_tower_2_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_1_tower_2_conv_relu"
  type: "ReLU"
  bottom: "mixed_1_tower_2_conv_conv2d_bn"
  top: "mixed_1_tower_2_conv_conv2d_relu"
}
layer {
  name: "ch_concat_mixed_1_chconcat"
  type: "Concat"
  bottom: "mixed_1_conv_conv2d_relu"
  bottom: "mixed_1_tower_conv_1_conv2d_relu"
  bottom: "mixed_1_tower_1_conv_2_conv2d_relu"
  bottom: "mixed_1_tower_2_conv_conv2d_relu"
  top: "ch_concat_mixed_1_chconcat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "mixed_2_conv_conv2d"
  type: "Convolution"
  bottom: "ch_concat_mixed_1_chconcat"
  top: "mixed_2_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }

  }
}
layer {
  name: "mixed_2_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_2_conv_conv2d"
  top: "mixed_2_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_2_conv_conv2d_bn"
  top: "mixed_2_conv_conv2d_bn"
  name: "mixed_2_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_2_conv_relu"
  type: "ReLU"
  bottom: "mixed_2_conv_conv2d_bn"
  top: "mixed_2_conv_conv2d_relu"
}
layer {
  name: "mixed_2_tower_conv_conv2d"
  type: "Convolution"
  bottom: "ch_concat_mixed_1_chconcat"
  top: "mixed_2_tower_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }

  }
}
layer {
  name: "mixed_2_tower_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_2_tower_conv_conv2d"
  top: "mixed_2_tower_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_2_tower_conv_conv2d_bn"
  top: "mixed_2_tower_conv_conv2d_bn"
  name: "mixed_2_tower_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_2_tower_conv_relu"
  type: "ReLU"
  bottom: "mixed_2_tower_conv_conv2d_bn"
  top: "mixed_2_tower_conv_conv2d_relu"
}
layer {
  name: "mixed_2_tower_conv_1_conv2d"
  type: "Convolution"
  bottom: "mixed_2_tower_conv_conv2d_relu"
  top: "mixed_2_tower_conv_1_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }

  }
}
layer {
  name: "mixed_2_tower_conv_1_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_2_tower_conv_1_conv2d"
  top: "mixed_2_tower_conv_1_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_2_tower_conv_1_conv2d_bn"
  top: "mixed_2_tower_conv_1_conv2d_bn"
  name: "mixed_2_tower_conv_1_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_2_tower_conv_1_relu"
  type: "ReLU"
  bottom: "mixed_2_tower_conv_1_conv2d_bn"
  top: "mixed_2_tower_conv_1_conv2d_relu"
}
layer {
  name: "mixed_2_tower_1_conv_conv2d"
  type: "Convolution"
  bottom: "ch_concat_mixed_1_chconcat"
  top: "mixed_2_tower_1_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_2_tower_1_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_2_tower_1_conv_conv2d"
  top: "mixed_2_tower_1_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_2_tower_1_conv_conv2d_bn"
  top: "mixed_2_tower_1_conv_conv2d_bn"
  name: "mixed_2_tower_1_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_2_tower_1_conv_relu"
  type: "ReLU"
  bottom: "mixed_2_tower_1_conv_conv2d_bn"
  top: "mixed_2_tower_1_conv_conv2d_relu"
}
layer {
  name: "mixed_2_tower_1_conv_1_conv2d"
  type: "Convolution"
  bottom: "mixed_2_tower_1_conv_conv2d_relu"
  top: "mixed_2_tower_1_conv_1_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_2_tower_1_conv_1_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_2_tower_1_conv_1_conv2d"
  top: "mixed_2_tower_1_conv_1_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_2_tower_1_conv_1_conv2d_bn"
  top: "mixed_2_tower_1_conv_1_conv2d_bn"
  name: "mixed_2_tower_1_conv_1_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_2_tower_1_conv_1_relu"
  type: "ReLU"
  bottom: "mixed_2_tower_1_conv_1_conv2d_bn"
  top: "mixed_2_tower_1_conv_1_conv2d_relu"
}
layer {
  name: "mixed_2_tower_1_conv_2_conv2d"
  type: "Convolution"
  bottom: "mixed_2_tower_1_conv_1_conv2d_relu"
  top: "mixed_2_tower_1_conv_2_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }

  }
}
layer {
  name: "mixed_2_tower_1_conv_2_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_2_tower_1_conv_2_conv2d"
  top: "mixed_2_tower_1_conv_2_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_2_tower_1_conv_2_conv2d_bn"
  top: "mixed_2_tower_1_conv_2_conv2d_bn"
  name: "mixed_2_tower_1_conv_2_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_2_tower_1_conv_2_relu"
  type: "ReLU"
  bottom: "mixed_2_tower_1_conv_2_conv2d_bn"
  top: "mixed_2_tower_1_conv_2_conv2d_relu"
}
layer {
  name: "AVE_pool_mixed_2_pool"
  type: "Pooling"
  bottom: "ch_concat_mixed_1_chconcat"
  top: "AVE_pool_mixed_2_pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "mixed_2_tower_2_conv_conv2d"
  type: "Convolution"
  bottom: "AVE_pool_mixed_2_pool"
  top: "mixed_2_tower_2_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_2_tower_2_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_2_tower_2_conv_conv2d"
  top: "mixed_2_tower_2_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_2_tower_2_conv_conv2d_bn"
  top: "mixed_2_tower_2_conv_conv2d_bn"
  name: "mixed_2_tower_2_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_2_tower_2_conv_relu"
  type: "ReLU"
  bottom: "mixed_2_tower_2_conv_conv2d_bn"
  top: "mixed_2_tower_2_conv_conv2d_relu"
}
layer {
  name: "ch_concat_mixed_2_chconcat"
  type: "Concat"
  bottom: "mixed_2_conv_conv2d_relu"
  bottom: "mixed_2_tower_conv_1_conv2d_relu"
  bottom: "mixed_2_tower_1_conv_2_conv2d_relu"
  bottom: "mixed_2_tower_2_conv_conv2d_relu"
  top: "ch_concat_mixed_2_chconcat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "mixed_3_conv_conv2d"
  type: "Convolution"
  bottom: "ch_concat_mixed_2_chconcat"
  top: "mixed_3_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 384
    bias_term: false
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_3_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_3_conv_conv2d"
  top: "mixed_3_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_3_conv_conv2d_bn"
  top: "mixed_3_conv_conv2d_bn"
  name: "mixed_3_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_3_conv_relu"
  type: "ReLU"
  bottom: "mixed_3_conv_conv2d_bn"
  top: "mixed_3_conv_conv2d_relu"
}
layer {
  name: "mixed_3_tower_conv_conv2d"
  type: "Convolution"
  bottom: "ch_concat_mixed_2_chconcat"
  top: "mixed_3_tower_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_3_tower_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_3_tower_conv_conv2d"
  top: "mixed_3_tower_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_3_tower_conv_conv2d_bn"
  top: "mixed_3_tower_conv_conv2d_bn"
  name: "mixed_3_tower_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_3_tower_conv_relu"
  type: "ReLU"
  bottom: "mixed_3_tower_conv_conv2d_bn"
  top: "mixed_3_tower_conv_conv2d_relu"
}
layer {
  name: "mixed_3_tower_conv_1_conv2d"
  type: "Convolution"
  bottom: "mixed_3_tower_conv_conv2d_relu"
  top: "mixed_3_tower_conv_1_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_3_tower_conv_1_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_3_tower_conv_1_conv2d"
  top: "mixed_3_tower_conv_1_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_3_tower_conv_1_conv2d_bn"
  top: "mixed_3_tower_conv_1_conv2d_bn"
  name: "mixed_3_tower_conv_1_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_3_tower_conv_1_relu"
  type: "ReLU"
  bottom: "mixed_3_tower_conv_1_conv2d_bn"
  top: "mixed_3_tower_conv_1_conv2d_relu"
}
layer {
  name: "mixed_3_tower_conv_2_conv2d"
  type: "Convolution"
  bottom: "mixed_3_tower_conv_1_conv2d_relu"
  top: "mixed_3_tower_conv_2_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_3_tower_conv_2_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_3_tower_conv_2_conv2d"
  top: "mixed_3_tower_conv_2_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_3_tower_conv_2_conv2d_bn"
  top: "mixed_3_tower_conv_2_conv2d_bn"
  name: "mixed_3_tower_conv_2_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_3_tower_conv_2_relu"
  type: "ReLU"
  bottom: "mixed_3_tower_conv_2_conv2d_bn"
  top: "mixed_3_tower_conv_2_conv2d_relu"
}
layer {
  name: "max_pool_mixed_3_pool"
  type: "Pooling"
  bottom: "ch_concat_mixed_2_chconcat"
  top: "max_pool_mixed_3_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "ch_concat_mixed_3_chconcat"
  type: "Concat"
  bottom: "max_pool_mixed_3_pool"
  bottom: "mixed_3_conv_conv2d_relu"
  bottom: "mixed_3_tower_conv_2_conv2d_relu"
  top: "ch_concat_mixed_3_chconcat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "mixed_4_conv_conv2d"
  type: "Convolution"
  bottom: "ch_concat_mixed_3_chconcat"
  top: "mixed_4_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_4_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_4_conv_conv2d"
  top: "mixed_4_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_4_conv_conv2d_bn"
  top: "mixed_4_conv_conv2d_bn"
  name: "mixed_4_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_4_conv_relu"
  type: "ReLU"
  bottom: "mixed_4_conv_conv2d_bn"
  top: "mixed_4_conv_conv2d_relu"
}
layer {
  name: "mixed_4_tower_conv_conv2d"
  type: "Convolution"
  bottom: "ch_concat_mixed_3_chconcat"
  top: "mixed_4_tower_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_4_tower_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_4_tower_conv_conv2d"
  top: "mixed_4_tower_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_4_tower_conv_conv2d_bn"
  top: "mixed_4_tower_conv_conv2d_bn"
  name: "mixed_4_tower_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_4_tower_conv_relu"
  type: "ReLU"
  bottom: "mixed_4_tower_conv_conv2d_bn"
  top: "mixed_4_tower_conv_conv2d_relu"
}
layer {
  name: "mixed_4_tower_conv_1_conv2d"
  type: "Convolution"
  bottom: "mixed_4_tower_conv_conv2d_relu"
  top: "mixed_4_tower_conv_1_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
  }
}
layer {
  name: "mixed_4_tower_conv_1_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_4_tower_conv_1_conv2d"
  top: "mixed_4_tower_conv_1_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_4_tower_conv_1_conv2d_bn"
  top: "mixed_4_tower_conv_1_conv2d_bn"
  name: "mixed_4_tower_conv_1_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_4_tower_conv_1_relu"
  type: "ReLU"
  bottom: "mixed_4_tower_conv_1_conv2d_bn"
  top: "mixed_4_tower_conv_1_conv2d_relu"
}
layer {
  name: "mixed_4_tower_conv_2_conv2d"
  type: "Convolution"
  bottom: "mixed_4_tower_conv_1_conv2d_relu"
  top: "mixed_4_tower_conv_2_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }

    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
  }
}
layer {
  name: "mixed_4_tower_conv_2_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_4_tower_conv_2_conv2d"
  top: "mixed_4_tower_conv_2_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_4_tower_conv_2_conv2d_bn"
  top: "mixed_4_tower_conv_2_conv2d_bn"
  name: "mixed_4_tower_conv_2_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_4_tower_conv_2_relu"
  type: "ReLU"
  bottom: "mixed_4_tower_conv_2_conv2d_bn"
  top: "mixed_4_tower_conv_2_conv2d_relu"
}
layer {
  name: "mixed_4_tower_1_conv_conv2d"
  type: "Convolution"
  bottom: "ch_concat_mixed_3_chconcat"
  top: "mixed_4_tower_1_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }


  }
}
layer {
  name: "mixed_4_tower_1_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_4_tower_1_conv_conv2d"
  top: "mixed_4_tower_1_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_4_tower_1_conv_conv2d_bn"
  top: "mixed_4_tower_1_conv_conv2d_bn"
  name: "mixed_4_tower_1_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_4_tower_1_conv_relu"
  type: "ReLU"
  bottom: "mixed_4_tower_1_conv_conv2d_bn"
  top: "mixed_4_tower_1_conv_conv2d_relu"
}
layer {
  name: "mixed_4_tower_1_conv_1_conv2d"
  type: "Convolution"
  bottom: "mixed_4_tower_1_conv_conv2d_relu"
  top: "mixed_4_tower_1_conv_1_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
  }
}
layer {
  name: "mixed_4_tower_1_conv_1_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_4_tower_1_conv_1_conv2d"
  top: "mixed_4_tower_1_conv_1_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_4_tower_1_conv_1_conv2d_bn"
  top: "mixed_4_tower_1_conv_1_conv2d_bn"
  name: "mixed_4_tower_1_conv_1_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_4_tower_1_conv_1_relu"
  type: "ReLU"
  bottom: "mixed_4_tower_1_conv_1_conv2d_bn"
  top: "mixed_4_tower_1_conv_1_conv2d_relu"
}
layer {
  name: "mixed_4_tower_1_conv_2_conv2d"
  type: "Convolution"
  bottom: "mixed_4_tower_1_conv_1_conv2d_relu"
  top: "mixed_4_tower_1_conv_2_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
  }
}
layer {
  name: "mixed_4_tower_1_conv_2_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_4_tower_1_conv_2_conv2d"
  top: "mixed_4_tower_1_conv_2_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_4_tower_1_conv_2_conv2d_bn"
  top: "mixed_4_tower_1_conv_2_conv2d_bn"
  name: "mixed_4_tower_1_conv_2_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_4_tower_1_conv_2_relu"
  type: "ReLU"
  bottom: "mixed_4_tower_1_conv_2_conv2d_bn"
  top: "mixed_4_tower_1_conv_2_conv2d_relu"
}
layer {
  name: "mixed_4_tower_1_conv_3_conv2d"
  type: "Convolution"
  bottom: "mixed_4_tower_1_conv_2_conv2d_relu"
  top: "mixed_4_tower_1_conv_3_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
  }
}
layer {
  name: "mixed_4_tower_1_conv_3_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_4_tower_1_conv_3_conv2d"
  top: "mixed_4_tower_1_conv_3_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_4_tower_1_conv_3_conv2d_bn"
  top: "mixed_4_tower_1_conv_3_conv2d_bn"
  name: "mixed_4_tower_1_conv_3_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_4_tower_1_conv_3_relu"
  type: "ReLU"
  bottom: "mixed_4_tower_1_conv_3_conv2d_bn"
  top: "mixed_4_tower_1_conv_3_conv2d_relu"
}
layer {
  name: "mixed_4_tower_1_conv_4_conv2d"
  type: "Convolution"
  bottom: "mixed_4_tower_1_conv_3_conv2d_relu"
  top: "mixed_4_tower_1_conv_4_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
  }
}
layer {
  name: "mixed_4_tower_1_conv_4_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_4_tower_1_conv_4_conv2d"
  top: "mixed_4_tower_1_conv_4_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_4_tower_1_conv_4_conv2d_bn"
  top: "mixed_4_tower_1_conv_4_conv2d_bn"
  name: "mixed_4_tower_1_conv_4_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_4_tower_1_conv_4_relu"
  type: "ReLU"
  bottom: "mixed_4_tower_1_conv_4_conv2d_bn"
  top: "mixed_4_tower_1_conv_4_conv2d_relu"
}
layer {
  name: "AVE_pool_mixed_4_pool"
  type: "Pooling"
  bottom: "ch_concat_mixed_3_chconcat"
  top: "AVE_pool_mixed_4_pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "mixed_4_tower_2_conv_conv2d"
  type: "Convolution"
  bottom: "AVE_pool_mixed_4_pool"
  top: "mixed_4_tower_2_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_4_tower_2_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_4_tower_2_conv_conv2d"
  top: "mixed_4_tower_2_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_4_tower_2_conv_conv2d_bn"
  top: "mixed_4_tower_2_conv_conv2d_bn"
  name: "mixed_4_tower_2_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_4_tower_2_conv_relu"
  type: "ReLU"
  bottom: "mixed_4_tower_2_conv_conv2d_bn"
  top: "mixed_4_tower_2_conv_conv2d_relu"
}
layer {
  name: "ch_concat_mixed_4_chconcat"
  type: "Concat"
  bottom: "mixed_4_conv_conv2d_relu"
  bottom: "mixed_4_tower_conv_2_conv2d_relu"
  bottom: "mixed_4_tower_1_conv_4_conv2d_relu"
  bottom: "mixed_4_tower_2_conv_conv2d_relu"
  top: "ch_concat_mixed_4_chconcat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "mixed_5_conv_conv2d"
  type: "Convolution"
  bottom: "ch_concat_mixed_4_chconcat"
  top: "mixed_5_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_5_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_5_conv_conv2d"
  top: "mixed_5_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_5_conv_conv2d_bn"
  top: "mixed_5_conv_conv2d_bn"
  name: "mixed_5_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_5_conv_relu"
  type: "ReLU"
  bottom: "mixed_5_conv_conv2d_bn"
  top: "mixed_5_conv_conv2d_relu"
}
layer {
  name: "mixed_5_tower_conv_conv2d"
  type: "Convolution"
  bottom: "ch_concat_mixed_4_chconcat"
  top: "mixed_5_tower_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 160
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_5_tower_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_5_tower_conv_conv2d"
  top: "mixed_5_tower_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_5_tower_conv_conv2d_bn"
  top: "mixed_5_tower_conv_conv2d_bn"
  name: "mixed_5_tower_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_5_tower_conv_relu"
  type: "ReLU"
  bottom: "mixed_5_tower_conv_conv2d_bn"
  top: "mixed_5_tower_conv_conv2d_relu"
}
layer {
  name: "mixed_5_tower_conv_1_conv2d"
  type: "Convolution"
  bottom: "mixed_5_tower_conv_conv2d_relu"
  top: "mixed_5_tower_conv_1_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 160
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
  }
}
layer {
  name: "mixed_5_tower_conv_1_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_5_tower_conv_1_conv2d"
  top: "mixed_5_tower_conv_1_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_5_tower_conv_1_conv2d_bn"
  top: "mixed_5_tower_conv_1_conv2d_bn"
  name: "mixed_5_tower_conv_1_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_5_tower_conv_1_relu"
  type: "ReLU"
  bottom: "mixed_5_tower_conv_1_conv2d_bn"
  top: "mixed_5_tower_conv_1_conv2d_relu"
}
layer {
  name: "mixed_5_tower_conv_2_conv2d"
  type: "Convolution"
  bottom: "mixed_5_tower_conv_1_conv2d_relu"
  top: "mixed_5_tower_conv_2_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
  }
}
layer {
  name: "mixed_5_tower_conv_2_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_5_tower_conv_2_conv2d"
  top: "mixed_5_tower_conv_2_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_5_tower_conv_2_conv2d_bn"
  top: "mixed_5_tower_conv_2_conv2d_bn"
  name: "mixed_5_tower_conv_2_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_5_tower_conv_2_relu"
  type: "ReLU"
  bottom: "mixed_5_tower_conv_2_conv2d_bn"
  top: "mixed_5_tower_conv_2_conv2d_relu"
}
layer {
  name: "mixed_5_tower_1_conv_conv2d"
  type: "Convolution"
  bottom: "ch_concat_mixed_4_chconcat"
  top: "mixed_5_tower_1_conv_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 160
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "mixed_5_tower_1_conv_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_5_tower_1_conv_conv2d"
  top: "mixed_5_tower_1_conv_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_5_tower_1_conv_conv2d_bn"
  top: "mixed_5_tower_1_conv_conv2d_bn"
  name: "mixed_5_tower_1_conv_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_5_tower_1_conv_relu"
  type: "ReLU"
  bottom: "mixed_5_tower_1_conv_conv2d_bn"
  top: "mixed_5_tower_1_conv_conv2d_relu"
}
layer {
  name: "mixed_5_tower_1_conv_1_conv2d"
  type: "Convolution"
  bottom: "mixed_5_tower_1_conv_conv2d_relu"
  top: "mixed_5_tower_1_conv_1_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 160
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
  }
}
layer {
  name: "mixed_5_tower_1_conv_1_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_5_tower_1_conv_1_conv2d"
  top: "mixed_5_tower_1_conv_1_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_5_tower_1_conv_1_conv2d_bn"
  top: "mixed_5_tower_1_conv_1_conv2d_bn"
  name: "mixed_5_tower_1_conv_1_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_5_tower_1_conv_1_relu"
  type: "ReLU"
  bottom: "mixed_5_tower_1_conv_1_conv2d_bn"
  top: "mixed_5_tower_1_conv_1_conv2d_relu"
}
layer {
  name: "mixed_5_tower_1_conv_2_conv2d"
  type: "Convolution"
  bottom: "mixed_5_tower_1_conv_1_conv2d_relu"
  top: "mixed_5_tower_1_conv_2_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 160
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
  }
}
layer {
  name: "mixed_5_tower_1_conv_2_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_5_tower_1_conv_2_conv2d"
  top: "mixed_5_tower_1_conv_2_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_5_tower_1_conv_2_conv2d_bn"
  top: "mixed_5_tower_1_conv_2_conv2d_bn"
  name: "mixed_5_tower_1_conv_2_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_5_tower_1_conv_2_relu"
  type: "ReLU"
  bottom: "mixed_5_tower_1_conv_2_conv2d_bn"
  top: "mixed_5_tower_1_conv_2_conv2d_relu"
}
layer {
  name: "mixed_5_tower_1_conv_3_conv2d"
  type: "Convolution"
  bottom: "mixed_5_tower_1_conv_2_conv2d_relu"
  top: "mixed_5_tower_1_conv_3_conv2d"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 160
    bias_term: false
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
  }
}
layer {
  name: "mixed_5_tower_1_conv_3_batchnorm"
  type: "BatchNorm"
  bottom: "mixed_5_tower_1_conv_3_conv2d"
  top: "mixed_5_tower_1_conv_3_conv2d_bn"
  batch_norm_param {
    moving_average_fraction: 0.9997
    eps: 0.001

  }
}
layer {
  bottom: "mixed_5_tower_1_conv_3_conv2d_bn"
  top: "mixed_5_tower_1_conv_3_conv2d_bn"
  name: "mixed_5_tower_1_conv_3_batchnorm/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
